{
    "source": {
        "categories": [
            {
                "name": "Buddhavacana",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "The Sutra of Taking Refuge in the Three Jewels",
                "enDesc": "Toh0225",
                "enShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "The Sutra of Taking Refuge in the Three Jewels",
                "language": "en",
                "versionSource": "",
                "completestatus": "done",
                "content": [],
                "direction": "ltr"
            },
            {
                "title": "聖三歸依[zh]",
                "language": "zh",
                "versionSource": " ",
                "completestatus": "done",
                "direction": "ltr",
                "content": [
                    [
                      "-",
                      "-",
                      "聖三歸依^1[【初稿譯者原有腳註】聖三歸依：此處亦可解為「歸依三聖」，而從梵藏語詞的相互參照來看，三聖（āryatri/འཕགས་པ་གསུམ）的意思即是三寶，所以歸依三聖，即為歸依三寶。因此，譯為聖三歸依或歸依三聖，意義皆相同。]大乘經",
                      "頂禮三寶。",
                      "如是我聞：一時，",
                      "世尊在舍衛城祇樹給孤獨園，",
                      "與大比丘僧千二百五十人俱。",
                      "爾時，具壽舍利子獨居靜處，",
                      "心生是念：",
                      "「善逝法主^2[法主：原文寫做ཆོས་ཀྱི་རྗེ，梵文為dharma-svāmin，亦可譯為「法尊」，為佛的別號之一，其義為「佛法之主、說法者之主尊」。然於漢譯大藏經中，多將之譯為「法主」，因此隨順漢譯常例，譯為「法主」（ཆོས་ཀྱི་མངའ་བདག）。例如：東晉三藏瞿曇僧伽提婆譯《中阿含經．卷一．七法品．水喻經第四》：「世尊為法本，世尊為法主，法由世尊…」（CBETA, T01, no",
                      "我當前往，問此等義：若具信善男子、善女人，歸依^3[歸依：黑水城所藏《佛說聖大乘三歸依經》（俄TK121號、俄TK122號）中，德慧譯為「以虔誠心歸依」。]於佛，歸依於法，及比丘僧，是人得福，當有幾許^4[是人德福，當有幾許：原文寫做ཅིག་སོགས་པར་འགྱུར་བ，為疑問式表述。德慧則將之譯為直述否定句「獲福若干，不能知量」。]？」",
                      "爾時，具壽舍利子，於日晡時^5[於日晡時：原文寫做ཕྱེ་མ་རེད་ཀྱི་དུས，漢文也寫做「餔時」，義指接近黃昏之時，約為申時（下午3-5點）。鳩摩羅什於《佛說華手經》中，將之譯為「於日晡時」（CBETA, T16, no",
                      "詣世尊所。至已，",
                      "禮世尊足，退坐一面。",
                      "坐已^7[坐已：原文寫做ཕྱོགས་གཅིག་ཏུ་འདུག་ནས，完整譯法為「坐一面已」。漢文古譯佛經中，往往將此句略去不譯。由於前句末已有「坐一面」，為俾行文流暢，此處將「一面」略去不譯。]，白世尊言^8[白世尊言：完整譯文應做「具壽舍利子白世尊言」。考量到在此段敘事之中，行動的主體唯有具壽舍利子一人，並無他者，且漢文古譯佛經往往將「至已」之後的主詞略去不譯，德慧譯本亦做「退坐一面，而白佛言」。因此，為俾行文順暢，此處亦略去主詞「具壽舍利子」不譯。特此說明。]：",
                      "「大德！向我獨居靜處，方正住時，心生是念：",
                      "『若具信善男子、善女人，歸依於佛，歸依於法，及比丘僧，是人得福，當有幾許？』^9[德慧譯本中，此段之後，尚有啟請世尊演法的啟白：「唯願世尊，以大慈悲，願垂演說。」]」",
                      "如是問已，世尊告具壽舍利子曰：",
                      "「舍利子！汝為利益安樂眾生，悲愍世間，令得義利^10[令得義利：原文寫做སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེའི་དོན，直譯可譯做「為大眾義利」或「為利大眾」。考量此處與「利益安樂眾生」一句的受詞，在藏文中皆為སྐྱེ་བོ，也即眾生或大眾之義，今參考地婆訶羅所譯《方廣大莊嚴經．卷第一》（CBETA 2020.Q3, T03, no",
                      "汝詣如來^11[詣如來所：原文寫做，直譯可譯做「詣如來前」。今考量漢譯多寫做「詣如來所」，故隨順漢譯常例。特此說明。]，欲問此義。",
                      "^12[【初稿譯者原有腳註】通常在佛陀讚揚當機眾「請問此義」之後，還會緊接著加上「善哉！善哉」。]舍利子！我今當以譬喻宣說，令汝知之^13[之：原文寫做དོན་དེ་ཉིད，專指同段前文「欲問此義」的「此義」。為俾行文順暢，今譯為代名詞「之」字，做為替代。特此說明。]。」",
                      "「此瞻部洲，并諸小洲，縱廣七千由旬。",
                      "設若有人，具足如是神變威力：",
                      "能移瞻洲所居有情，至他方世界，",
                      "［亦令彼地，］[14]平正如掌；",
                      "復以七寶建塔，所謂：",
                      "金、銀、琉璃、玻璃、赤珠、瑪瑙、硨磲^15[金、銀、琉璃、玻璃、赤珠、瑪瑙、硨磲:德慧譯為「金、銀、瑠璃、硨(原件用字為「 」)璖、瑪瑙(原件用字為「 」)、珊瑚、琥珀、真珠等」(俄TK 121、俄 TK 122)，在內容與順序上與藏文本略有不同。]，量等瞻洲，積至梵世；",
                      "復以天香、天華^16[天香、天華：德慧譯為「天花、天香」。]、天鬘、天蓋、幢幡，供養彼塔。",
                      "是人復具如是神力：",
                      "能移四大海水，至他方世界，",
                      "［復以］摩魯迦^17[摩魯迦：藏文轉寫的梵文做maruka，其義不詳，疑為地名，待考。今採音譯。德慧將之譯為「上妙」。]麻油滿盛，如四大海，中立燈炷，量等須彌，",
                      "如是曠劫，燃燈不絕。",
                      "舍利子！於意云何？",
                      "是人以此，得福多不？」",
                      "白言：「甚多，世尊！甚多，善逝！",
                      "出過一切聲聞、獨覺。",
                      "世尊！此乃如來^18[ 如來：德慧譯本中做「善逝」。]境界。",
                      "善逝！此乃如來境界。」",
                      "告曰：「舍利子！是人^19[是人：原文寫做སྔ་མ，義為「前者」，也就是前述具足神力之人。為俾理解與閱讀便利，將之改譯為「是人」。特此說明。]所得福蘊，比善男子、善女人，歸依於佛，歸依於法，歸依於僧，所得福蘊，百分不及一，千分不及一，",
                      "百千分、數分、計分乃至優波尼沙陀分，亦不及一。」",
                      "說是法門時，三千大千世界動，遍動，等遍動；",
                      "震，遍震，等遍震；",
                      "涌，遍涌，等遍涌。",
                      "^20[德慧譯本寫做「佛說如是此法門時，三千大千世界六種震動，所謂：動，遍動，等遍動；起，遍起，等遍起；踴，遍踴，等遍踴；震，遍震，等遍震；吼，遍吼，等遍吼；擊，遍擊，等遍擊。」以上六種地動相為佛陀轉法輪時的兆相之一，《大方廣佛華嚴經疏．卷八》對此做了解釋：「此六各三，成十八相：搖颺不安為動，自下漸高為起，忽然騰舉為踊，隱隱出聲為震，雄聲郁遏為吼，砰磕發響為擊。」（CBETA, T35, no",
                      "諸天亦出鼓聲。",
                      "具壽阿難即白佛言：",
                      "「世尊！當何名此法門？云何受持？」",
                      "世尊告曰：",
                      "「阿難！是名『無邊門成就』法門^21[是名無邊門成就法門：原文寫做ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྒོ་མཐའ་ཡས་པས་བསྒྲུབ་པ，德慧將之譯為「是經名為三歸依經，亦名成就無邊門」。]，以是名字，汝當受持。",
                      "汝^22[汝：文中佛陀並未明確指出受詞為何，此處「汝」字，係參考《雜阿含經》譯法而添譯，用於泛指一切聞受此經者，也可用於專指舍利子與阿難二位當機眾。特此說明。]於此義，應如是見，如是受持。」",
                      "世尊說是語已，",
                      "具壽舍利子及諸比丘，^23[具壽舍利子及諸比丘:原文寫做 ཚ་ེ དང་ལྡན་པ་ཤཱ་རའི ་ི བུ་དང་། དག་ེ སླངོ ་གཞན་དག་ཀྱང་་་་་་，義為「具壽舍利子以及舍利子本人以外的比丘們，也都...」，可直譯為「具壽 舍利子及餘比丘」。由於此處的「餘比丘」即是當時會中的「諸比丘」，為俾 誦讀流暢，在不影響原義的前提下，將「餘」字改為「諸」字。特此說明。另， 於德慧譯本中，在此段關於聽眾身分的記述方面，內容較藏譯本為多，寫做「具 壽舍利子及大比丘眾，天、龍、夜义、乹(原件用字為「 」)闥婆、阿脩羅、 迦摟羅、緊那羅、摩睺羅伽，人、非人等一切大眾」。]於佛所說，稱揚讚歎。",
                      "聖三歸依大乘經。",
                      "印度親教師一切智天與主校譯師佛僧白則（吉祥積）翻譯、校訂、抉擇。"
                    ]
                  ]
            }
        ]
        
    },
    "target": {
        "categories": [
            {
                "name": " སངས་རྒྱས་ཀྱི་བཀའ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བའི་མདོ།",
                "heDesc": "Toh0225",
                "heShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བའི་མདོ།",
                "language": "bo",
                "versionSource": "",
                "completestatus": "done",
                "direction": "ltr",
                "content": [
                    [
                      "༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨཱ་རྱ་ཏྲི་ཤ་ར་ཎ་ག་མ་ན་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། Toh0225",
                      "བོད་སྐད་དུ།",
                      "འཕགས་པ་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།",
                      "དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །",
                      "འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།",
                      "བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན།",
                      "དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །",
                      "དེ་ནས་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཅིག་པུ་དབེན་པར་འདུག་པ་དང་།",
                      "སེམས་ཀྱིས་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་འདི་ལྟ་བུ་སྐྱེས་སོ། །",
                      "སྟོན་པ་ནི་བདག་གི་མངོན་སུམ་དུ་གྱུར་ན། བདེ་བར་གཤེགས་པ་ཆོས་ཀྱི་རྗེའི་སྤྱན་སྔར་བདག་སོང་ལ།",
                      "རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་དང་ལྡན་པ་གང་ལ་ལ་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་བའི་གང་ཟག་དེའི་བསོད་ནམས་ཇི་སྙེད་ཅིག་སོགས་པར་འགྱུར་བའི་དོན་དེ་ཞུ་བར་བྱའོ་སྙམ་དུ་སེམས་སོ། །",
                      "དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ཏེ།",
                      "བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།",
                      "བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །",
                      "ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །",
                      "བཙུན་པ་བདག་གཅིག་པུ་དབེན་པར་མཆིས་ཏེ། ནང་དུ་ཡང་དག་འཇོག་ལ་མཆིས་པ་ན་སེམས་ཀྱིས་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་འདི་ལྟ་བུ་སྐྱེས་ཏེ།",
                      "རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་དང་ལྡན་པ་གང་ལ་ལ་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིས་པའི་གང་ཟག་དེའི་བསོད་ནམས་ཇི་སྙེད་ཅིག་སོགས་པར་འགྱུར་སྙམ་བགྱིད་ལགས་སོ། །",
                      "དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །",
                      "ཤཱ་རིའི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེའི་དོན་དང་། ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཞུས་པ་ལེགས་སོ་ལེགས་སོ། །",
                      "གང་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་འོངས་ཏེ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་དེ་ནི་",
                      "ཤཱ་རིའི་བུ་དོན་དེ་ཉིད་རྣམ་པར་ཤེས་པར་བྱ་བའི་ཕྱིར་དཔེས་བསྟན་པར་བྱ་སྟེ།",
                      "སྐྱེས་བུ་གང་ཟག་འགའ་ཞིག་རྫུ་འཕྲུལ་གྱི་མཐུ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་པས་",
                      "གང་འདི་འཛམ་བུའི་གླིང་དང་ཉེ་བའི་གླིང་ཞེང་དང་། སྲིད་དུ་དཔག་ཚད་བདུན་སྟོང་ཡོད་པའི་འཛམ་བུའི་གླིང་",
                      "དེ་ན་གང་སྲོག་ཆགས་གནས་པ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་བཀོད་དེ།",
                      "ལག་མཐིལ་ལྟར་མཉམ་པར་བྱས་པར་",
                      "རིན་པོ་ཆེ་སྣ་བདུན་ལ་འདི་ལྟ་སྟེ།",
                      "གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། མུ་ཏིག་དམར་པོ་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་རྣམས་ལས་འཛམ་བུའི་གླིང་ཙམ་གྱི་མཆོད་རྟེན་སྲིད་དུ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་ལ་ཐུག་པར་བརྩིགས་ཏེ།",
                      "མཆོད་རྟེན་དེ་ལ་ལྷའི་སྤོས་དང་། ལྷའི་མེ་ཏོག་དང་། ལྷའི་ཕྲེང་བ་དང་། ལྷའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བྱས་ལ།",
                      "དེ་ནས་སྐྱེས་བུ་དེ་རྫུ་འཕྲུལ་གྱི་མཐུ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་པས།",
                      "གང་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆུ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་བྱོ་སྟེ།",
                      "མ་རུ་ཀའི་ཏིལ་མར་གྱིས་རྒྱ་མཚོ་ཆེན་པོ་བཞི་ལྟར་བཀང་བའི་ནང་དུ་སྙིང་པོ་རི་རབ་ཙམ་བཙུགས་ལ།",
                      "བསྐལ་པ་མང་པོའི་མཐའ་ཇི་སྲིད་པར་མར་མེའི་རྒྱུན་མི་འཆད་པར་བུས་ན།",
                      "ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས།",
                      "སྐྱེས་བུ་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་སོགས་སྙམ་མམ།",
                      "གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །",
                      "ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལས་འདས་པ་ལགས་ཏེ།",
                      "བཅོམ་ལྡན་འདས་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལོ། །",
                      "བདེ་བར་གཤེགས་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལོ། །",
                      "བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ།",
                      "སྟོང་དང་། བརྒྱ་སྟོང་གི་ཆ་དང་། གྲངས་དང་། རྒྱུ་དང་། བགྲང་བར་ཡང་ཉེ་བར་མི་འགྲོའོ། །",
                      "དེ་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས།",
                      "འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ།",
                      "ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ། །",
                      "དེའི་ཚེ་དེར་གློག་གི་རྒྱུན་ཆེན་པོ་བྱུང་ངོ་། །",
                      "ལྷ་རྣམས་ཀྱིས་ཀྱང་རྔ་སྒྲ་བསྒྲགས་སོ། །",
                      "དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །",
                      "བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། ཇི་ལྟར་གཟུང་བར་བགྱི།",
                      "བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།",
                      "ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་འདི་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྒོ་མཐའ་ཡས་པས་བསྒྲུབ་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །",
                      "དེའི་དོན་ནི་དེ་ལྟར་བལྟ་བར་བྱ་སྟེ། དེ་དེ་བཞིན་དུ་ཟུང་ཤིག །",
                      "བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།",
                      "ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། དགེ་སློང་གཞན་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།",
                      "འཕགས་པ་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།",
                      "རྒྱ་གར་གྱི་མཁན་པོ་སརྦ་ཛྙ་དེ་བ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དཔལ་བརྩེགས་ཀྱིས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།"
                    ]
                ]
            }
        ]       
    }       
}       