{
    "source": {
        "categories": [
            {
                "name": "Liturgy",
                "enDesc": "Prayers and rituals",
                "enShortDesc": "Prayers and rituals"
            },
            {
                "name": "Prayers",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Prayer of Kuntuzangpo",
                "enDesc": "",
                "enShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "Prayer of Kuntuzangpo ",
                "language": "en",
                "versionSource": " https://www.lotsawahouse.org/tibetan-masters/rigdzin-godem/prayer-of-kuntuzangpo",
                "content": [
                    [
                        "- <br>",
                        "Ho! All that appears and exists, saṃsāra and nirvāṇ  <br>  Has one ground, two paths and two forms of fruition  <br>  The magical displays of awareness and unawareness.  <br>  Through this, Samantabhadra’s prayer of aspiration,May all attain complete and perfect awakening  <br>  Within the palace of dharmadhātu, the absolute sphere.  <br> <br>",
                        "The basis of everything is uncompounded,  <br>  A self-originating expanse, vast and inexpressible,  <br>  Beyond the names ‘saṃsāra’ and ‘nirvāṇa’.  <br>  This itself, when seen, is awakening.  <br>  But in their ignorance beings wander in saṃsāra.  <br>  May all sentient beings throughout the three realms  <br>  Realise the meaning of the ineffable ground!  <br> <br>",
                        "I, Samantabhadra, know the ground’s reality,  <br>  Which is without cause or condition;  <br>  It originates by itself within this very ground,  <br>  Is unspoilt by perspective, supposition or denial,  <br>  And unstained by the darkness of unmindful delusion.  <br>  That which is self-manifest is thus without fault  <br>  When abiding in genuine intrinsic awareness,  <br>  There is no fear, even at the triple world’s demise.  <br>  Nor is there attachment to the five sensory delights.  <br>  In self-originating awareness free of concepts,  <br>  There is neither solid form nor the five poisons.  <br>  The unobstructed clarity of awareness  <br>  Is one in essence and fivefold in wisdom.  <br>  Through the ripening of the five wisdoms,  <br>  The five original buddha families arise.  <br>  And through wisdom’s further expansion  <br>  The forty-two peaceful buddhas emerge.  <br>  With the upsurge of fivefold wisdom’s power,  <br>  The sixty blood-drinking herukas appear.  <br>  Thus, ground awareness has never known delusion.  <br>  I am the primordial buddha and therefore  <br>  Through this, my prayer of aspiration,  <br>  May beings of saṃsāra’s three realms  <br>  Recognise self-originating awareness,  <br>  So that vast wisdom may be perfected.  <br> <br>",
                        "Continuously my emanations will appear  <br>  In their many billions, beyond imagining,  <br>  Manifest in varied ways according to need.  <br>  Through this, my compassionate aspiration,  <br>  May all the beings of saṃsāra’s three realms  <br>  Escape their plight among the six classes.  <br> <br>",
                        "From the very first, since awareness does not dawn  <br>  For deluded beings within the ground,  <br>  They are entirely mindless and confused.  <br>  This itself is unawareness, delusion’s cause.  <br>  And then, as if out of a sudden daze,  <br>  There is anxiety and mental disquiet,  <br>  From which notions of self and other and enmity appear.  <br>  As this habitual tendency is then reinforced,  <br>  Saṃsāra unfolds in its regular progression.  <br>  Thus, mind’s afflictions, the five poisons, develop,  <br>  And actions born of these five poisons never end.  <br>  Therefore, since the basis for beings’ delusion  <br>  Is a lack of mindfulness, an absence of awareness,  <br>  Through this, my aspiration as a buddha,  <br>  May all beings recognise their own awareness.  <br> <br>",
                        "The unawareness that is co-emergent  <br>  Is a state of mindlessness, distraction.  <br>  The unawareness that designates  <br>  Is dualistic clinging to self and other.  <br>  These two, co-emergent and designating unawareness,  <br>  Provide the basis for the delusion of all beings.  <br>  Now through this, my aspiration as a buddha,  <br>  May the dark and murky gloom of mindlessness  <br>  Among all sentient beings in saṃsāra be dispelled;  <br>  May their dualistic perceptions be purified;  <br>  And may they recognise their very own awareness.  <br> <br>",
                        "A mind of dualistic clinging is one of doubt.  <br>  From subtle attachment, once it has arisen,  <br>  Habitual tendencies gradually gain strength.  <br>  Food, wealth, clothing, home and companions,  <br>  The pleasures of the five senses, or dear relations—  <br>  Whatever is attractive brings the torment of desire.  <br>  These are the delusions of the world.  <br>  Actions based on dualistic clinging are unending.  <br>  When the fruits of attachment come to ripen,  <br>  They bring birth as a preta tormented by desire.  <br>  How wretched are the pains of hunger and thirst!  <br>  Now through this, my aspiration as a buddha,  <br>  May beings beset by craving and attachment  <br>  Neither cast aside the torment of desire  <br>  Nor pursue the craving of attachment.  <br>  But by allowing the mind to relax just as it is,  <br>  May they capture the natural state of awareness  <br>  And gain the wisdom of perfect discernment.  <br> <br>",
                        "Through the subtle stirrings of anxiety and fear  <br>  Towards the appearance of external objects  <br>  Habitual tendencies of aversion are reinforced,  <br>  Opening the way to enmity, injury and slaughte.  <br>  When the fruits of aggression come to ripen,  <br>  How harrowing will be the boilings and burnings of hell!  <br>  Now through this, my aspiration as a buddha,  <br>  May all the sentient beings of the six realms  <br>  Whenever they are beset by intense aggression,  <br>  Neither reject nor indulge it, but relax therein,  <br>  Capture the natural state of their own awareness,  <br>  And gain the wisdom of lucid clarity.  <br> <br>",
                        "When the mind grows conceited  <br>  It brings thoughts of rivalry and disdain,  <br>  And the arising of intense pride  <br>  Leads to the suffering of quarrels and disputes.  <br>  When the fruits of such karma come to ripen  <br>  They bring birth as a deva subject to passage and fall.  <br>  Now through this, my aspiration as a buddha,  <br>  May all sentient beings in whom conceit is born  <br>  Relax their minds there and then,  <br>  Capture the natural state of their own awareness  <br>  And realise the true meaning of equality.  <br> <br>",
                        "Habitual tendencies of intense dualistic clinging  <br>  Bring about the pain of self-flattery and contempt,  <br>  And by inflaming conflict, dispute and competition,  <br>  Lead to birth in the asura realm of slaughter and mutilation,  <br>  Which in turn results in descent to the domains of hell.  <br>  Now through this, my aspiration as a buddha,  <br>  May those in whom rivalry and antagonism take root  <br>  Not regard them as enemies but relax there and then,  <br>  Capture the natural state of their own awareness  <br>  And gain the wisdom of unimpeded activity.  <br> <br>",
                        "Mindlessness, indifference, distraction,  <br>  Dullness, drowsiness, oblivion,  <br>  Insensibility, laziness and stupidity  <br>  Result in helpless animal wandering.  <br>  Now through this, my aspiration as a buddha,  <br>  May the light of clear cognizance arise  <br>  In those plunged into stupidity’s gloom,  <br>  And may they gain wisdom free of thought.  <br> <br>",
                        "All sentient beings throughout the three realms  <br>  Are equal to me, the buddha, in the ground of all,  <br>  Yet for them it is but a base of mindless delusion.  <br>  And now they engage in meaningless pursuits,  <br>  With sixfold karma as if deceived by a dream.  <br>  Yet I am the primordial buddha  <br>  Guide to the six classes through my emanations.  <br>  Through this, Samantabhadra’s prayer of aspiration,  <br>  May all sentient beings without exception  <br>  Awaken within the dharmadhātu, the absolute sphere.  <br> <br>",
                        "Aho!  <br>  Henceforth, whenever a powerful yogi,  <br>  With naturally clear, undeluded awareness,  <br>  Recites this powerful aspiration,  <br>  All sentient beings who hear it  <br>  Will awaken within the course of three lives.  <br> <br>",
                        "When Rāhu seizes the sun or moon,  <br>  Whenever the earth rumbles or quakes,  <br>  At the solstices or close of the year,  <br>  Visualize yourself as Samantabhadra,  <br>  And chant this aloud so all may hear.  <br>  Then all the beings of the three realms  <br>  Will, through the yogi’s prayer of aspiration,  <br>  Gradually be freed from their suffering  <br>  And ultimately awaken as a buddha.  <br> <br>",
                        "- <br>"
                    ]
                ],
                "direction": "rtl"
            }
        ]
    },
    "target": {
        "categories": [
            {
                "name": "ཆོ་ག",
                "heDesc": "ཆོ་ག་དང་འདོན་ཆ།",
                "heShortDesc": "ཆོ་ག་དང་འདོན་ཆ།"
            },
            {
                "name": "སྨོན་ལམ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "ཀུན་ཏུ་བཟང་པོ།",
                "heDesc": "",
                "heShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "ཀུན་བཟང་སྨོན་ལམ།",
                "language": "bo",
                "versionSource": " https://www.lotsawahouse.org/bo/tibetan-masters/rigdzin-godem/prayer-of-kuntuzangpo",
                "content": [
                    [
                        "༄༅༔ ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་སྟོབས་པོ་ཆེ་ཞེས་བྱ་བ་བཞུགས་སོ༔  <br> <br>",
                        "ཧོ༔ སྣང་སྲིད་འཁོར་འདས་ཐམས་ཅད་ཀུན༔  <br>  གཞི་གཅིག་ལམ་གཉིས་འབྲས་བུ་གཉིས༔  <br>  རིག་དང་མ་རིག་ཆོ་འཕྲུལ་ཏེ༔  <br>  ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་གྱིས༔  <br>   ཐམས་ཅད་ཆོས་དབྱིངས་ཕོ་བྲང་དུ༔  <br>  མངོན་པར་རྫོགས་ཏེ་སངས་རྒྱས་ཤོག༔  <br> <br>",
                        "ཀུན་གྱི་གཞི་ནི་འདུས་མ་བྱས༔  <br>   རང་བྱུང་ཀློང་ཡངས་བརྗོད་དུ་མེད༔  <br>   འཁོར་འདས་གཉིས་ཀའི་མིང་མེད་དོ༔  <br>   དེ་ཉིད་རིག་ན་སངས་རྒྱས་ཏེ༔  <br>   མ་རིག་སེམས་ཅན་འཁོར་བར་འཁྱམས༔  <br>   ཁམས་གསུམ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས༔  <br>   བརྗོད་མེད་གཞི་དོན་རིག་པར་ཤོག༔  <br> <br>",
                        "ཀུན་ཏུ་བཟང་པོ་ང་ཡིས་ཀྱང་༔  <br>   རྒྱུ་རྐྱེན་མེད་པ་གཞི་ཡི་དོན༔  <br>   དེ་ཉིད་གཞི་ལ་རང་བྱུང་རིག༔  <br>   ཕྱི་ནང་སྒྲོ་སྐུར་སྐྱོན་མ་བཏགས༔  <br>   དྲན་མེད་མུན་པའི་དྲིས་མ་གོས༔  <br>   དེ་ཕྱིར་རང་སྣང་སྐྱོན་མ་གོས༔  <br>   རང་རིག་སོ་ལ་གནས་པ་ལ༔  <br>   སྲིད་གསུམ་འཇིག་ཀྱང་དངངས་སྐྲག་མེད༔  <br>   སྣང་སེམས་གཉིས་སུ་མེད་པ་ལ།  འདོད་ཡོན་ལྔ་ལ་ཆགས་པ་མེད༔  <br>   རྟོག་མེད་ཤེས་པ་རང་བྱུང་ལ༔  <br>   གདོས་པའི་གཟུགས་དང་དུག་ལྔ་མེད༔  <br>   རིག་པའི་གསལ་ཆ་མ་འགགས་པ༔  <br>   ངོ་བོ་གཅིག་ལ་ཡེ་ཤེས་ལྔ༔  <br>   ཡེ་ཤེས་ལྔ་པོ་སྨིན་པ་ལས༔  <br>   ཐོག་མའི་སངས་རྒྱས་རིགས་ལྔ་བྱུང༔  <br>   དེ་ལས་ཡེ་ཤེས་མཐའ་རྒྱས་པས༔  <br>   སངས་རྒྱས་བཞི་བཅུ་རྩ་གཉིས་བྱུང་༔  <br>   ཡེ་ཤེས་ལྔ་ཡི་རྩལ་ཤར་བས༔  <br>   ཁྲག་འཐུང་དྲུག་ཅུ་ཐམ་པ་བྱུང་༔  <br>   དེ་ཕྱིར་གཞི་རིག་འཁྲུལ་མ་མྱོང་༔  <br>   ཐོག་མའི་སངས་རྒྱས་ང་ཡིན་པས༔  <br>   ང་ཡི་སྨོན་ལམ་བཏབ་པ་ཡིས༔  <br>   ཁམས་གསུམ་འཁོར་བའི་སེམས་ཅན་གྱིས༔  <br>   རང་བྱུང་རིག་པ་ངོ་ཤེས་ནས༔  <br>   ཡེ་ཤེས་ཆེན་པོ་མཐའ་རྒྱས་ཤོག༔  <br> <br>",
                        "ང་ཡི་སྤྲུལ་པ་རྒྱུན་མི་ཆད༔  <br>   བྱེ་བ་ཕྲག་བརྒྱ་བསམ་ཡས་འགྱེད༔  <br>   གང་ལ་གང་འདུལ་སྣ་ཚོགས་སྟོན༔  <br>   ང་ཡི་ཐུགས་རྗེའི་སྨོན་ལམ་གྱིས༔  <br>   ཁམས་གསུམ་འཁོར་བའི་སེམས་ཅན་ཀུན༔  <br>   རིགས་དྲུག་གནས་ནས་འཐོན་པར་ཤོག༔  <br> <br>",
                        "དང་པོ་སེམས་ཅན་འཁྲུལ་པ་རྣམས༔  <br>   གཞི་ལ་རིག་པ་མ་ཤར་བས༔  <br>   ཅི་ཡང་དྲན་མེད་ཐོམ་མེ་བ༔  <br>   དེ་ཀ་མ་རིག་འཁྲུལ་པའི་རྒྱུ༔  <br>   དེ་ལ་ཧད་ཀྱིས་བརྒྱལ་བ་ལས༔  <br>   དངངས་སྐྲག་ཤེས་པ་ཟ་ཟི་འགྱུས༔  <br>   དེ་ཡང་བདག་གཞན་དགྲར་འཛིན་སྐྱེས༔  <br>   བག་ཆགས་རིམ་གྱིས་བརྟས་པ་ལས༔  <br>   འཁོར་བ་ལུགས་སུ་འཇུག་པ་བྱུང་༔  <br>   དེ་ལས་ཉོན་མོངས་དུག་ལྔ་རྒྱས༔  <br>   དུག་ལྔའི་ལས་ལ་རྒྱུན་ཆད་མེད༔  <br>   དེ་ཕྱིར་སེམས་ཅན་འཁྲུལ་པའི་གཞི༔  <br>   དྲན་མེད་མ་རིག་ཡིན་པའི་ཕྱིར༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   ཀུན་གྱི་རིག་པ་རང་ཤེས་ཤོག༔  <br> <br>",
                        "ལྷན་ཅིག་སྐྱེས་པའི་མ་རིག་པ༔  <br>   ཤེས་པ་དྲན་མེད་ཡེངས་པ་ཡིན༔  <br>   ཀུན་ཏུ་བཏགས་པའི་མ་རིག་པ༔  <br>   བདག་གཞན་གཉིས་སུ་འཛིན་པ་ཡིན༔  <br>   ལྷན་སྐྱེས་ཀུན་བཏགས་མ་རིག་གཉིས༔  <br>   སེམས་ཅན་ཀུན་གྱི་འཁྲུལ་གཞི་ཡིན༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   འཁོར་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི༔  <br>   དྲན་མེད་འཐིབས་པའི་མུན་པ་སངས༔  <br>   གཉིས་སུ་འཛིན་པའི་ཤེས་པ་དྭངས༔  <br>   རིག་པ་རང་ངོ་ཤེས་པར་ཤོག༔  <br> <br>",
                        "གཉིས་འཛིན་བློ་ནི་ཐེ་ཚོམ་སྟེ༔  <br>   ཞེན་པ་ཕྲ་མོ་སྐྱེས་པ་ལས༔  <br>   བག་ཆགས་འཐུག་པོ་རིམ་གྱིས་བརྟས༔  <br>   ཟས་ནོར་གོས་དང་གནས་དང་གྲོགས༔  <br>   འདོད་ཡོན་ལྔ་དང་བྱམས་པའི་གཉེན༔  <br>   ཡིད་འོང་ཆགས་པའི་འདོད་པས་གདུང་༔  <br>   དེ་དག་འཇིག་རྟེན་འཁྲུལ་པ་སྟེ༔  <br>   གཟུང་འཛིན་ལས་ལ་ཟད་མཐའ་མེད༔  <br>   ཞེན་པའི་འབྲས་བུ་སྨིན་པའི་ཚེ༔  <br>   བརྐམ་ཆགས་གདུང་བའི་ཡི་དྭགས་སུ༔  <br>   སྐྱེས་ནས་བཀྲེས་སྐོམ་ཡ་རེ་ང་༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   འདོད་ཆགས་ཞེན་པའི་སེམས་ཅན་རྣམས༔  <br>   འདོད་པའི་གདུང་བ་ཕྱིར་མ་སྤངས༔  <br>   འདོད་ཆགས་ཞེན་པ་ཚུར་མ་བླངས༔  <br>   ཤེས་པ་རང་སོར་གློད་པ་ཡིས༔  <br>   རིག་པ་རང་སོ་ཟིན་གྱུར་ནས༔  <br>   ཀུན་རྟོག་ཡེ་ཤེས་ཐོབ་བར་ཤོག༔  <br> <br>",
                        "ཕྱི་རོལ་ཡུལ་གྱི་སྣང་བ་ལ༔  <br>   འཇིགས་སྐྲག་ཤེས་པ་ཕྲ་མོ་འགྱུས༔  <br>   སྡང་བའི་བག་ཆགས་བརྟས་པ་ལས༔  <br>   དགྲར་འཛིན་རྟོག་པ་རག་བ་སྐྱེས༔  <br>   ཞེ་སྡང་འབྲས་བུ་སྨིན་པའི་ཚེ༔  <br>   དམྱལ་བའི་བཙོ་བསྲེགས་སྡུག་རེ་བསྔལ༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   འགྲོ་དྲུག་སེམས་ཅན་ཐམས་ཅད་ཀུན༔  <br>   ཞེ་སྡང་དྲག་པོ་སྐྱེས་པའི་ཚེ༔  <br>   སྤང་བླང་མི་བྱེད་རང་སར་གློད༔  <br>   རིག་པ་རང་སོ་ཟིན་གྱུར་ནས༔  <br>   གསལ་བའི་ཡེ་ཤེས་ཐོབ་པར་ཤོག༔  <br> <br>",
                        "རང་སེམས་ཁེངས་པར་གྱུར་པ་ལ༔  <br>   གཞན་ལ་འགྲན་སེམས་སྨད་པའི་བློ༔  <br>   ང་རྒྱལ་དྲག་པོའི་སེམས་སྐྱེས་པས༔  <br>   བདག་གཞན་འཐབ་རྩོད་སྡུག་བསྔལ་མྱོང་༔  <br>   ལས་དེའི་འབྲས་བུ་སྨིན་པའི་ཚེ༔  <br>   འཕོ་ལྟུང་མྱོང་བའི་ལྷ་རུ་སྐྱེ༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   ཁེངས་སེམས་སྐྱེས་པའི་སེམས་ཅན་རྣམས༔  <br>   དེ་ཚེ་ཤེས་པ་རང་སོར་སློད༔  <br>   རིག་པ་རང་སོ་ཟིན་གྱུར་ནས༔  <br>   མཉམ་པ་ཉིད་ཀྱི་དོན་རྟོགས་ཤོག༔  <br> <br>",
                        "གཉིས་འཛིན་བརྟས་པའི་བག་ཆགས་ཀྱིས༔  <br>   བདག་བསྟོད་གཞན་སྨོད་ཟུག་རྔུའི་ལས༔  <br>   འཐབ་རྩོད་འགྲན་སེམས་བརྟས་པ་ལས༔  <br>   གསོད་གཅོད་ལྷ་མིན་གནས་སུ་སྐྱེས༔  <br>   འབྲས་བུ་དམྱལ་བའི་གནས་སུ་ལྟུང་༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   འགྲན་སེམས་འཐབ་རྩོད་སྐྱེས་པ་རྣམས༔  <br>   དགྲར་འཛིན་མི་བྱ་རང་སར་སློད༔  <br>   ཤེས་པ་རང་སོ་ཟིན་གྱུར་ནས༔  <br>   ཕྲིན་ལས་ཐོགས་མེད་ཡེ་ཤེས་ཤོག༔  <br> <br>",
                        "དྲན་མེད་བཏང་སྙོམས་ཡེངས་པ་ཡིས༔  <br>   འཐིབ་དང་རྨུགས་དང་བརྗེད་པ་དང་༔  <br>   བརྒྱལ་དང་ལེ་ལོ་གཏི་མུག་གིས༔  <br>   འབྲས་བུ་སྐྱབས་མེད་བྱོལ་སོང་འཁྱམས༔  <br>   སངས་རྒྱས་ང་ཡི་སྨོན་ལམ་གྱིས༔  <br>   གཏི་མུག་བྱིང་བའི་མུན་པ་ལ༔  <br>   དྲན་པ་གསལ་བའི་མདངས་ཤར་ནས༔  <br>   རྟོག་མེད་ཡེ་ཤེས་ཐོབ་པར་ཤོག༔  <br> <br>",
                        "ཁམས་གསུམ་སེམས་ཅན་ཐམས་ཅད་ཀུན༔  <br>   ཀུན་གཞི་སངས་རྒྱས་ང་དང་མཉམ༔  <br>   དྲན་མེད་འཁྲུལ་པའི་གཞི་རུ་སོང་༔  <br>   ད་ལྟ་དོན་མེད་ལས་ལ་སྤྱོད༔  <br>   ལས་དྲུག་རྨི་ལམ་འཁྲུལ་པ་འདྲ༔  <br>   ང་ནི་སངས་རྒྱས་ཐོག་མ་ཡིན༔  <br>   འགྲོ་དྲུག་སྤྲུལ་པས་འདུལ་བའི་ཕྱིར༔  <br>   ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་གྱིས༔  <br>   སེམས་ཅན་ཐམས་ཅད་མ་ལུས་པ༔  <br>   ཆོས་ཀྱི་དབྱིངས་སུ་འཚང་རྒྱ་ཤོག༔  <br> <br>",
                        "ཨ་ཧོ༔  <br>   ཕྱིན་ཆད་རྣལ་འབྱོར་སྟོབས་ཆེན་གྱིས༔  <br>   འཁྲུལ་མེད་རིག་པ་རང་གསལ་ནས༔  <br>   སྨོན་ལམ་སྟོབས་ཆེན་འདི་བཏབ་པས༔  <br>   འདི་ཐོས་སེམས་ཅན་ཐམས་ཅད་ཀུན༔  <br>   སྐྱེ་བ་གསུམ་ནས་མངོན་འཚང་རྒྱ༔  <br> <br>",
                        "ཉི་ཟླ་གཟའ་ཡིས་ཟིན་པའམ༔  <br>   སྒྲ་དང་ས་གཡོས་བྱུང་བའམ༔  <br>   ཉི་མ་ལྡོག་འགྱུར་ལོ་འཕོ་དུས༔  <br>   རང་ཉིད་ཀུན་ཏུ་བཟང་པོར་བསྐྱེད༔  <br>   ཀུན་གྱིས་ཐོས་པར་འདི་བརྗོད་ན༔  <br>   ཁམས་གསུམ་སེམས་ཅན་ཐམས་ཅད་ཀུན༔  <br>   རྣལ་འབྱོར་དེ་ཡི་སྨོན་ལམ་གྱིས༔  <br>   སྡུག་བསྔལ་རིམ་གྱིས་གྲོལ་ནས་ཀྱང་༔  <br>   མཐར་ཐུག་སངས་རྒྱས་ཐོབ་པར་ཤོག༔  <br>   ཅེས་གསུངས་སོ། །​ <br>",
                        "རྫོགས་པ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དགོངས་པ་ཟང་ཐལ་དུ་བསྟན་པའི་རྒྱུད་ལས་སྨོན་ལམ་སྟོབས་པོ་ཆེ་བཏབ་པས་སེམས་ཅན་ཐམས་ཅད་སངས་མི་རྒྱ་བའི་དབང་མེད་པར་བསྟན་པའི་ལེའུ་དགུ་པ་ནས་ཁོལ་དུ་བྱུང་བའོ།        །​སརྦ་མངྒ་ལཾ། <br>"
                    ]
                ],
                "direction": "ltr"
            }
        ]
    }
}