{
    "source": {
       "categories": [
            {
                "name": "Liturgy",
                "enDesc": "",
                "enShortDesc": "Prayers and rituals"
            },
            {
                "name": "Prayers",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "The Prayer of Good Conduct",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Commentaries",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Commentary on Samantabhadras The King of Aspirations Prayer 1",
                "enDesc": "",
                "enShortDesc": "",
                "base_text_titles": [
                    "The Noble King of Prayers for Good Conduct"
                ],
                "base_text_mapping": "many_to_one",
                "link": "Commentary"
            }
        ],
        "books": [
            {
                "title": "Commentary on Samantabhadras The King of Aspirations Prayer 1",
                "language": "en",
                "versionSource": "",
                "completestatus": "done",
                "content": [],
                "direction": "ltr"
            }
        ]
        
    },
    "target": {
        "categories": [
            {
                "name": "ཁ་འདོན།",
                "heDesc": "",
                "heShortDesc": "ཆོ་ག་དང་འདོན་ཆ།"
            },
            {
                "name": "སྨོན་ལམ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "བཟང་སྤྱོད་སྨོན་ལམ།",
                "heDesc": "",
                "heShortDesc": "སྨོན་ལམ་སྟོབས་པོ་ཆེ།"
            },
            {
                "name": "འགྲེལ་པ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "《普賢菩薩行願品釋論》1",
                "heDesc": "",
                "heShortDesc": "",
                "base_text_titles": [
                    "The Noble King of Prayers for Good Conduct"
                ],
                "base_text_mapping": "many_to_one",
                "link": "Commentary"
            }
        ],
        "books": [
            {
                "title": "《普賢菩薩行願品釋論》1[zh]",
                "language": "zh",
                "versionSource": " ",
                "completestatus": "done",
                "direction": "ltr",
                "content": [
                    [
                      "<sapche>乙二 正頌\n丙一 頌正示行願\n丁一 正頌行願\n戊一 頌第一願</sapche>",
                      "<1><4>行願之名雖有十義，意祇有七，以後三合故。初二句頌所禮，次一句頌能禮，第四句明周遍，第五句辯遍因。謂所以能如是周遍者，全仗普賢行願威神之力故也。後三句別顯禮相。謂一一佛所，各有多身；一一己身，能起多禮。",
                      "<1><4>經云：一一如來所，一切剎塵禮。即此意也。",
                      "<sapche>乙二 正頌\n丙一 頌正示行願\n丁一 正頌行願\n戊一 頌第一願</sapche>",
                      "<1><6>行願之名雖有十義，意祇有七，以後三合故。初二句頌所禮，次一句頌能禮，第四句明周遍，第五句辯遍因。謂所以能如是周遍者，全仗普賢行願威神之力故也。後三句別顯禮相。謂一一佛所，各有多身；一一己身，能起多禮。",
                      "<1><6>經云：一一如來所，一切剎塵禮。即此意也。",
                      "<1><8><sapche>戊二 頌第二願</sapche>\n前偈，明所讚；唯深信二字，屬能讚因。後偈，全顯能讚。於中，前二句，明讚相；三句，明讚時；末句，正頌稱讚也。",
                      "<1><11><sapche>戊三 頌第三願</sapche>\n此文三偈。前二偈，俱前三句標供養品，後一句正申供養。後偈中，一切三世佛五字，是所供境。末句，正申供。餘皆能供因。",
                      "<1><12><sapche>戊四 頌第四願</sapche>\n第一句標所懺業。第二句明造業因。第三句指造業器。末句正申懺悔。",
                      "<1><13><sapche>戊五 頌第五願</sapche>\n此偈唯最後三字，明能隨喜，餘皆所隨喜。第一句，明六凡。於中，前四字，通標一切；後三，正明六凡。第二句，明二乘。第三句，明大乘。末句，前四字，總出聖凡功德；後三，如上已明。",
                      "<1><14><sapche>戊六 頌第六願</sapche>\n前二句，標所勸請。三句，正明勸請。末句，明所請事。",
                      "<1><15><sapche>戊七 頌第七願</sapche>\n首句標所請。次句正明勸請。三四二句述意。於中，前句明住所經時，後句述住時之益。",
                      "<1><16><sapche>戊八 合頌後三願\n己一 合頌三願</sapche>\n此一偈中，前三句，總牒前之七願功德，盡皆以善根二字收之。初所有二字，總指下七，文少不次。謂：禮，指第一願。讚，指第二願。供，指第三願。請住，指第七願。轉輪，指第六願。隨喜，指第五願。後一句，正明回向。",
                      "<1><18><sapche>己二 分頌三願\n庚一 頌第八願</sapche>\n初句標示。次四句正明隨學。六句示隨學因。七句結。末句明意。",
                      "<1><18>言天，有多義：一、天，晝也。天上日長夜短，故以晝名天。二、天名無愁惱，常受樂故。三、天名燈明，能破暗成明故。又名破惡，能破惡業，得於善業而生天故。言人，亦有多義：人者，名能多思慮。又人者，身口柔軟。又人者，名有慢。又人者，能破慢。佛稱天人師者，謂佛本為九界眾生出現於世，何以但云天人師，而不及餘師者？以三聖悟深，三途迷重，修羅憍大，非緊要機。論發心聞法者，唯天與人耳！故舉中以攝前後，曰天人師也。",
                      "<1><20><sapche>庚二 頌第九願</sapche>\n此中，前偈標能益之尊。前二句，標所依淨剎；後二句，顯能依眾會。",
                      "<1><20>後偈，為生起之願。於中：初句，所順生；下三，申願意。三句中：初句，離憂常安；次句，獲深法利；後句，滅除煩惱。難曰：願本順生，何先云佛？釋：以順生即順佛故。",
                      "<1><22><sapche>庚三 頌第十願\n辛一 別發大願\n壬一 受持願</sapche>\n頌第十願，前略後廣。此下大願亦是伽陀，回向與願大同小異。所言異者，謂回向要有功德能回，發願無有功德亦可要誓。同者，回向以願為體，總願別願皆回向故。今是回向大願。",
                      "<1><22>按十地經，有十大願：一、供養，二、受持，三、轉法輪，四、修行二利，五、成熟眾生，六、承事，七、淨土，八、不離，九、利益，十、成正覺。今即彼第二願也。經云：「願受一切佛法輪，願攝一切佛菩提，願護一切諸佛教，願持一切諸佛法。」此中初句，攝菩提。次句，持佛法。次二句，護佛教。修行戒行，為護行故。無垢，即無垢戒；無破，即不破梵行戒；無穿漏，即不缺漏戒。後四句，即彼經願受一切佛法輪。謂佛轉法輪，常有八部眾作外護聽法。此中偈意，願得一切眾生語言三昧，可用彼之語音，為彼說法也。",
                      "<1><24><sapche>壬二 修行二利願</sapche>\n此即彼第四願也。於中第四句是總，餘句為別。初句是行體，即十波羅密，除蔽清淨。前云廣大無量者，世出世間等，正辨此十波羅密之故，此初句云體也。第二句云不忘失等者，以忘失菩提心，修諸善法皆成魔業故。第三句是行業，以十度淨十蔽故。六蔽如常，第七耽滯蔽，第八退屈蔽，第九怯劣蔽，第十昧事蔽；此十隱蔽妙行，故以十度除之。後一偈是行相。前二句，是法。言世道解脫者，魔境惑業，即世間行；解脫，即出世間行。後二句，雙喻二行。蓮華，喻世間解脫，不著水故；日月，喻出世解脫，不住空故。",
                      "<1><26><sapche>壬三 成熟眾生願</sapche>\n第五句為總，餘句為別。初句離苦，二句得樂；第三豎窮，第四橫遍。後三總結長時所成因果，此即彼第五願也。",
                      "<1><28><sapche>壬四 不離願</sapche>\n此即彼第八願也。謂願於一切生處，恒不離佛及諸菩薩，得同意行故。亦名心行願，願不離一乘故。初句為總，同志一乘故。餘句為別。於中先三句，自分行同。意業同者，平等一緣故；身業同者，得如意神通故；語業同者，同說一味法故。上即三輪同。一切行願同者，若福若智，萬行皆同。前偈同行，故云自分。",
                      "<1><28>後一偈勝進同，此更成益，復顯示故。謂凡有益我之善知識者，必能為我顯示普賢行，故我亦常願也。",
                      "<1><30><sapche>壬五 供養願</sapche>\n此即彼第一願，願供勝田故。第三句為總。興廣大供故。大有六種：一、心大，無疲厭故。二、供具大，財法正行皆具足故。財供，攝在總句；正行，即第五六句。三、福田大，即第二句。四、攝功德大，即第七句中究竟普賢道，是勝功德故。五、因大，即第七句中清淨二字。如空清淨，為無常愛果，及常果之因故。六、時大，即第八句。",
                      "<1><32><sapche>壬六 利益願</sapche>\n願於一切時，恒作眾生事業，無空過故；亦名三業不空願，即彼第九願也。第一偈中，前三句，不空因；後一句，是不空果。言功德藏者，謂暫見身，則必得法身；暫聞音，則得實智慧；纔生淨信，則永斷煩惱。得如藥王焚身，得如如意珠身，名功德藏也。",
                      "<1><32>第二偈，利益時處；謂遍於時處，求能益法，利眾生故。前三句，明處遍；後句中恒字，顯時遍。演菩提行，即能益法，利眾生也。",
                      "<1><35><sapche>壬七 轉法輪願</sapche>\n謂佛轉法輪，願皆攝取，而轉授之；亦名攝法上首願，即彼第三願也。前偈明轉法輪處，若據有修行之言，應屬前願，為修行處，以前已有處，故屬此願。中偈明能轉圓音。後偈中：前二句，轉法輪時；次一句，所轉法輪；末句，能攝方便。彼經，轉法輪有四：一、轉處，二、轉時，三、攝法方便，四、轉法頓周。",
                      "<1><35>得彼經之消息，知此偈之落處。",
                      "<1><37><sapche>壬八 淨土願</sapche>\n此即彼第七願也。願清淨 他受用二土。文中並無淨土之言，以影後願故；此中具有七種淨義，故知是淨土願也。",
                      "<1><37>前四句，即第一同體淨，以同法性故。今一多互相即入，文雖辯劫念圓融，意取時中圓融之剎。五六二句，即第二自在義淨。如摩尼珠，美惡斯現，自在圓通故。文云：於一念見。舉其佛者，顯是佛土。人師子，喻指佛也。第七句，即第三因淨。因有二：一、生因，謂六度等，如維摩云「布施是菩薩淨土」云云。二、依因，又二：一、鏡智淨識為土所依，自受用土。二、後智通慧為土所依，他受用土也。此二皆是佛諸境界，境界即是相淨，謂七珍等。末句攝於三淨，以如幻二字，即第四果淨。",
                      "<1><37>果亦有二：一、所生果，即相淨，略在境界，廣則影在後承事願中。二、示現果，臨機示現故。云如幻解脫威力，即第五受用淨。謂受用淨土，離過成德，如用香飯得三昧等。今解脫煩惱，即是離過；威力之能，即是成德。彼十地經云「成就清淨道」。梵本此句無「及威力」字，有「眷屬」字；即第六住處眾生淨，人寶為嚴故。第七相淨，即攝在果淨中境界二字是也。",
                      "<1><39><sapche>壬九 承事願</sapche>\n此即彼第六願也。謂願往諸佛土，常見諸佛，恒時敬事，聽受法故。末句為總。文云往詣親近，即承事也。前偈，即承事處。於中初二句，通是真實義相；互相涉入，如帝網故。謂土土同體，不守自性，互相涉入，名真實也。第二句三世莊嚴剎，即一切相，淨土體相有差別故。第三句，即無量相，謂前二相，遍十方故。菩薩藏經，虛空中世界重數，多於大千所有微塵；但由業力，不相妨礙。一處重重尚爾，況復橫周。第四句，辯能知見。知見有二：一者所知。即前三種相是。二者能知。彼十地經云：「智皆明了現前知見。」釋云：真實義相，但可智知；餘一切相，可以眼見。梵本云：「我甚深入莊嚴剎」。深入有二：一、智深入，二、身深入。入彼莊嚴剎中承事如來，非嚴淨也。今文若云一而如一剎，則理亦無違，事更顯矣。第五句，所承事佛，照世燈，即指佛也。六七二句，即承事時，八相也；以成道至涅槃，含八相義故。",
                      "<1><42><sapche>壬十 成正覺願</sapche>\n彼亦在十，謂願與法界眾生，一時同得阿耨菩提，恒作佛事也。文有十二力：前九，明業用；後三，結因成果。於九力中，有七種業。前之六力，力字在句中間，其義更顯。一、首句宜云神通力速疾周遍，即自在業也。二、二句宜云大乘力入遍普門，謂大乘稱理，互相即入而普遍故。三、次三句即說實諦力業。謂說實諦，令物悟故。四、第六句即證教化業。謂說自所證，以教化他故；謂以菩提智，契涅槃理，故無所依。五、第七句種種說法業，具足定慧方便故。六、第八句不斷佛種業，積集菩提，相續佛種故。七、第九句法輪復住業，謂依大智慧，能淨一切諸善根故。後三言結因成果者，由內伏煩惱，外降諸魔，普賢行圓，故成佛果。亦可後三復為三業，以成圓十。八、第十句摧滅煩惱業。九、降伏諸魔怨業。十、普賢勝因業。別說十願竟。",
                      "<1><45><sapche>辛二 總結大願</sapche>\n謂稱體大願，願願智如海也。前之八海，結前九願。首句結淨土願。二句結成熟眾生願。三句結轉法輪願。四句結受持願。五句結修行二利願。六句結利益願，益由願圓故。七句有二願：親近，即承事願；供養，即供養願。諸佛海通上二願。八句即不離願，若離同見同志法緣眷屬，修行即厭倦也。",
                      "<1><45>後之一偈，成正覺願；以三世因圓，正覺果滿故。",
                      "<1><47><sapche>丁二 願同二聖\n戊一 遍同普賢</sapche>\n科言同，謂同一普賢行故，同一真法界故。言長子者，最尊勝故。偈云：「普賢真身遍法界，能為世間自在主；無始無終無生滅，性相常住等虛空。」既云無始，即是長義。不捨因行，故為佛子。",
                      "<1><47>偈出金剛瑜伽頂經。釋云：「所遍，即 一真法界。能遍，即普賢也。世間，指一切緣起。諸法主，即最初能生義。無始終，同真界也。」",
                      "<1><59><sapche>戊二 雙齊二聖</sapche>\n文殊表解，解發願故。普賢表行，能起行故。故願與行，分屬二聖，理實智通。又表理智，一相契合。行願相扶，所以雙同。",
                      "<1><60><sapche>戊三 結歸回向</sapche>\n上來諸願屬回向，彌顯三段同一回向。",
                      "<1><64><sapche>丙二 頌顯經勝德\n丁一 超頌顯餘眾行德\n戊一 超頌勝果\n己一 顯極樂勝果</sapche>\n首句願我，改是人，則彌顯矣。不生華藏，願生極樂，有四意：一、有緣故，二、使眾生心歸一處故，三、不離華藏故，四、彌陀即本師故。",
                      "<1><50><sapche>己二 總收行願無盡</sapche>",
                      "<1><52><sapche>戊二 追頌校量聞經德</sapche>",
                      "前偈能校，後偈所校，文並可知。",
                      "<1><53><sapche>丁二 追頌五果\n戊一 頌增上果</sapche>",
                      "<1><54><sapche>戊二 頌等流果</sapche>",
                      "<1><55><sapche>戊三 頌離繫果</sapche>",
                      "<1><56><sapche>v1-2 戊四 頌異熟果</sapche>",
                      "<1><56><sapche>v3-4 戊五 頌士用果</ sapche>",
                      "<1><57><sapche>戊六 頌究竟果</sapche>\n言速詣者，如我本師釋迦世尊，未成道前，苦行六年，知非究竟；即思過去諸佛，皆詣菩提樹下，降伏魔軍，成等正覺；即離其處，詣尼連河，剃髮沐浴，復食乳糜，氣力平全；詣菩提樹，即成究竟果也。",
                      "<1><58><sapche>v1-2丙三 頌勸囑受持\n丁一 頌前諸行</sapche>",
                      "<1><65><sapche>丁二 頌顯勝益</sapche>",
                      "<1><67><sapche>丁三 結成回向</sapche>"
                    ]
                ]      
            }
        ]       
    }       
}       