{
    "source": {
       "categories": [
            {
                "name": "Liturgy",
                "enDesc": "",
                "enShortDesc": "Prayers and rituals"
            },
            {
                "name": "Prayers",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "The Prayer of Good Conduct",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Commentaries",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Commentary on Samantabhadras The King of Aspirations Prayer 2",
                "enDesc": "",
                "enShortDesc": "",
                "base_text_titles": [
                    "The Noble King of Prayers for Good Conduct"
                ],
                "base_text_mapping": "many_to_one",
                "link": "Commentary"
            }
        ],
        "books": [
            {
                "title": "Commentary on Samantabhadras The King of Aspirations Prayer 2",
                "language": "en",
                "versionSource": "",
                "completestatus": "in_progress",
                "content": [],
                "direction": "ltr"
            }
        ]
        
    },
    "target": {
        "categories": [
            {
                "name": "ཁ་འདོན།",
                "heDesc": "",
                "heShortDesc": "ཆོ་ག་དང་འདོན་ཆ།"
            },
            {
                "name": "སྨོན་ལམ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "བཟང་སྤྱོད་སྨོན་ལམ།",
                "heDesc": "",
                "heShortDesc": "སྨོན་ལམ་སྟོབས་པོ་ཆེ།"
            },
            {
                "name": "འགྲེལ་པ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "《普賢菩薩行願品釋論》2",
                "heDesc": "",
                "heShortDesc": "",
                "base_text_titles": [
                    "The Noble King of Prayers for Good Conduct"
                ],
                "base_text_mapping": "many_to_one",
                "link": "Commentary"
            }
        ],
        "books": [
            {
                "title": "《普賢菩薩行願品釋論》2[zh]",
                "language": "zh",
                "versionSource": " ",
                "completestatus": "in_progress",
                "direction": "ltr",
                "content": [
                    [
                      "<1><1> <i>  v1 分二：一、釋經名 二、釋品名 <br>一、釋經名 </i>   <br> “大方廣佛華嚴經”是七種佛經命名中具足人、法、喻三者的經名。“大方廣”是法，“佛”是人，“華嚴”是喻。經題包含七義，大是體，方是相，廣是用，佛是果，華是因，嚴是總相，經是能詮。這個經題是人法雙題，法喻齊舉，體用無礙，因果周圓，所以極為殊勝，無盡法門不出於七字。 <br> 以下按所證、能證解釋經題涵義",
                      "<1><1> <i>  (一)所證——大方廣 </i>   <br> “大”，是當體得名，常遍為義。(意思是在心的本體上得名，以常住、周遍為義。) <br>一切法中，哪一法最大呢？就是真心，它豎無初際、橫絕邊涯。豎，沒有初際、後際，是無始無終、常住不滅的；橫，沒有邊涯，無內無外，遍在一切處。所以心性本體是常遍的，稱為大。 <br> 這個“大”不是一般概念上的大。一般的大，是相對的大。比如，房屋相對床說是大，相對高山又是小，房屋就它自身是安立不了大的。但體的“大”，並非“觀待而說的大”——和其它法相比而安立的大，而是“絕待的大”。因為萬法都是以心性為體，一切法都是它，和誰去對待呢？所以是絕待的大。它遍一切時處，無內無外、無始無終，可謂“大哉”。",
                      "“方”，是從法得名，以軌持為義。心性體上本具恒河沙數自性功德，攝持而永不損減漏失，叫做方。 <br>我們一般說某法有功德，比如，某工藝品有光澤、色彩、觸感等方面的品質，但只具有有限的一些品質。心性迥超萬物，具有無量無邊的性德，都是不假造作、本自圓成的。換言之，不論你是否認識到，心性本來就是這樣的大寶藏，具有恒河沙數的性德。《寶性論》說：“光明非是所作性，無別超過恒河沙，是故本來即具足，佛陀功德之諸法。”(自性光明不是因緣造作的法，與心無離無別的方式本來具有超過恒河沙數的佛陀功德法。“無離無別”，如光與鏡，熱與火，是以一體無別的方式具有的。)所以，與一念心性無離無別，就在心體上具有無量智慧、神通，當體是常樂我凈。",
                      "“廣”，從用得名，包博為義。包是包含一切；博是廣博無邊。由於體是常遍、相是無量，體上遍含一切作用。 <br> 這是說一切法中以心的作用最大。比如，電腦具有計算、編輯、播放等功能，可以起一些作用，但非常有限。心的作用則無量無邊，它橫具十界因果，像金子能打造一切金器，心隨十法界因緣能造作十法界無量果報。比如，心以大方廣為因，顯現佛法界；心修六度萬行，顯現菩薩法界；心修四諦十二緣起，顯現聲聞緣覺法界；心修五戒十善，顯現人天法界；心造十惡業，顯現惡趣法界。總之，心隨無量因緣造成無量事相，它的作用遠大於一切色法。所以，大、方、廣並非指其它，正是直說一念心性的體、相、用。",
                      "下面解釋體大、相大、用大。 <br> 為什麽是體大呢？因為“若相若性，皆同真性而常遍故”(前一“性”指無自性的空性，後一“性”指本覺真性，不論性、相，或空、有，都同於真性而恒常、周遍的緣故。)猶如鏡子所含影像和影像的空，全同於鏡光，一切法都同於本覺真性，常恒、周遍，這是體大。 <br> 所謂常，《涅槃經》雲：“所言大者，名之為常。”這是說法界體不變易。無一法在此之前，而此法先於一切，所謂“有物先天地，無形本寂寥，能為萬物主，不逐四時雕”。所以，常指本體無生無滅，它是不變異的。 <br> 所謂遍，《涅槃經》說：“其性廣博，猶如虛空。”這是說本體周遍，橫該無外，它遍於一切法中，無一法在它之外。《出現品》雲：“諸菩薩摩訶薩，不應於一法一事一身一國土一眾生見於如來，應遍一切處見於如來。”",
                      "為什麽是相大呢？因為恒沙性德周遍於本體的緣故。神會大師說：“體上本具恒沙功德，猶如真金本具千種之器。如摩尼珠本具千般萬般非色之色。若不本具，作亦不成，對亦不同，以成時無一塵之法從外入故。”體上本來具足恒河沙數的功德，比如真金體上本來具有千種金器的可塑性，才造成金碗、金瓶、金盆、金佛等，又如摩尼珠本來具有千萬種非色的色彩映照性，如果不是本具這種特性，不論怎樣打造金子，也造不成金器；不管如何用各色布對著摩尼珠，也不會映照同類的色彩，因為在成器、成色時，沒有一微塵法是從體外來的。所以，諸佛所證，唯是眾生的自性，成佛時所現前的無量功德，沒有微塵許是從心外而來的。因此，如來的無量功德全為眾生心性中本有的妙相，這是相大。",
                      "為什麽是用大呢？因為業用周普、如體包遍的緣故。前面無邊的性德之相遍含於本體，以一一如本體，所以成為大用，一一能包能遍。一入一切是“遍”，一切入一是“包”，互相涉入，無有障礙，重重無盡。 <br> 當年，憲宗皇帝詔請清涼國師入宮問法，帝問：“華嚴所詮，何謂法界？”國師答：“法界，即一切眾生身心本體。”所以，“大方廣”不是說其他，唯指當人的本性。",
                      " <i>  (二)能證——佛華嚴 </i>   <br> 大方廣是所證，能證是佛華嚴。“佛”，以覺照為義。“華”，從比喻得名，以感果、嚴身為意義，就是：由萬行圓滿成就，感得佛果；由眾德具備，莊嚴佛的十身。“嚴”是總相，能嚴是“華”，所嚴是“佛”。“嚴”，以功用立名，以資莊為義，就是以廣大的體用莊嚴法身和色身。",
                      "清涼大師以十義解釋“佛”，即法界佛、本性佛、涅槃佛、隨樂佛、成正覺佛、願佛、三昧佛、業報佛、住持佛、心佛。 <br> 一、法界佛：體性真常，叫法界佛，不論心、境，法法皆佛。這是指法身。 <br> 二、本性佛：即智慧身，智慧能徹照法界一切所知，就是眾生本覺智慧的心性之佛。 <br> 三、涅槃佛：即化身，以化用自在的緣故，教化眾生完畢，歸於寂靜，稱為涅槃佛。 <br> 四、隨樂佛：即意生身。樂是樂欲，隨是隨順，隨順眾生的樂欲，有求必應，無感不通，稱為隨樂佛。 <br> 五、成正覺佛：即菩提身。佛在菩提樹下成就佛道的緣故，稱為成正覺佛。 <br> 六、願佛：即願身。稱性大願，普周法界，稱為願佛。 <br> 七、三昧佛：即福德身。福德即是禪定，依靠大定積福圓滿，故稱三昧佛。 <br> 八、業報佛：即莊嚴身。報德相好，微妙難思，用以莊嚴法身，是由因地善業報得的緣故，稱為業報佛。 <br> 九、住持佛：即力持身。佛安住在覺悟中，攝持迷亂眾生，流現利益無窮無盡，稱為住持佛。 <br> 十、心佛：即威勢身。一切法由心而回轉，威勢威容映奪，稱為心佛。",
                      "下面解釋以“華”如何能嚴十種佛身。 <br> 華有十義：含實義、光凈義、微妙義、適悅義、引果義、端正義、無染義、巧成義、芬馥義、開敷義。 <br> 一、含實義：如蓮花中含有果實，表示法界含藏性德的緣故，以體含真實能莊嚴法身。 <br> 二、光凈義：花光耀、潔凈，表示本智明顯，無不照了，以智光明凈能莊嚴智慧身。 <br> 三、微妙義：表示一一諸行同於法界，能莊嚴化身。 <br> 四、適悅義：花開令人歡喜，表示隨眾生機宜，令他歡喜。以利他因行能莊嚴意生身。 <br> 五、引果義：以花能引生果實，表示以因行能引正覺，能莊嚴菩提身。 <br> 六、端正義：花端嚴好看，沒有殘缺、彎曲，表示行、願具足，無所缺少。以此能莊嚴願身。 <br> 七、無染義：花很潔凈，泥水不染。表示一一行門具有三昧，處世不染，能莊嚴福德身。 <br> 八、巧成義：花顯現時，很巧很妙，表示所修的德業善巧而成就，以此能莊嚴莊嚴身。 <br> 九、芬馥義：花芳香馥郁，表示住持眾德，流香彌遠，以此能莊嚴力持身。 <br> 十、開敷義：鮮花盛開，表示心花開敷，以此莊嚴威勢身。 <br> 以上十花共同莊嚴一佛，以莊嚴的功用不同，莊嚴就有十義；或者，次第以十花莊嚴十佛，即是十義。所以，花是能嚴，莊嚴前面的法界，成就十佛。確實是“芬敷萬行，榮耀眾德，圓茲行德，飾彼十身。”",
                      " <i>  (三)經 </i>   <br> “大方廣佛華嚴”是別名，“經”是通名，有十種義： <br> 一、湧泉：經義如泉湧般不會枯竭。 <br> 二、出生：從經文輾轉出生妙義，從一生十，越來越多。 <br> 三、顯示：經文顯示事相和理體(現象和本體)。 <br> 四、繩墨：判定正確和謬誤，像木材隨著繩墨而正直，人心隨著教法而遠離邪曲。 <br> 五、貫穿：一部經貫穿所說的性相之義，把事理、因果、修行次第等義穿成一貫。 <br> 六、攝持：經義攝持所化導的眾生，令其歸於本源，不令攀緣色等六塵，輪回生死。 <br> 七、常義：即萬古常規。不論過、現、未來，佛法妙義歷久彌新，不可推翻，永為法則。 <br> 八、法義：即千葉真軌。就是千頁經文真理的軌則。 <br> 九、典義：妙理圓正，沒有偏邪。 <br> 十、徑義：即超出生死的直捷路徑。",
                      "以上七字經題，展開便是無量法海。清涼國師講了一條“展卷難思”(展卷：展是展開，卷是收卷。)，意思是：本於清凈法界，最初開為理、智二門；理又以體、相、用開為大方廣，智又以因、果開為佛華嚴；經詮大方廣佛華嚴六字，總共七字經題；七字展開，是一卷《普賢行願品》，所證法界是大方廣，能證普賢行願是佛華嚴；一卷《普賢行願品》再展開，就是一部《華嚴經》，五周因果都是佛華嚴的因果，所證都是大方廣；《華嚴經》再展開，則無窮無盡。就“收卷”而言，無盡法界收為華嚴九會；華嚴九會收為《普賢行願品》；《普賢行願品》收為《大方廣佛華嚴經》經題；經題收為理、智二分；理智融合為一真法界，能所雙亡、事理雙寂故。所以是“舒則彌綸法界，卷則足跡難尋”——展開，經的妙義遍滿無邊法界；收攝，了無蹤跡可尋。即舒恒卷，即卷恒舒，即是展卷無礙。總之，或展開、或收卷、或廣演、或簡說，都是一部《大方廣佛華嚴經》。 <br> 經雲：“無量無邊法門海，一言演說盡無余”，無量無邊的法門海，一個言辭就完全說盡了，這是“即舒恒卷”。又雲：“如來於一語言中演說無邊契經海”，一個言辭中演說了無邊契經海，一字中具足無盡法義，這是“即卷恒舒”。",
                      "<1><1> <i>   v2 二、释品名 </i>   <br> 《入不思议解脱境界普贤行愿品》，从所入、能入、入三方面作解释。“所入”，是不思议解脱境界；“能入”，为普贤行愿；“入”，指智慧与法界契合，如空印于空，没有能、所。",
                      " <i>  (一)所入——不可思议解脱境界 </i>   <br> 围绕“不可思议”从三个方面解释普贤行愿所入的境界：一、为什么叫做不可思议；二、不可思议的体是解脱境界；三、以何缘故不可思议。",
                      "为什么叫做不可思议呢？言、思不及故。就是：法无名称，故语言表达不到，口欲谈而辞丧(口欲说却无言可说)；法无相状，故思维无法缘取，心将缘而虑息(心欲缘却无可缘)。法界没有一定的名称和相状，心不可思、口不可议，因此叫做不可思议。 <br> 是哪个法不可思议呢？即解脱境界。解脱有作用解脱和离障解脱。作用解脱指作用自在，解脱了束缚障碍。像《维摩诘经》所说：“有解脱，名不可思议，若菩萨住是解脱者，以须弥之高广，内芥子中等。”即安住在不可思议的解脱中，高广的须弥山可以纳入微小的芥子中。像这样，作用通彻无碍，以一现多，以小容大，一身化现无量身，一念入于一切劫等，叫做作用解脱。离障解脱是指以智慧脱离烦恼障和所知障。",
                      "两种解脱是相成的关系，以离障解脱成就作用解脱，就是内离障碍，外用自在无碍。圭峰大师说：一切诸法本自融通无碍，只是由于内心执著、累劫缠绵，才感得外境妄相阻碍。就像在平坦开阔地带露天睡眠，梦见四边障碍重重，或有险山深水，无法通过，梦心觉悟时，则所向解脱，无所障碍。 <br> 所以，但能消尽执著，自然一切境中作用自在。但得本，不愁末，只要在心上去除妄执，心光即流通无碍。《华严经》云：“无一众生而不具有如来智慧，但以妄想颠倒执著，不能证得。若离妄想，一切智、自然智、无碍智则得现前。”",
                      "境界，有分齐境、所知境。一、分齐境，如同国家有自己所处的疆域，佛与普贤所具有的功德妙用之量，人天、二乘、菩萨无法相比。二、所知境，事相、理体(现象和本体)无有边际，唯佛、普贤才能穷尽。 <br> 二种境也是相成关系：以证悟所知境而现前分齐境。证悟愈深广，功德妙用就愈广大。由证所知无边之境，故成无边功德妙用。也就是以智慧缘无边境，境无边的缘故，智也称合境无边，因此德用等同佛及普贤的量。普贤行，境界广大、周遍，就是由证悟无边的法界而现前的。所知境和分齐境上获得离障解脱和作用解脱，两种解脱不二，是不可思议。",
                      "以何缘故不可思议呢？有四种义：一、事无边故；二、理深远故；三、事理无碍故；四、以性融相，重重无尽故。也就是，一、事相(显现)极多又无障碍，广大不可思议；二、理体(本体)无有相状(离一切戏论)，甚深不可思议；三、事理不二(现空不二)，故不可思议。一切空寂而现森罗万象，显现森罗万象而无相状可得，这是事理无碍。诸法性空故，不可单作事来思维；性空缘起故，不可单作理来思维，所以不可思议；四、重重无尽，故难思议。即一切相都同一法性，既是同一法性，便可以互相融通，在一中能含摄一切，每个中又摄一切，重重无尽。",
                      " <i>  (二)能入——普贤行愿 </i>   <br> 先释行愿，再释普贤。 <br> 以上不可思议的解脱境界，如何趣入呢？以普贤行愿能入。如大鹏鸟拥有双翼，才能展翅高飞，车有二轮，才能行进，唯以行愿二者兼具才能趋入。此行愿即是称合本性的普贤行愿。 <br> “普贤”，就人、法两方面作解释。法上有体普贤和用普贤。体指当人的本觉心体，也即是诸法本源、一真法界。为什么一真法界叫做普贤呢？“体性周遍曰普，随缘成德曰贤”，心的本体周遍一切时处，一切法都以它为体，所以是普；此体随缘显现无量事相，所以是贤。所谓“随缘成德”，指理体不守自性，能随缘成就一切事法，随染缘则住生死，随净缘则至涅槃，虽然随缘染净，真性却没有丝毫改变。 <br> 用上如何是普贤呢？因为体上本有恒沙功德妙用，这些妙用一一随体周遍，以本体周遍的缘故，妙用也周遍。如何得名为普贤呢？“一即一切”名普，“一切即一”名贤。",
                      "其次，人普贤，有位前、当位、位后三种。 <br> 一、位前普贤，指地前资粮道、加行道菩萨，以“曲济无遗”为普，“邻及亚圣”为贤。地前菩萨发菩提心，虽然未必能实际救济一切众生，但意乐常存于心，故名为普。地位上，与见道圣者相邻，叫做贤。 <br> 二、当位普贤，指一至十地有学道菩萨。为什么叫普贤呢？比如初地菩萨证悟真如，遍行法界，所以一一行中都周遍法界，因为了达一切法都是人法二空的缘故。《摄大乘论》中说，菩萨入初地时，证得十百明门：一、刹那顷证得一百三摩地；二、以清净天眼能见一百国土；三、以神通力能动一百佛世界；四、能往一百佛世界教化众生；五、能以一身化现一百类身，令有情现见；六、能成就一百类所化有情；七、为利他能使身形住世一百劫；八、能知前后际一百劫事；九、能以智慧深入一百法门，洞达明了；十、能一身显现一百类眷属。其余二至十地，位位增胜。为什么当位菩萨叫普贤呢？以“德周法界”名普，“至顺调善”名贤。 <br> 三、位后普贤，指成佛不舍因门的菩萨，虽然成佛功德圆满，但不舍悲愿，为利众生隐藏实际功德，现菩萨身，示居因地，如文殊、普贤等。为什么称为普贤呢？“果无不极曰普，不舍因门曰贤”，果上彻证无余，叫做普；不舍因门，示现菩萨身，利益众生，叫做贤。",
                      "<1><4> <i>  以下偈颂内容分十二：(一)礼敬支 (二)供养支 (三)悔罪支 (四)随喜支 (五)请转*轮支 (六)请佛住世支 (七)回向支 (八)愿差别 (九)愿边际 (十)愿利益 (十一)劝受持 (十二)总回向 </i>  ",
                      "<1><5> <i>  (一)礼敬支 <br>１、三门总礼 </i>   <br>十方无量无边的世界中过去、现在、未来出世的一切诸佛，我以清净的身语意遍现在诸佛前恭敬顶礼。 <br>怎样做到身语意清净呢？关键是心。心是决定身、语的机关，心清净，带起的身、语也清净。所以顶礼时内心要至诚恭敬。什么是“礼”呢？龙树菩萨解释，礼就是极为恭敬。这就要“敬佛如佛在”，如同佛在眼前一样，身心毕恭毕敬。",
                      "<1><6> <i>  ２、身敬礼 </i>   <br>“普贤行愿力”指普贤行的愿力。“贤”是妙善之义，妙善的诸行是菩萨的内涵。对于它希求，就是愿。普贤行愿，就是对普贤行的希求之心。“力”是指愿强大到以烦恼等违品不可侵夺。 <br>颂词说：以希求普贤行的愿力，一切如来都显现在自己意的现量前，自己一身化现一切佛刹极微尘数身，一一身遍礼一切佛刹极微尘数佛。 <br>分三步： <br>一、像山河草木等一时映现在镜中那样，三世一切如来一时显现在心前。 <br>二、自己化现佛刹极微尘数的身体。 <br>三、一一身敬礼刹尘诸佛。",
                      "<1><7> <i>  ３、意敬礼 </i>   <br>《瑜伽戒品》中说：“下至以心一清净信，随念三宝真实功德，是名意礼。”以信心随念诸佛功德就是意敬礼。 <br>在一个极微尘中有三世一切佛刹极微尘数的诸佛，一一佛都安住在菩萨众会的围绕中。无尽法界的每个极微尘都是如此。深深信解在每个极微尘中都充满了一切佛刹极微尘数的诸佛。 <br>“充满”，即任何处都有一切诸佛，佛与佛之间本无间隔。“深信”就是意礼。意礼不是指观想身体去顶礼，而是深信诸佛无处不在，在一个极微尘中本有佛刹极微尘数的诸佛。以意信解佛的不可思议功德，叫做意礼。身业和语业都是以意引起的缘故，这里特别宣说意的道。",
                      "<1><8> <i>  ４、语敬礼 </i>   <br>《瑜伽戒品》中说：“下至以语一四句颂，赞佛法僧真实功德，是名语礼。”称赞如来功德即是语敬礼。 <br>对以上一切诸佛，都各以微妙舌根发出无有穷尽的音声海，每一音声流出无量微妙的言辞海，尽未来一切劫，称扬赞叹如来的甚深功德海。 <br>所赞是一切诸佛的所有功德，包括因地发菩提心乃至果地成佛的身口意不共功德。对这一切佛功德，都称扬赞叹。 <br>称赞如来的时间不是千年万年，而是尽未来一切劫。经中说：“刹尘心念可数知，大海中水可饮尽，虚空可量风可系，无人能说佛功德。”如来功德无有穷尽，故称赞之行无有穷尽。",
                      "<1><9> <i>  (二)供养支  </i>   <br>“最胜”要加在每一种供品前。如人天世界中色、形、香等都最胜妙的花，叫最胜花。 <br>以最殊胜的妙花、花鬘、种种音乐、涂香、伞盖，应有尽有，庄严美妙，都以恭敬心供献三世诸佛。",
                      "<1><10>以最胜妙的衣服、最胜妙的香、末香、烧香，种种灯、烛的光明，一一像须弥山那样高广，殷勤地供养如来。",
                      "<1><11>这一颂讲了两种能供之因：一、广大胜解心；二、普贤行愿力。“胜解”，浅的解释，就是经由闻思对净见量的境界有坚固不退的定解。尽管还没有现证不可思议的境界，但内心深深地信解“一切三世佛”，具体是信解十方三世一切佛刹的极微尘中，一一都有一切世界极微尘数的诸佛，一一佛处在菩萨海会的围绕中。 <br>对这一境界具有胜解后，以希欲普贤供养行的猛利发愿力，对三世如来遍兴供养。",
                      "<1><12> <i>  (三)悔罪支  </i>   <br>所忏的罪业，并非仅是一段时期所造的部分罪业，而是从无始至今所造的一切罪业。造业的等起是贪嗔痴三毒。造业的工具是身体、语言和心意。造业的体性有自作、教他作、见作随喜三种。除罪的方法是具足四力，即怖畏苦果生起追悔心(破恶力)，防护当来(恢复力)，深信十方诸佛具有能拔除恶业的大威神力(依止力)，通达罪业三轮无自性或念诵百字明、金刚萨埵心咒等(对治力)。 <br>念诵时，要像诸佛菩萨就在自己眼前一样，发自内心地诚恳忏悔：我无始以来以贪嗔痴从身语意所造的一切罪业，今天都在诸佛面前发露忏悔。",
                      "<1><13> <i>  (四)随喜支 </i>   <br> “十方”要贯到下面五类有情上。“五类有情”，指六道众生、声闻、缘觉、如来和菩萨。“所有功德”，指一切六道众生所修的布施、持戒、修定功德；一切声闻缘觉从预流向到阿罗汉向的有学道及无学阿罗汉果的功德；一切如来从初发心到修十波罗蜜多、证入十地乃至成佛的功德；一切菩萨从初发心到十地之间的功德。普贤随喜没有时空、种类、大小等方面的局限，没有取舍的偏执，是横遍竖穷、平等广大的随喜。 <br>念诵时，心中现出广大的随喜境——十方一切六道众生、二乘、如来、菩萨的所有功德，在忆念彼等功德后，如贫得宝般，内心数数生起欢喜心。",
                      "<1><14>(五)请转法轮支 <br>十方刹土中的世间灯佛陀，在最初成就菩提时，我都殷勤劝请为利众生转甚深广大的无上轮。",
                      "<1><15>(六)请佛住世支  <br>在十方诸佛将欲示现涅槃时，我都化现无量身合掌劝请诸佛，为了生起一切有情的现前安乐和未来利益，唯愿诸佛久住佛刹极微尘数劫，勿舍众生入于涅槃。 <br>劝请之心需要至诚恳切，身口意殷勤；劝请的发心需要广大，动机是谋求一切众生暂时、永久的利乐；劝请住世的时间，并非千百年，而是佛刹极微尘数劫。 <br>有人说：佛住世随顺因缘，在众生缘尽时自然入灭，所以请佛住世刹尘劫并不现实，必要性也不大。 <br>驳斥：一切唯心，心量无限，福德则无限，心尽善尽美则是修普贤行。祈愿为利一切众生，就会获得利益每一个众生的福德。祈愿佛住世刹尘劫，就会引发请佛住世刹尘劫的善根。修普贤愿、遵普贤行，自己就成为普贤菩萨。",
                      "<1><16>(七)回向支  <br>礼敬、供养、忏悔、随喜、请转*轮、请佛住世等的一切善根，都愿与众生一同以猛利欲乐回向成为大菩提之因。 <br>这是说，不把这些善根用于获得人天福报、证阿罗汉果，唯愿它成为大菩提之因，心中作意：积累的这一切善根都回向成佛，不求人天福报、二乘果位，唯求无上菩提。",
                      " <i>  大乘发愿和普贤愿王 <br>一、大乘发愿 <br>(一)大乘愿的体性 </i>   <br>大乘愿是思维所希求的果而寻求彼果的心。具体来说，以善了知所愿境的智慧引发，即并非为一己之利发愿获得有漏法那样，而是以殊胜的智慧发起之后，内心希求彼果，并以词句念诵相应的愿文。 <br>圭峰大师说：“心心希望佛果，不得高推圣境；念念欲乐悲济，不得退屈自欺。”(心心希求佛果，不得把此事高推于圣境，认为自己无分；念念欲度众生，不自退屈。发起这样的欲心才是大乘菩萨愿。)",
                      " <i>  (二)大乘愿的功德 </i>   <br>大乘愿是成就自他二利之因，一旦发起，不但在今生，未来其它世也能成办自他二利。即使没有以身语专门造作其事，仅凭这一愿心，为了如所愿那样实现，内心如是地希愿，则相应发愿之心，能在今生立即产生果报，并以发愿之力成办未来的一切义利。 <br>对此再作一点分析： <br>１、大乘发愿是二利之因，因是种子的意思。譬如一粒种子播在地中，就会生发枝叶花果，同样，以大乘愿为种子，今生来世会不断地显现自他二利之果。比如，释迦佛由最初发愿的功能，生生世世修习波罗蜜多、成大菩提、普度众生，无量的自他二利都是由最初的发愿而来。 <br>２、“诸法依缘生，住于意乐上，何者发何愿，将获如是果。”——这是《宣说文殊刹土功德经》中极重要的一颂，开示了唯心的妙谛。虽然我们目前还没有以身语做到所愿之事，但只要按心中的希求发愿，以此愿心就能在今生、来世成办义利。 <br>以一则公案来说明：以前佛和比丘僧到施主家去应供。有两个小乞丐，一个是国王种姓，一个是婆罗门种姓。婆罗门种姓的小孩去乞讨时，佛陀和眷属还没有受供养，所以他一无所获；国王种姓的小孩是在世尊受供后去乞讨的，他得到了很多甘美的食品。 <br>他们两个下午在路上交谈，国王种姓的小孩说：“如果我具有财产，我会在有生之年把衣服、饮食乃至一切资具都供养佛和僧众，而且恭敬承事。” <br>婆罗门种姓的小孩说：“如果我有权力做国王，我要砍掉那个光头沙门和他的眷属们的脑袋。” <br>之后，国王种姓的小孩在一棵大树的树荫下休息，其它树的树荫都在移动，只有他所在的树荫丝毫不移动。当时，当地国王去世之后没有太子，要找一位具足福德的人做国王，人们到处寻找。有人发现这个小孩，虽然已经过了中午，树荫仍然纹丝不动，所以就唤醒他，请他继承王位。后来他按自己的心愿供养了佛和佛的眷属。 <br>另一个婆罗门种姓的小孩，躺在一条交通要道上休息。马车快速奔来，压断了他的头颅，就这样死去了。(《普贤上师言教》) <br>公案中，国王种姓的小孩由一念善愿就成熟妙果。我们应该从这里得到启发，不但有意识地常常发善愿，而且使愿的所缘境、所求、时间等各方面都最大化，由此就能让愿的作用和利益无数倍地增长。",
                      " <i>  (三)大乘愿的作用 </i>   <br>具福德力的菩萨以愿力推动，将以无量身、无量光明、无量神通成办自他二利，其境界难以用语言表述。 <br>例如，阿弥陀佛的报身有八万四千相，一一相有八万四千好，一一好有八万四千光明，一一光明遍法界摄受念佛众生。众生受到佛光的照触，身心顿时柔软。这种以光明做佛事的境界，都源于阿弥陀佛的悲愿。又如，极乐世界七宝池中的水，波扬无量妙音，池中的人可随自己的意乐听到慈悲喜舍声、波罗蜜多声、空、无相、无愿声等等，这种水能做佛事的妙用，也源自阿弥陀佛的大愿。总之，阿弥陀佛无量的光明、无量的音声、无量的报化身、无量的神通力、无量的名号功德、无量的净土庄严都是从愿力流现的。像这样，三世诸佛自利利他的无边力用都来自愿力。 <br>从菩萨修道的历程来说，以愿的力量能摄受殊胜身，以此妙身恒时趣入布施、持戒等。所以，有愿摄持就能令修持善根相续不断。 <br>我们的心本来清净，但无始的颠倒习气很难一时消除，所以需要经过多生多世地努力。在我们流转生死期间，不遇佛法的胜缘就会堕落。那怎样才能保证常遇胜缘修行不退呢？在外面找不到办法，唯独能依赖的是自己的愿力，只有在心中发大愿才有保证。 <br>发普贤愿是修习大乘的核心，以愿恒时摄持悲智救度众生，行与愿互相资助，如车二轮，运行不息，直至菩提。所以修学大乘之初必须发菩提愿，这是决定义。《普贤行愿品》说：若人临命终时，最后刹那，一切诸根悉皆散坏，一切亲属悉皆舍离，一切威势悉皆退失，一切财宝无复相随，唯此愿王不相舍离，常为引导，直至菩提。所以发普贤愿是关乎生生世世自他二利的大事。在这个关口，有愿才能尽未来际坚持菩提行，无愿就像蒸沙不能做饭，大乘道一步也无法跨进。其它世间法——身体诸根、亲人眷属、财富地位都靠不住，都要舍弃。能够一切生引导我们的只有普贤愿王。",
                      " <i>  (四)大乘愿的分类 </i>   <br>胜解行地有很多种发愿，在此阶段还没有证得法界遍行义，基本情况是观见轮回的过患后愿求息灭，心缘功德后希欲修持，以此发愿：愿我未来为利有情能如是如是成就等，分门别类有众多发愿。证入初地后，发起广大的十大愿[5]。从此，乃至证得究竟菩提之间，在二到十地，发愿会辗转增上，逐渐广大、超胜、清净。 <br>可见，发愿并非一朝一夕之事，它有从狭小到广大、从肤浅到深入、从浮泛到切实的上升过程。《无量寿经》上讲，阿弥陀佛在因地经过五劫时间精勤求索，才结得四十八愿，这绝不是泛泛悠悠、有口无心之事。 <br>我们初学者在胜解行地发心随学诸佛菩萨，心开始缘愿文熏习，这是最初的发愿。随着修行增上，发愿会日益深广、切实，愿增上了又推动修行增上，像这样，愿和行彼此资助，如车二轮辗转上进，直至无上菩提。 <br>除了原则性的发愿之外，还要结合当前的时代、环境、自身的因缘条件，通过智慧仔细观察，逐步形成具体、切实的愿。所以既要有原则性的发愿，又要有具体、切实的发愿，这样逐步前进，才形成如海的大乘行愿。",
                      " <i>  二、特说普贤愿王 </i>   <br>在普贤行愿中圆满含摄了佛子的深广万行及熏习一切菩萨道次第的因果，所诠义极为深广，超胜其它一切愿，因此称为大愿王。 <br>从种类上说，佛陀稀有行为的亿万江河都汇归于普贤愿海，最极广大；从次第上说，自胜解行地开始，诸如依止善知识、皈依三宝、断恶行善、出离心、菩提心、六度四摄等所有的发愿都汇归普贤行愿，最极圆满。或者，不论增上生或决定胜的发愿，自利、他利的发愿，相应观现世量境界或相应净见量境界的发愿，净治有情世界或器世界的发愿，深观或广行的发愿等等，都摄于普贤行愿中，无不具备。从称合本性上说，普贤愿称法界心、极法界量，横说，尽十方、遍法界、极微尘数等；纵说，虚空界尽、众生界尽，普贤愿终无有尽。心性本来横遍竖穷，称合心性之量发起普贤愿，超胜一切，由以上的原因，普贤行愿成为愿中之王。 <br>发愿是极重要的，为什么呢？因为一切善行妙果都源于发愿，没有愿力就不会有实行和果证，而且由发愿上有差别，导致心态、行为、得果上也大有差别。 <br>在没有学佛之前，我们不懂得发大愿，所发的只有下劣、狭隘、短浅的愿。比如问世间人：你最大的心愿是什么？回答是五花八门的，有些想做官，有些想赚钱，有些只求温饱就行，有些梦想做某领域的专家，有些梦想当宇航员登月，有些想做坛健将，有些想像徐霞客那样踏遍天涯……。一般人受迷乱习气蒙蔽，做梦也没想过要发普贤行愿，更不必说听闻、思维、读诵、发愿，连“普贤行愿”四个字也没有福报见到，就像盲人不见太阳、蚂蚁不知沧海一样。我们有幸能听闻、学习普贤行愿，还能日日读诵、发愿，这不是世间人可比的。如果前世没有深植善根，怎么能听到华严经王的精髓——《普贤行愿品》这样最广大、光明、清净的文句呢？",
                      "世间的种种修炼家，他们也有自己的愿，比如希求长生不老、羽化成仙、飞行虚空等等，但他们根本不知道普贤行愿。虽然和普通人比，他们也想超越常人的境界，但毕竟目光短浅，连出离生死的愿也没有，更何况说发普贤愿。 <br>小乘人只求自己断烦恼解脱，随这样狭小的愿走也是迂曲的路，并不是最直接的菩提路。他们证了阿罗汉果，还要回小向大发普贤愿才能证入大方广的法界。当年佛演说华严大教时，阿罗汉中智慧第一的舍利弗和神通第一的目犍连听了都如盲如聋，可见法义高深，非阿罗汉的境界所及。这是专为四十一种地位的法身大士演说的大法，只有证得法身才能真正领会。我们现在有缘值遇，又有信心受持，这是莫大的善根因缘。",
                      "发愿大有讲究，能在发愿方面细致观察，学到发愿的方法，利益就很大。万法唯心造，心是根本，心大、愿大，果就大；心深、愿深，果就深；心遍法界、愿遍法界，果遍法界；心无尽、愿无尽，果无尽；心有无量庄严、愿成无量庄严，果现无量庄严；心有无量戒定慧，愿具无量戒定慧，果成无量戒定慧…… <br>《普贤行愿品》本是极稀有的如意宝，遗憾的是，在很多人眼里只是白纸黑字，比不上那些世间法。对于华衣美食、高档电器、奇山异水、神仙境界等等，兴趣浓厚，但对学习普贤行愿却没有那样大的意乐。这是无慧不识真宝。我们不作一番比较分析，也不容易生起信心。 <br>我们来观察，即使把世间人的愿、声闻人的愿、一般菩萨的愿加起来，也不及普贤行愿的一分。发愿时间上，有些发几年的愿，有些发一生的愿，有些发到后世，有些发到自己解脱为止，都不如普贤行愿长远。普贤行愿是无尽愿，虚空界尽、众生界尽，我愿无尽，念念相续，无有间断，身语意业，无有疲厌。",
                      "发愿范围上，一般发愿只为一人发、一家发、一国发、一世界发，想不到一开始就要遍周法界地发大愿。前者的发愿境界太过狭小，根本不称合广大心性之量。以有限量的心发有限量的愿，是不能和法界相契的。普贤愿则愿愿称法界心、极法界量，远远超过前者。 <br>发愿种类上，比如有的人只发一分布施或持戒的愿，这也不称合心性的量，心性具足一切德，为什么只求证一分呢？相比之下，普贤行愿圆满含摄无量的菩萨愿，以如海万行庄严心地，是最庄严的愿王。实际上，最庄严的是我们自性的普贤。我们喜爱欣赏外在的鲜花、蓝天、高山、大海，却不知道自性普贤比这些庄严无数倍。其实，最恢宏、最壮丽的篇章就是普贤行愿。这是有情心性贤善到极致的表现，是赞美心性最优美的旋律，是心性最畅快的舒发，是造就诸佛最圆满的蓝图，是开启无边利乐的钥匙，是证入法界的捷径。",
                      "我们要生生世世守护普贤愿王，把它铭刻在心，恒不忘失。日日受持、发愿，不断地增上大乘种性之力，以普贤行愿引导自心，直至证入佛地。 <br>本品经一上来就说，欲成就如来广大功德，应修普贤十种广大行愿，而这品经的名字也是《入不思议解脱境界普贤行愿品》，这些都赫然显示普贤行愿是成佛的关键，大乘修持以普贤行愿最为关要。 <br>法王如意宝的前世是善财童子，是普贤大士传授这部《普贤行愿品》的当机者。法王生生世世奉持、弘扬普贤行愿。以这一生来说，法王从小就和凡夫的表现不同，常常发愿不离文殊、普贤，在法王的著作中处处可见随学文殊、普贤的发愿。法王1987年带领一万余僧众在五台山同发普贤行愿，在峨嵋山、印度金刚座也是发普贤行愿。1997年号召各地念诵《普贤行愿品》一亿遍。到晚年更加重视《普贤行愿品》的念修。这些都是从善财童子亲受普贤愿王这一缘起而来。法王今生以念修普贤愿王导归极乐，这是为我们指示一条成就菩提的光明之路。了知了这些之后，我们应当追随法王趋入这条大道。",
                      "很多事虽然暂时还做不到，但可以发愿。善根深厚的人见到这部《普贤行愿品》会欢喜地按经文发愿。虽然真正称性发起普贤行愿是登地后的事，究竟圆满实现要到佛地，但不等于凡夫位不能持诵、熏习，不能依文发愿，不等于持诵、开演没有功德，恰恰相反，殊胜的愿文一历耳根、一染识田，都有极大意义。 <br>缘起远比我们想像的微妙。无意间把一粒种子撒在泥中也会长出繁硕的果实，何况以圆顿教的微妙章句内熏具恒沙性德的佛性，为什么不能开出万德庄严呢？如果我们信受佛语，经上分明讲到“果报唯佛能证知”、“我说少分之善根，一念一切悉皆圆”、“速见如来无量光，具此普贤最胜愿”、“此人不久当成就，如彼普贤菩萨行”、“所造极恶五无间，诵此普贤大愿王，一念速疾皆消灭”，再再显示了普贤行愿的巨大威力。",
                      "一切因缘都在心上创造。小乘人只希求一己解脱，为了成办这一点，一要发求解脱心，二要修戒定慧断除生死之根的人我执，他们就在这些方面积聚因缘修行，走的是一己解脱之路，最后也只修成阿罗汉果。他们愿小，果也小，愿的作用只发挥到一己证阿罗汉果为止，不能证得佛的身智、刹土。 <br>我们求证无上佛果，这是最远大的志向。那怎样在自己心上建立成佛的因缘呢？就是修习普贤行愿。在一切因缘中，这是最深广、最圆满、最直接、最合乎心性的。能对普贤行发起勇猛欲乐，就种下了圆顿种子，将来必定会证入不可思议的解脱境界。大乘菩萨在胜解行地常常以发愿来串习大乘法，苏醒大乘善根，依照《普贤行愿品》发愿就是最好的方法。",
                      "把世间人、声缘人、修普贤行愿的人放在一起作比较，就能看出在最初的发愿上有极大的差距。一点不夸张地说，在所有阿罗汉的心上都没有出现过这样大的愿。愿力不同，得果就不同，这是由缘起规律所决定的。而且，同行一件善法，由发愿不同，境界、功德也大有差异。比如手里有一个苹果，一种发心是想供养自己，另一种是想给家人分享，又一种是想供养天神，又一种是想供养三世诸佛，最后一种才称法界心、极法界量，一刹那就能积累无量福德。 <br>又比如顶礼，一般人只顶礼一尊佛，不知道一切佛同共一法身，因此就只有顶礼一佛的功德。但普贤行的礼佛是遍礼法界佛，以胜解心深信这一礼遍礼了十方三世一切佛。以什么胜解心呢？就是深信自性广大无外，没有一佛不在自性中，而且自性遍一切处，遍在三世诸佛心中。就像帝释天的因陀罗网有一千颗明珠，一切珠都影现在一珠中，一珠也显现在一切珠中。像这样从真心的层面着眼，不是从有片段、有限量的分别心上着眼。既然每个心都遍一切处，也就在每个微尘中都有三世佛，所以说“一尘中有尘数佛”。对这些有了胜解，就会从真心的层面发愿，所以趣入的层面根本不同。",
                      "所以，从什么点上进入最快速、最圆满呢？智者们都会思考这个问题，一旦观察清楚了，就会按那样的方式发愿趣入。 <br>在世俗缘起上找不到更好的趣入方法。只有以普贤行愿才能彻底打开心量，越来越接近诸佛菩萨证悟胜义的境界，这是一条极妙的证入法界之路。 <br>正是这个原因，印藏两地的修行人，不论自己课诵、做种种佛事或大众共修，没有不念诵此文发愿回向的。在五明佛学院，法王严格规定，每次传法和法会前后都要念诵《普贤行愿品》，一句不能断。还有，宗喀巴大师在《菩提道次第广论》中讲解修行轨理时，制定道次第的每步修法都依《普贤行愿品》修七支作为前行，依普贤行愿回向发愿作为结行，并赞叹说：按照普贤行愿修习七支摄尽了积资净障的扼要。",
                      "如果不按普贤愿王发愿行持，所谓的常随佛学，只是空谈而已，根本就无法趣入。这是两个方向的问题，随普贤行愿走，就可以显发佛性，证入法界；否则就与自性普贤背道而驰，堕在邪分别中，无法拓开心量。普贤行愿能像日光融化坚冰一样，化解种种偏执，显发无边妙用。 <br>其实，心往染净两种缘上转，就成了圣凡两条路，就看自己选择走哪一条。我们认清了方向，也就明白为什么需要日日奉持普贤行愿，这是需要念念回转来，回向自己的心性。比如我们都会恭敬自己，既然会恭敬自己，也就可以恭敬一切，发现前者的做法不妙善，转过来就明白：礼敬一切才合乎自己的本心。按这样发普贤愿，把本性的万善开发到极致，仍然还是那个心，只不过以前不懂得这样做。",
                      "我们傲慢时，头抬得高高的，头能昂起，也就能低下。昂起是迷乱，低下是觉悟，都是心的作用，只是转一下而已，就像手掌翻转过来还是那个手掌。以前只赞叹自己，赞叹自己爱执的人和事，说明有赞叹的能力，只不过没有用妙，现在转过来用在称赞如来上就用对了。又比如，不用别人教就懂得供养自身，以美食供养自己的身体，把自己的屋子装饰得很庄严，说明有供养的能力。我们没有被我执蒙蔽的话，全法界都是自己，以普贤行愿力转这颗供养的心放到等同心性的量上，就成了恒时遍供三世佛，也就是供养一切，这就是称性的行愿。 <br>所以，自性本来有无量妙用，就从当下的自心中开出普贤万行。为了实现这一目的，应当一切时处随学文殊的智慧和普贤的大行，本经的两偈——“文殊师利勇猛智，普贤慧行亦复然，我今回向诸善根，随彼一切常修学，三世诸佛所称叹，如是最胜诸大愿，我今回向诸善根，为得普贤殊胜行”，就是无量普贤行愿的总摄，不论是谁，只要希求成佛，就要这样发愿。",
                      "那么，这么重大的事能忘记吗？能不经常串习吗？我们虽然有佛性，但执著我的习气太强，一起念就往我执上转，念念转生死，这样走下去，当然只会显现生死的无量苦恼，这在缘起上是一条错路，决定障蔽心性。现在要想把无始以来的恶习扭转过来，就应当持之以恒，常修普贤行愿，这是显现清净法界的缘起。所以要反复地转心，先勉强自己，做任何事、修任何法都以普贤行愿摄持，让它串习成自然。 <br>关键要养成习惯。认识到普贤行愿的重要性后，无论何时何处都按那么发愿。比如朝礼神山、在佛像前、参加法会、拜见大德、放生供养……都依普贤行愿来发愿。念念不离行愿，不忘建立成佛的缘起，始终不离开这个法，才能回转万流趣入法界。通过上面的解释就知道为什么要奉《普贤行愿品》为日课，日日诵持。",
                      "憨山大师说：“修行之要，成佛之速，无越乎此。所谓一念消灭无量恶业，一念成就无量善根者。譬若金转轮王，梦入阿鼻地狱，受大剧苦。无可哀救，怕怖慞惶，奔驰狂呼，欲逃而不得。一旦叱咤，极力猛醒，向之苦事，求之而不得，现成受用，种种本自具足。此所谓梦幻法门，以智而入，唯在自心，不假外求，故曰心净则佛土净。门人郑扩发菩提心，归依净土，余教之以专诵此品，一旦生死梦破，何患不覩华藏现成受用乎。”(修行之心要、成佛之快速无有超过此普贤愿王的。所谓“一念消灭无量恶业，一念成就无量善根”，就像金轮王梦入阿鼻地狱，受大苦楚，无处求救，身心恐惧，奔驰嚎叫，欲逃不得。一旦唤他猛醒，再找向来的苦事了不可得，自己本是金轮王，种种现成受用本自具足。这叫梦幻法门，以智慧契入，唯在自己的心，不观待向外寻求，所以说“心净则佛土净”。能专门持诵此品，一旦生死梦破，不怕不见华藏世界而现成受用。)",
                      "17, 18.  <i>   (八)愿差别  <br>分十六：１、修炼意乐清净 ２、不忘菩提心之道 ３、自在无碍行 ４、利益有情 ５、披精进甲 ６、会遇同分菩萨 ７、令善知识欢喜 ８、常见如来常兴供养 ９、摄持正法 10、得无尽藏 11、趣入 12、力 13、修习对治 14、菩萨诸业 15、随学诸佛菩萨的回向 16、净土愿  <br>１、修炼意乐清净 <br> 分三：(1)修炼常随佛学意乐 (2)修炼庄严国土意乐 (3)修炼利乐有情意乐 <br> (1)修炼常随佛学意乐 </i>   <br>念这一颂时，应当发愿：我誓欲随学一切如来从因至果的善行，恒时修习圆满一切功德的普贤行。我誓愿对过去诸佛以无上的供品广修供养，又对为利众生现今安住十方的如来，如是供养；又对未来出世的天人师如是供养。愿我圆满一切常随佛学的意乐。我愿普随三世诸佛修学，速得成就无上菩提。 <br>这一愿的愿力体现在何时何处都跟随三世诸佛修学一切善行。这是为显发自性普贤，速成菩提。诸佛的德也就是我性中的德。诸佛显示给我看，告诉我“我也具有如来智慧德相，我随佛学，就显发本性的善”。凡是善都随学，叫做作普贤。自性是普贤又作普贤，当然速成普贤，所以说“速得成就大菩提”。",
                      "道理上很明白，他有孝悌，我学他，就发起自心的孝悌；他有恭敬，我学他，就发起自心的恭敬；他有平等，我学他，就发起自心的平等；他有慈悲，我学他，就发起自心的慈悲……。凡此种种，他有什么德，我学他，就开发自己的德。 <br>以这个道理，我们要真心发起随三世佛学的行愿，能够如此，决定速成无上菩提。否则，不随三世学，就仍然是不忠不孝、不诚不敬、不慈不悲、不定不慧……。虽然自性是普贤，但不称自性发愿，反而背性而为，这就成了普贤轮转六道，怎么能速成菩提呢？所以，要见机即转，转迷为悟，转恶为善；不愿转就仍然是恶众生。古人说：“把手牵他行不得，唯有自肯始相应。”",
                      "“普随三世学”：就是对一切善行都谦虚地学习。“普”对应普贤的普，“随三世学”对应普贤的贤。 <br>有人说：你讲的不对，这是讲普随佛学，不是随一切人学。没有不对，哪个有情没包括在三世诸佛中呢？哪一种善没包含在菩提的因果中呢？所以，说到“普随”就没有取一舍一的，只要是三世佛的善行，佛不论古今、道位，行不论大小、种类，只要是善，我都随学。也就是三世诸佛从因至果的善行，我都誓愿效法，一一随学，这就是华严的精神。万物是我师，一切是善知识，一切善行都效法。这是谦虚到了极点，没有了我慢才能学一切。“谦受益，满招损”，能发愿普随三世学，决定成就普贤果位 。",
                      "<1><21> <i>  2、不忘菩提心之道  </i>   <br>大家知道，要做到最圆满地利益众生，就必须成就佛的智悲力，而要成就佛的智悲力就必须修习菩提心、增长菩提行，因此需要恒不忘失菩提心。而要想做到这一点，一要成就发心的顺缘——忆念宿命、出家持戒、随有情语言说法、相续调柔勤修六度，二要断除发心违品。下面这组愿就是围绕不忘失菩提心这个核心从多方面祈愿。 <br>这一颂有三项发愿：一、常忆宿命；二、常得出家；三、修持净戒。",
                      "“菩提”指无上正等正觉。“成宿命”，即获得宿命通，对于前世的种种因缘、业行、发愿等都能清晰忆念。 <br>前二句半祈愿：愿我为求证菩提修行时，无论受生在人天等的哪一趣中，都获得宿命通，能清晰地忆念一切前世之事。以此因缘力，在一切生辗转受生死时，都能忆念居家过患和出家利益，恒时向往出家，如同不动比丘发心：我行一切菩萨行时，乃至未成正觉，唯求获得比丘所依身。 <br>这是因为在得地前在家过失会障碍菩提心，因此发愿常得出家。这是不忘菩提心的第一因缘。寂天菩萨发愿：“我未登地前，愿蒙文殊恩，常忆己宿命，出家恒为僧。”(《入行论》)",
                      "为什么要发不忘宿命常得出家的愿呢？根本愿因是为了不退失菩提心。我们知道，成就菩提需要多生的努力，如果转生死时忘记了宿命，就会迷失宿因，又随迷乱习气耽著生死。这样间断修行，就不能辗转上进。 <br>比如，沩山禅师曾在灵山会上听佛说法，但后来转生死时做过三世国王，把前世的事都忘记了。又比如，相传唐朝窥基大师转生在大将尉迟恭的家族中，经过投胎，他忘记了自己前世是修道人，作为高官子弟，沉湎在声色中。后来，玄奘大师请唐太宗下诏让他出家，他要求有一车女人、一车酒、一车肉相随，因此叫做“三车和尚”。当他带着三车来到寺院山门的时候，忽然听到一阵钟鼓声，他才恍然醒悟。从此，舍弃世间，专心修行、弘扬佛法。 <br>由此可见，为了能生生世世不忘修道、不退菩提心，一定要发不忘宿命、常得出家的誓愿。我们都修过多生多世，常常一世修行，隔世又忘记宿命，又迷失了，所以不知进进退退了多少次。为什么不能持续上进呢？一个原因就是这一愿没有发坚固，一经投胎就忘失殆尽。比如今生没有学佛前，所谓出家、修行、发菩提心、利益众生……这些能记起多少呢？也许连三宝的名字都不知道，见佛不拜、见僧不敬、见法不求，迷失到了这种地步。所以，发这条愿非常重要。",
                      "怡山禅师《礼佛发愿文》说：“生逢中国，长遇明师，正信出家，童真入道，六根通利，三业纯和，不染世缘，常修梵行，执持禁戒，尘业不侵，严护威仪，蜎飞无损，不逢八难，不缺四缘。”按这样发愿也是为了在修行菩提期间能得到圆满所依身，使自己的修行辗转上进不退。所以，大家要常常这样祈愿。 <br>为什么要发愿常得出家呢？这是因为在家学道障难很多，耽著五欲、琐事缠身，会障碍自己一心投入修持菩提。佛在《心地观经》上这样开示在家和出家的差别：出家菩萨胜过在家菩萨无数倍。为什么呢？因为出家菩萨凭借智慧力仔细观察在家的种种过失，即使在一切住宅中堆满财物也不知足，就好像大海即使容纳一切江河的水也不知足一样。",
                      "佛又说：在家人的内心常常妄想不断，执著外境种种声、色等的虚假法，不能了达真如。在无明愚痴中颠倒昏迷，不停地攀缘境界，心没有一刻安静。由妄想滋生很多贪嗔烦恼，以烦恼驱使造种种业，以业力感召六道果报。这样，以烦恼造业，以业感果，不断轮转，无休无止。出家菩萨通过这样观察而厌离世间，叫做真出家。(注意要体会佛语的深义，就是要领会，不对世间厌离的话，就会落在这样可怕的恶性循环中，数数不断地转生死轮，永无出头之日。菩萨深知这一点，就发起真实的出家心——出离三界之心。) <br>佛又说：如果有男子、女人一昼夜中出家受戒，能二百万劫不堕恶道。 <br>由以上这些原因，为了解脱、成佛、为了利益众生，我们要发愿生生世世不忘宿命、常得出家。",
                      "下面讲后十个字“修净戒，无垢无破无穿漏”： <br>“净戒”指菩萨三聚净戒——律仪戒、摄善法戒、饶益有情戒。这是一切普贤行的依处。只有把菩萨戒持得“无垢无破无穿漏”才能圆满普贤行。因此要对此猛利地发愿。 <br>龙树菩萨在注释中以如意珠的比喻这样显示清净戒无垢、无破、无穿漏的内涵： <br>世间的如意珠自性清净，不沾尘垢，不会失坏，无有过失。(“不失坏”是指由珍重如意珠，置于高幢，善加守护，不令失坏。)它能够满一切心愿，离一切热恼，避一切疾病，息一切横死，作他者利益。",
                      "菩萨三聚净戒就像如意珠，是一种心地珍宝。具体说： <br>一、菩萨净戒远离声闻乘的发心过失，其发心是有此则成佛、无此则不成佛的体性，因此戒如意珠的自性是清净的。 <br>二、菩萨净戒不染客尘——业和烦恼，所以是无垢。 <br>三、以内心恭敬一切菩萨学处的缘故，不会造作堕罪，因此是不失坏学处(无破)。 <br>四、菩萨净戒无三种过失——没有对过去法的留恋、对未来法的希求、对现在受用的耽著，因此是无过(无穿漏)。 <br>五、菩萨净戒能满足一切众生的一切愿，能遣除一切热恼，能成就人天的无量寿（是指守持菩萨戒能超出生死，成就无生无灭的法身），一味趣入利他修行。 <br>以上是发愿一切生中如是的菩萨净戒无垢、无破、无穿漏，乃至获得无上菩提之间，恒时修持。这是不忘菩提心的第二因缘。",
                      "<1><22>随顺众生语言说法之愿： <br>念这一颂时，应当发愿：不论对天、龙、夜叉、鸠槃荼、人与非人等的哪一类众生，我都以他们各自的语言为他们宣说妙法，显示增上生和决定胜的正道。这是不忘失菩提心的第三因缘。 <br>我们在发菩提心时发愿要利益天、龙等一切种类的众生。那么怎样来利益他们呢？主要是宣说正法。在宣说正法时，如果不能讲众生各自的语言，怎么能把法传入他心中呢？众生要靠语言来领受法义，为了普遍利益众生，就必须具备随类说法的能力。为此要发起此愿。",
                      "且不说在十方刹海中教化万类有情，单单在这个地球上，语言上有障碍，就不能直接为人讲法，比如只会讲汉语，就无法同外国人沟通，教化众生的事业就只局限在讲汉语的群体中。我们发菩提心引导一切种类的众生，为了实现这一目标，必须要具备随顺有情语言说法的能力。每一尊佛都圆满成就了语功德，能够一音说法令一切众生随类得解。没有这种成就，方便度就没有圆满，也就不能圆满地利他。《大日经》说：“大悲为根，菩提为因，方便为究竟。”所以，发菩提心的人都要发这条大愿。 <br>低一点说，我们发愿在人间悉以诸音而说法，就是指不论遇到说哪种语言的人，都能运用他的语言，为他传讲佛法。拓展开来，众生界中，天有多少种语言、龙族有多少种语言、旁生有多少种语言……发愿这一切语言都通达无碍，以一切音任运说法，把佛法传入每类众生的心中。",
                      "总之，发愿有两点：一、精通一切众生语言；二、具备说法的能力，能随顺有情的根机、意乐传讲妙法。 <br>虽然到九地才获得殊胜的四无碍解(法无碍解、义无碍解、词无碍解、辨无碍解)，但不是说只有到九地才发此愿，而是现在就要开始发愿，播下种子。也许我们的语言能力还不如一般人，说明我们过去世没有好好修习这一愿。未来也不会无因结果，一分耕耘，一分收获，现在就要诚恳地发愿，生生世世不懈努力，才有望圆成菩提。 <br>这样边发愿边祈祷，三宝的加持不可思议。比如，宋朝求那跋陀罗三藏，来到中国后，很多人祈请他讲《华严经》。他不通汉语，就一心一意地祈祷。晚上梦见有人一手提剑一手提头走过来，斩了他的头，又安上新头。他醒来就完全通达汉语，后来讲了几十遍《华严经》。",
                      "所以，缘起力不可思议。我们现在殷重发愿，愿力有很大作用。发普贤愿，对我们修菩提道来说，关系深远。现在起就要对普贤行殷重发希愿心，这是比生命更重要的事。《普贤行愿品》句句是心要，不能轻易忽略过去。如果没有对愿文深深地信解，殷重地发愿，我们的相续也不可能无因无缘就转变。我们过去没有真切地对普贤行发愿心，所以才虚度了无量世，直至如今也没有显发大智慧、大慈悲、大威力，没有证入不可思议的解脱境界。今生再不努力，来生也不会忽然就摇身一变。以这个原因，宗喀巴大师在《广论》中讲六度每一度的修行时，都嘱咐要把圣者地菩萨的境界串习为所愿境，这些发愿都在普贤行愿中，可以说，大乘道的心要就是普贤行。",
                      "<1><23>这是发愿生生世世坚持菩提心，勤修清净波罗蜜。其中，勤修六度是指坚持行菩提心。 <br>愿和行要彼此资助，像车的二轮、鸟的双翼一样，以愿导行、以行填愿。否则，有愿无行是空愿，有行无愿是盲行。所以单有愿心不实行也不能到达佛的果地，以这个原因，大乘道以修持六度为心要，也就是，在发起愿菩提心之后，只有实际行持六度，才能获取坚实，真正行到佛地。 <br>波罗蜜是到彼岸义。心上，有相是此岸，无相是彼岸；行上，六蔽（即六度违品——悭吝、毁戒、嗔恚、懈怠、散乱、邪慧。）是此岸，六度是彼岸；果上，生死是此岸，菩提是彼岸，也就是，诸佛从生死的此岸度过生老病死四瀑流而到达菩提彼岸。波罗蜜分六种、十种乃至无数种，一切能趣向佛菩提的修行都是波罗蜜。 <br>“勤”是指直至成佛之间精勤不息，菩提心月月修、日日修、念念修，所谓造次必于是，颠沛必于是，如呼吸一样地运转。就像人不可一日不食，菩萨不可一日不修波罗蜜，学大乘的人要发愿尽未来际修持六度，念念勤修波罗蜜。或者，“勤”是指不断上进，不得少为足，六波罗蜜未生者令生，已生者令增长，已增长者令圆满。",
                      "“恒不忘失菩提心”，“恒”是指念念不断，“不忘失”指受持不失。令菩提心念念相续，就是恒不忘失。菩萨忘失菩提心就像人断了命根一样，会中断一切菩萨万行。所以要发愿恒不忘失菩提心，对这条根本愿，要常常祈愿，比如每天早晨起床就要发愿“恒不忘失菩提心”。 <br>一切大乘的修行都以菩提心为所依，换句话说，下至施予畜生一抟之食，都要以菩提心摄持，能在做每件善行时履行菩提心誓言，就有所谓的加行发心殊胜。 <br>“恒不忘失菩提心”是总说，成就宿命、常得出家、修持净戒、勤修六度都是为了恒不忘失菩提心。菩提心是大乘道的命根，是成就一切佛功德法的种子，所以这一不忘失菩提心的愿是大乘愿的核心。忆念宿命，不忘本愿；常得出家，远离障缘；修持净戒，打牢基础；诸音说法，显扬大乘；勤修六度，真实履践，由此就成就不忘失菩提心的一切顺缘。相反，忘失宿命，戒律有垢、有破、有穿漏，不以诸音说法，六度懈废，则会忘失菩提心。所以以上这一组发愿要逐一发好。能像经中所说：“假使热铁轮，在我顶上旋，终不以此苦，退失菩提心。”就是此愿坚固的表现。",
                      "不调柔的相续摧伏了叫清净。波罗蜜指布施等十度。勤修波罗蜜就是恒时随分随力地勤修，心无疲厌。乃至获得佛果之间，何时也不忘记菩提心。要在这方面祈愿。 <br>明确地把握愿义非常重要。我们凡夫是靠心缘文句来发愿的，如果愿文的意义含糊不清，那发愿就无法操作。比如这一句，要依愿文的涵义如是祈愿：愿我世世生生无论何时都勤修波罗蜜多，愿我乃至成佛之间何时也不忘失菩提心。这应该是内心最希求的愿望，要有世间人想当明星、想做富豪那样大的热情。",
                      "为什么要发愿恒不忘失菩提心呢？《华严经》云：“忘失菩提心修诸善法，是名魔业。”我们的心一起念就有取向，发菩提心就把我们的心引向成佛；忘失菩提心，只追求一己解脱或今生来世的世间圆满，那缘起也无误地把我们的心引向二乘、引入生死、引下三涂。所以说“忘失菩提心修诸善法，是名魔业”。蕅益大师说：“若真为生死持戒，持戒亦必悟道；真为生死听经，听经亦必悟道；真为生死参禅，参禅亦必悟道；真为生死营福，营福亦必悟道。专修一法亦悟道，互相助成亦悟道，以因地真正故也。若想做律师受戒，想做法师听经，想做宗师参禅，想有权势营福，则受戒、听经、参禅、营福，必皆堕三恶趣。故智者大师云：‘为利名发菩提心，是三途因。’毫厘有差，天地悬隔。错认定盘星，醍醐成毒药。”(《灵峰宗论》)",
                      "从正面说，能恒不忘失菩提心，终将证入不可思议解脱境界。《菩提心论》云：“此菩提心能包藏一切诸佛功德法故，若修证出现，则为一切导师。若归本则是密严国土，不起于座，能成一切事。”这是说，菩提心含藏了一切诸佛的功德法，如果修法时让此菩提心出现，则成为一切世间导师。如果归于本源——不向外驰求而返归心源，则是密严国土(极乐世界)，初步说，是发菩提心归心极乐，深入说，即心土不二，如果自心能与常寂光土相应，则当下“不起于座能成一切佛事”。道绰大师说：“菩提心者，乃无上佛道之名也。若欲发心作佛者，此心广大，遍周法界；此心究竟，等若虚空；此心长远，尽未来际；此心普备，离二乘障。若能一发此心，倾无始生死有沦，所有功德回向菩提，皆能远诣佛果，无有失灭。”(最后一句意思是：如果能发起菩提心，则破除无始生死沉沦。所有功德回向菩提都能在乃至成佛之间无有失坏。《安乐集》)这一品叫《入不思议解脱境界普贤行愿品》。“愿差别”所讲的种种发愿都是趣入不可思议解脱境界的关键。以这一愿来说，世俗菩提心具有广大、究竟、长远、普备的德相，随顺法界，所以，不想证入法界则已，想证入就必须发愿“恒不忘失菩提心”。这个“恒”，可以说从胜解行地到成佛之间常不忘失，佛道还有一分没有圆满，就还要求上进；众生还有一个没有度脱，就还要行救度。这个“恒”，又可以说是事事不忘，行任何事都不忘求证菩提救度众生。这是永远不能忘的，需要时时坚固这样的发心。龙树菩萨说：“自与此世间，欲证无上觉，其本菩提心，坚固如山王。”意思是，自己和一切有情欲证得无上菩提，其根本的菩提心应当像须弥山那样坚实稳固。",
                      "南北朝的傅大士，十六岁娶妻生了普建、普成二子。 <br>二十四岁，与同里人到亭浦捞鱼，捞到后把竹笼沉入水中说：“去者适，止者留(该去的去，要留的留)。”人们都把他看成傻子。 <br>有一次，他遇到梵僧嵩头陀。嵩头陀对他说：“我们同在毗婆尸佛处发誓，现在兜率天还有衣钵在，哪一天回天宫呢？”然后让他到水边看自己的像，只见大士圆光宝盖。 <br>傅大士笑言说：“炉韛之所多钝铁，良医之门足病人(铁匠作坊里多的是钝铁，良医门前排满了病人)，度生为急，哪能思念天宫之乐呢？” <br>嵩头陀手指松山的山顶说：“那里可以居住。”大士就在彼处躬耕为生。 <br>遇到有人来偷豆麦、瓜果，大士总用竹篮笼子装满了送给他。平常白天干活、夜晚修行，曾见释迦、金粟、定光三尊佛放光融入身体。 <br>大士说：“我证得首楞严定，应当施舍田园舍宅，举办无遮大会。”大通三年，大士唱卖妻儿，得到五万钱，营办法会。 <br>承圣三年，又施舍家产，为了众生供养三宝。大士说偈：“倾舍为群品，奉供天中天，仰祈甘露雨，流澍普无边。”(为了群生倾囊施舍，供奉天中天佛陀。仰祈三宝普降甘露妙雨，利益无边众生。) <br>傅大士是弥勒化身，生生世世不忘菩提心，位居补处，仍然勤修波罗蜜。 <br>以上三颂半讲了菩提心障碍的对治法。下半颂讲发愿断除菩提心的违品。",
                      "这是发愿：愿我能断除障碍菩提心的一切罪垢，愿我成就一切妙行。 <br>“障垢”指菩提心的违品——烦恼障和所知障。具体有：一、愿菩提心障，即令今生和来世忘失菩提心的障碍——四黑法等；二、行菩提心障，即六度违品——悭吝、毁戒、嗔恚、懈怠、散乱、邪慧和三轮分别。“灭除障垢无有余”，从程度上说，细至种子习气都消尽无余；从种类上说，灭除一切烦恼障和所知障。 <br>为什么要灭除障垢尽无余呢？以一个公案来说明： <br>古代有个老修行，在大众会下住了很长时间，肚量宽、待人厚道，常常劝人放下。 <br>有人问他：“你这样劝人，自己做到了没有？” <br>他说：“我三十年前就断无明了，还有什么放不下呢？”",
                      "后来他觉得自己在大众中还是有些不自在，就跑到深山住茅庵。这一回独住孤峰，无人来往，自由自在，以为真的没烦恼了。 <br>有一天，他在庵里打坐，听到门外有一群牧童吵吵闹闹地说要到庵里看看。 <br>有人说：“不要动修行人的念头。”又有人说：“既然是修行人，念头是不会动的。”后来牧童都进去，老修行坐在蒲团上，没有理他们。他们找吃找喝闹个不停。老修行没有任何动静，牧童摇他也不动，摸他的身体还有暖气。 <br>有人说：“他入定了。”有人说：“我不相信。”于是有人拿了根草挑他的腿，他不动；挑他的手，也不动；挑肚子也不动，挑耳朵也不动，最后挑他的鼻孔，老修行终于忍不住，打了一个喷嚏，大骂道：“打死你们这帮小杂种。” <br>这时观音菩萨在空中现身，对他说：“你三十年前断了无明，今天还放不下吗？” <br>所以障垢必须灭除尽无余。没有灭尽只是压伏的话，遇缘还会现行，所以念这一句时要发从根断尽障垢的愿，不到此地步，誓不中止。",
                      "灭障和成就妙行是同步的，灭了障垢，自然就成就妙行。相反，有障垢系缚，行为就不妙。比如当我们执著身体、财富、名声，被迷乱控制时，我们的妙行就被障住了。想一想，心紧紧执牢我和我所不放，行为怎么能妙呢？心整个钻入了牛角尖，哪里有慈悲喜舍、定慧圆明的妙行呢？相反，能去掉障垢，本有的性德自然就显发出来了，执著越小，行为就越妙。比如嗔恚是以无明力把对境视为不可爱而发恚恼心、粗猛心，想对对方行害。这样以嗔心发出的身口意行都不妙，都是劣行。像这样，懈怠、散乱、嫉妒等的烦恼都障碍成就妙行。因此，我们要发愿灭尽一切客尘烦恼、二取分别。就像阳光照射融化冰块的同时，就现出水的湿润、流动等妙用，我们灭尽妄想执著时，自性无量的妙用自得现前。这时就是“一切妙行皆成就”。 <br>那么什么是妙，什么是不妙呢？可以有深浅不同的解释。浅说，以世俗菩提心摄持的善行，初善、中善、后善，是妙；没有以菩提心摄持，不是成佛的资粮，是不妙；深说，登地证悟法界遍行义之后的行是妙，地前未见道的行都不妙。",
                      "我们凡夫深陷在迷梦中，以习气力妄现种种乱象。我们在迷乱中做的是什么行为呢？我们这颗心一直在起贪嗔痴，造种种福业、非福业、不动业，都不离执著，都不妙。就像梦中到了一片茂密的原始森林，看见大蟒蛇惊慌奔逃，见到美味树果，又贪婪地摘下来吃……狂心一刻不休歇，法身就是这样流转五道的。像这样心有障垢，所作所为都不妙，在自相续中只有苦和集。 <br>等消除了障垢才显现妙行。比如初地断一分障，就能一身化现百类身、到百佛世界教化众生、震动百佛世界、了知前后一百劫事、深入一百法门等。如此升进，障垢越薄、境界就越微妙。圭峰大师说：“妄念若起，都不随之，即临命终时，自然业不能系。虽有中阴，所向自由。天上人间，随意寄托。若爱恶之念已泯，即不受分段之身，自能易短为长，易粗为妙。若微细流注，一切寂灭，唯圆觉大智，朗然独存，即随机应现千百亿化身，度有缘众生，名之为佛。”可见，灭除障垢，就自然现前不可思议的作用解脱。",
                      "“一切妙行皆成就”，既然说“一切”，就表示无量的六度妙行，发愿统统成就，本性中有多少种的妙行，就成就那么多的妙行。而且一行中有无量行，比如在一项布施行中又有无量的妙行，这一切都发愿成就。这就是“法门无量誓愿学，佛道无上誓愿成”。佛事门中不舍一法，舍一法则不名满足菩提。初地菩萨发愿：“愿一切菩萨行，广大无量不坏不杂。”意思是发愿行菩萨行像大海一样广大无量。“不杂”，是不杂世间有漏法；“不坏”，是契合真如本性而不坏。《菩萨地》云：“如是六种波罗蜜多，菩萨为证无上正等菩提果故，精勤修集，是大白法溟，名大白法海。” <br>以上关键是发愿。普贤愿要一愿愿地发，初学者对每一愿都要经由一番思维来引出愿心，这样经中说的发愿利益才会在自己身上现前。学好了这套愿文，就有了今生来世乃至无量生的行愿。未来所有的修行目标都确定好了。这是有大意义的，这比做多少世间法、做多少形相上的善法、学习多少世间知识都有意义得多。这能让我们生起大觉悟，生起无量的觉悟。如果能对此引生欲乐，确实会像春雨润物一样，大乘善根蓬勃发起。这是极稀有的因缘！",
                      "我们能坚固以上这组发愿，那这组愿就像一位向导会带动我们不断修集不忘愿菩提心的顺缘，消除愿心的违品，由此令心恒时趣向菩提，这就把心的取向完全调整好了。再修持行菩提心六度，灭除行心违品的烦恼障和所知障，自性普贤远离障垢，就能任运、周遍地起用。远离了烦恼和二取分别，当然是遍法界地自在发挥。可见以这组“恒不忘失菩提心”的行愿能趣入不可思议解脱境界。普贤行愿，愿愿不离证入法界的主题，愿愿是心要。 <br>从次第上看，以这组愿的力量能逐渐让我们从位前普贤证入当位普贤、位后普贤，也就是，地前发起世俗菩提心，以愿力普摄众生界，随分随力地勤修波罗蜜；到初地时证悟法界遍行义，一一行都周遍法界，再随地升进，十波罗蜜多依次增胜圆满；最后彻证佛果，不舍因门，现菩萨身，利益众生。 <br>前面圭峰大师的比喻：在平坦空旷的地上睡觉，梦见四面阻碍不通，醒来才知道本无阻隔，所向解脱。这是说，内有执著，外境才显现为有障碍。相反，灭除障垢无有余，就能使“一切妙行皆成就”。所以我们发这一组愿，就是开始随顺趣入不可思议的解脱境界。修学普贤行愿，关键是要引发求证不可思议解脱境界的欲乐。",
                      "<1><24> <i>  3、自在无碍行  </i>   <br>业、烦恼、魔境是有漏法中的因果。“得解脱”有两方面的涵义：一、从不善业、烦恼、魔的境界中解脱，也就是不以这些染污而在世间游行等，恒时行持。这与什么相像呢？“犹如莲花不著水”，如同莲花出水而不著水，不染著烦恼、业、魔等的世间法。二、没有福业、不动业的贪执，也就是不希求异熟果，一向谋求众生的利益，这就是菩萨之行。这又与什么相像呢？“亦如日月不住空”(日月在虚空中无阻碍地运行)。在世间，日月就像如意宝一样唯独趣入利他行，没有丝毫自利心。日月无私地照明整个天下，比喻利他行；从不耽于静止，比喻无碍行。《弟子书》云：“日势乘马照世游，地不择担负世间，大士无私性亦然，一味利乐诸世间。”(太阳乘着七马拉的宝车，永不停息地在虚空中运行，唯独把光明带给世间。大地则不挑选地担负一切世间。大士无私的本性正是如此，一味对有情作利乐。) <br>以上总的是说悲智双运的大乘行。智不著世间，即不著有，犹如莲花不著水；悲不住寂灭，即不住空，亦如日月不住空。这样自利成就法身，利他成就色身，证入不可思议的解脱境界。",
                      "“魔”的意思是障碍善法和菩提，使人从殊胜的正道中退失。圣道的法生长慧命，能夺人慧命的杀手，叫做魔。魔的作用是使人从作利益安乐中退失。《大智度论》说：“除诸法实相，余残一切法，尽名为魔。问曰：何以名魔？答曰：夺慧命，坏道法功德善本，是故名为魔。(除诸法实相外，其余的一切法都叫做魔。包括蕴魔、烦恼魔、死魔、天魔。为什么叫做魔呢？因为夺人慧命，是破坏菩提分法功德的根本，所以叫做魔。)” <br>唐代道树禅师住在三峰山时，常有野人来。野人穿着朴素，言谈诡秘，有时忽然变作佛菩萨、罗汉、天仙等形象，或放光，或出声响。道树的徒弟们见了都无法测度。过了大概有十年，就消声匿迹了。道树禅师对徒众说：“野人作多色伎俩，眩惑于人。只消老僧不见不闻，他伎俩有穷，我不见不闻无尽。”可见，在种种魔境现前时，不闻不睹不去管它，魔恼自息，就是“于诸魔境得解脱”。",
                      "注意，“世间道中得解脱”有很重要的内涵。我们修学普贤行愿，不像小乘把三有、寂灭视为两个，那样是入不了不可思议解脱的。《维摩诘经》说：“譬如高原陆地不生莲花，卑湿淤泥乃生此花。”“卑湿淤泥”是指世间。“佛法在世间，不离世间觉”，并不是坏世间相而求实相。古德说：“愚人除境不亡心，智者亡心不除境。”能一切处没有爱、恶之念也就解脱了。 <br>《维摩诘经》说：虽然是白衣，奉持沙门清净律行。虽然居家，不著三界。示现有妻子，常行梵行。现有眷属，常乐远离。虽明了世间典籍，常常爱乐佛法。这是“世间道中得解脱”的极好表达。 <br>依靠这无著、无住的中道妙行，最后成佛时就现前法身与色身双运。《华严经》说：“随缘赴感靡不周，而常处此菩提座。”(随众生因缘任运示现，无不周到，却又恒常安住于菩提座中，毫不动摇。)这是大解脱境界。如何证入呢？这就要发起上一愿，非常关键。",
                      "<1><25> <i>  4、利益有情 </i>   <br>这是要发大愿，尽未来际在十方世界中为一切有情解除苦难，施予安乐。 <br>念这一颂时，应当发愿：在浩瀚的虚空世界中，不只某一方的众生，而是十方一切种类的众生，我都拔除其一切轮回苦，将其安置在暂时人天安乐中，不仅如此，我还用善巧方便将其引向无上菩提，成就究竟利益。像这样，经过佛刹极微尘数劫，在十方世界中永无止境地利益众生。 <br>清朝国师章嘉游戏金刚说：这是由慈愍和愿的力量特意思维受生在六道中成办有情利益的发愿。这就是说，有很深的慈悲众生的心，特意思维：我如何受生在六道中真实地利益有情呢？这样甘愿把身心奉献众生，昼夜利益众生，永不休息。",
                      "具体说，“悉除一切恶道苦”是指灭除三恶趣一切种类的痛苦。比如地狱的焚烧、舂磨等苦，饿鬼的外障、内障等苦，旁生的役使、负重等苦，这一切都由我来消除。有人问：轮回无不是苦，为什么只说灭除恶道苦呢？因为恶道苦重，极为摧残有情身心，所以以它作代表，实际是发愿普为众生拔除一切轮回苦。 <br>“等与一切群生乐”：不仅发愿给众生解除痛苦，还发愿平等给予众生安乐，就是把一切众生都安置在殊胜安乐中。贫穷者给予财富，病苦者给予良药，饥渴者给予饮食，裸露者给予衣服，遭厄难者令得解脱，迷路者指示正道，愚痴者令得智慧……，让一切众生首先得世间安乐，再获得出世间无上安乐。 <br>“如是经于刹尘劫，十方利益恒无尽”：经过佛刹极微尘数劫，在十方无量世界中恒时利益有情，永无穷尽。",
                      "总之，这是为令群生离一切苦、得一切乐，最终获得无上智慧，而发起普利有情的大愿。这大愿尽虚空、遍法界，遍覆一切世界的有情，尽未来际无有穷尽，念念相续，无有休息。初地菩萨发愿：“愿一切众生界，有色、无色、有想、无想、非有想、非无想，卵生、胎生、湿生、化生，三界所系，入于六趣一切生处，名色所摄，如是等类，我皆教化，令入佛法，令永断一切世间趣，令安住一切智智道。广大如法界，究竟如虚空，尽未来际，一切劫数，无有休息。” <br>唐朝裴休[1]居士在《普劝僧俗发菩提心文》中说：“从今身至佛身，誓欲度脱一切众生，普令入佛知见。黑暗岸下，为作明灯，生死海中，为(作)船筏。力虽未及，常运此心，念念相续，不令间断。能持此心否。若持此心，则永不退失阿耨多罗三藐三菩提。”(从现在的身直至成佛的身，誓欲度脱一切众生，普令证入佛的知见。在漆黑的河岸下，为众生作明灯。在生死的大海中，为众生作船筏。虽然能力达不到，但常常运心如此发愿，念念相续，不令间断。能守持此愿心吗？能守持，则永不退失无上菩提。)",
                      "<1><26> <i>  5、披精进甲  </i>   <br>念这一颂时，应当发愿：愿我恒时随顺众生根性启发他，使他顺利地趣入大乘，尽于未来一切劫数，恒无厌倦地修习普贤广大行，由此圆满福慧资粮，证得无上菩提。 <br>“我常随顺诸众生”，是说一切生恒时能够在善解有情的心行后，不分亲疏地和有情融洽相处，行为处处随顺有情，没有不相合之处。(这样随顺有情是为了使他愿意亲近自己，由此就能方便地引导他趣入大乘。) <br>“恒修普贤广大行”，即恒时修习礼敬等的普贤广大之行。修到何时为止呢？穷尽未来边际，也无丝毫疲厌。这就是披精进铠甲的意思。",
                      "<1><27> <i>  6、会遇同分菩萨 </i>   <br>“同分”指身口意的行为和愿力相同。这一颂重点是发愿会遇身口意业及愿力同等的菩萨，会遇之后同修共学。  <br>念这一颂时，应当发愿：所有与我同修菩提行的菩萨，乃至成就菩提之间，一切生常常与我相遇，相遇之后，身口意业共同修学一切普贤行愿。 <br>这是会遇修大乘道的殊胜助伴的愿。“与我同行”，即行为与我相同。“于一切处同集会”，即恒时与同行菩萨共住，乃至获得菩提果之间，常不分离。后两句是讲共住后，身口意跟随他们同等地行持菩萨行，同等地发愿，没有其他杂染，如同水乳交融一样。",
                      "学习这一颂，要知道在哪方面发愿，为什么要这样发愿。所愿有两点：一、与同行菩萨恒时集会；二、身口意与他们同等修学普贤行愿，要在这两点上发愿心。 <br>发愿之前先把道理想透，为什么要一切时处不离同分菩萨呢？为什么要与同分菩萨同修普贤行愿呢？这关系到重大的缘起走向，即心是随缘而现的，随染污缘就熏习邪恶，随清净缘就显发功德，就像包香的纸盒和拴鱼的草绳，靠近香就有香气，拴了鱼就有腥味，久久熏染就成了同一气味。以这个原因，亲近恶友，会令相续中的功德逐渐损减，罪恶逐渐增长，能引生一切过患，所以何时何地都要远离恶友。相反，和同行菩萨共住，久久熏染，能令功德渐次增长，罪恶渐次减少，能引生一切利益。了解这一缘起规律后，应当发愿恒时和同行菩萨共住。",
                      "再观察：我们自性是普贤，能和同分菩萨同学普贤行愿，就会显发普贤的自性。比如，菩萨行礼敬，我随学他，就显自己的礼敬之德；菩萨行称赞，我随学他，就显自己的称赞之德……。总之，菩萨修普贤行时，我随学他，就能圆满我的普贤愿。 <br>明白了这些，就应该主动往这方面猛利发愿：不论哪里有修菩提行的菩萨，我都与他共住同学，相互策励，同心同德，彼此敬重，视如世尊。他有一德一行，我都效仿随学。真诚发起此愿，就能和一切修菩提行的菩萨结成菩提眷属，没有民族、地区、法门等的偏执，心量开展得犹如虚空。从此，渐渐能与一切同行菩萨和合共处，能虚心地向一切菩萨学习。",
                      "初地菩萨发愿：“愿与一切菩萨同一志行，无有怨嫉，集诸善根。一切菩萨平等一缘，常共集会，不相舍离……”(誓愿与一切菩萨同等志在一乘、同等修习万行，没有怨恨、嫉妒，积集诸善根。与一切菩萨平等无缘而证悟，常常集会一处，不相舍离。)裴休《普劝僧俗发菩提心文》说：“从今身至佛身，与同发菩提心道俗生生世世不相舍离，同愿同心，同行同德，各修定慧，分化众生，或为兄弟，或为师长，迭相劝发，彼此护持，一人失路，即同拯拔，一人证道，即共皈依，永无厌倦，不相舍离。能持此心否。若持此心。则永不退失阿耨多罗三藐三菩提。”(从现在的身直至成佛的身，愿我和同发菩提心的在家出家菩萨，世世生生不相舍离，同心同愿，同德同行，各自修持定慧，分赴各处度化众生。或做兄弟，或做师长，相互劝发，彼此护持。一人迷失正路，大家就一同拯拔他；一人成道，大家就共同皈依他，永无厌倦，不相舍离。能守持此愿心吗？能守持，则永不退失无上菩提。)这些都是“会遇同分菩萨愿”的同类。",
                      "<1><28> <i>  ７、令善知识欢喜 </i>   <br>念这一颂时，应当发愿：依于悲愍以无染心为我开示大乘道的诸善知识，为我显示普贤行法，在我未证得菩提期间，愿我与这些说法的善知识恒时共住；共住后，何时也不违逆他的心，不说一句不悦意的话，专一地成办依止的意乐和加行，令他常生欢喜心。 <br>所谓“益我”，是指慈悲为我显示大乘正道，这是真正地作利益。我们观察，大乘道的一切深广修行都归摄在普贤行中，圆满普贤行的关键又在遇到显示普贤行的善知识，以这个原因，要发愿恒时与这些善知识共住。再看，共住之后，要想获得善知识的加持，关键在恒时顺从善知识的心，遵照其教言切实地奉行，因此应当发愿常常令善知识生欢喜心，丝毫不扰乱他，不令他生厌离心。这是专门发愿恒时如理依止功德殊胜的大乘善知识，永不舍离，其意义极为切要。 <br>我们学习此颂，要认定发愿的内容和通晓发愿的方法。发愿的内容，一是恒常不离善知识；二是恒常令善知识生欢喜心。认定了这两个目标之后，往这两方面发起愿心，就是这一颂的发愿。",
                      "怎样让发愿落到实处呢？这有两个环节：一、思维为什么要按这样发愿；二、思维具体怎样发愿。 <br>一、为什么要发起此愿呢？ <br>入手处是先在理由上思维。一旦认识到按这样做有极大的利益时，内心就会得到真正的决定，就会下决心尽一切努力发起这条愿，由此就有真正的愿望。是否做过思维相差很大。没做过思维，一是被动，人云亦云；二是发愿不明确，模模糊糊。但做过到量的思维，一是会主动，由衷地随文祈愿；二是会明确，一上来就引心朝着发愿目标祈愿。两种效果相差很大。 <br>那么，为什么要发愿恒时不离善知识呢？这里有极重要的道理。我们按佛经上的教言来讲：《法华经》上说：善知识是大因缘，所谓能令人见佛，发无上菩提心。",
                      "佛在《弥勒请问经》上说：弥勒！你应知道，声闻缘觉与无上佛果的解脱，彻见诸法的智慧，都源于依止善知识。弥勒！你应知道，众生的一切利乐都源于自己的善根，也来自善知识。 <br>《华严经》说：若菩萨为善知识真正摄受，则不会堕落恶趣。若菩萨为善知识思念，则不会违越菩萨学处。若菩萨为善知识守护，则能超胜世间。若菩萨承事供养善知识，则能对一切修行不忘失而行持。若菩萨为善知识摄持，业和烦恼即难胜伏。 <br>《华严经·不动优婆夷章》还说：若修行善知识的教言，一切诸佛内心欢喜；若随顺善知识的话语，则能接近一切种智果地；若能对善知识的话信受不疑，则常值遇一切善友；若发愿恒不舍离善知识，则具足一切义利。 <br>从这些经文看出，亲近善知识能速疾成佛，令诸佛欢喜，而且会始终不远离、不缺少善知识，不堕恶趣，不被恶业烦恼胜伏，始终不违越诸菩萨学处，于诸菩萨行具足正念，由此逐渐增长功德资粮，能成办现前和究竟的一切义利。",
                      "《涅槃经》上说，就像空中的月轮从初一到十五渐次增长，善知识能令学者逐渐远离恶法，增长善法。如果亲近善知识，原本没有的戒、定、慧、解脱、解脱知见便能拥有，未具足的便能增长广大。 <br>《不可思议秘密经》也说：善男子、善女人，应当极恭敬地依止、亲近、承事善知识。能够这样做，则由听闻善法转成善意乐；由善意乐转成善加行，以此因缘便造作善业，转趣善行，能令善友爱乐欢喜。由于不作恶业，所作纯善，则能令自他不起忧恼。由能随顺护持自他，则能圆满无上菩提正道，由此能利益趣向恶道的各类有情。因此，菩萨应当依止善知识，圆满一切功德资粮。 <br>这一段清晰地显示了由依止善知识而转变意乐、加行，从而圆满功德资粮的过程。恒时不离善知识，如法依止，长期熏陶，就会在潜移默化中使身心逐渐转为贤善，也就是，通过长期地听闻善法，则转成贤善的意乐；以贤善的意乐摄持，则转成贤善的行为。这样，自己成为纯善之人，就可以护持自他，圆满无上菩提的道业，普利群生。",
                      "再讲一则公案： <br>有一次，世尊和长老难陀来到一处卖香的地方，见那里有许多包裹香物的袋子。 <br>世尊说：“难陀，你去把那些香袋取来。” <br>难陀遵佛吩咐取来了香袋。 <br>世尊告诉难陀：“你在一刻钟里握着香袋，然后放在地上。” <br>这时世尊又对难陀说：“现在嗅嗅你的手。” <br>难陀就嗅自己的手。 <br>佛问：“手上有什么气味？” <br>难陀答：“世尊，手上有妙香。” <br>佛说：“如是如是，如果有人亲近善知识，和善知识恒常共住，以随顺熏陶、串习、亲近的缘故，一定会获得广大名声。”",
                      "这时佛就此事以偈颂说： <br>若有手执沉水香，及以藿香麝香等， <br>须臾执持香自染，亲附善友亦复然。 <br>若人亲近恶知识，现世不得好名闻， <br>必以恶友相亲近，当来亦堕阿鼻狱。 <br>若人亲近善知识，随顺彼等所业行， <br>虽不现证世间利，未来当得尽苦因。 <br>(如果有人手握着沉香、藿香、麝香等，须臾间的执持，香气就自然熏在他手上，亲近善知识也与此相同。如果有人亲近恶知识，现世不得好名声，因为与恶友亲近，将来必定堕落无间地狱。如果有人亲近善知识，随顺善知识的身口意来做，即使不能现前获得世间利益，将来也能灭尽众苦。)(《佛本行经》) <br>总之，能让我们相续中生起一种功德、改正一种过失，一切善妙安乐的本源，就是善知识。以此原因，应当发起恒时不离善知识的誓愿。",
                      "这里再次强调需要对“不离善知识的重大意义”作一番思维。能在这一点上获得深刻定解，就会引发强烈的愿望。所以发愿要知道由什么因来引发。前次讲过，愿是由善加了知所愿境的智慧引发的，由智慧引发后，内心希求那一妙果，并在词句上念诵相应的愿文，就是愿的体性。由此就知道，智慧是发愿的先导，首先在智慧上下手就容易发起愿，也就是，首先要对所希愿的境或发愿内容详加观察认定，当引起了深刻信念时，就会在心中猛利地发愿，不实现此愿，誓不中止。按这样来学《普贤行愿品》的每一颂，就有很大利益。",
                      "这一颂发愿的第二部分：与善知识共住之后，恒时令善知识生欢喜心。 <br>具体怎样令善知识生欢喜心呢？这就要具足依止的意乐和加行。总的需要具足孝子心等的华严九心，特别需要具足信心和念恩心，在这些贤善意乐的摄持下，努力做善知识欢喜的三种加行——供献财物、身语承事和如教修行。 <br>【 九心，即：如孝子心、如金刚心、如大地心、如铁围山心、如仆使心、如除秽人心、如乘心、如犬心、如舟船心。具体参阅《菩提道次第广论讲记》。】 <br>为什么要这样做呢？因为要想获得善知识的加持，关键取决于依止的意乐和加行，也就是如何随顺善知识的心意，令善知识欢喜。能做一切令善知识欢喜的事，不做令善知识不欢喜的事，就能迅速圆满资粮、净除业障。具体来说，对善知识供献财物，能和善知识的心亲近，是极殊胜的积累资粮；以身语承事善知识等同承事一切诸佛，能净除罪业，本来应该在恶趣中受报的罪业，今生身心稍微受一点病苦或者在梦中领受就能消尽；又能成就善根，产生许多福德，《地藏经》上说：在俱胝佛所种植的善根——即行持布施、供养、受持学处等所生起的众多善根，仅仅以半日承事善知识就能映蔽，所以，承事善知识所成就的功德不可思议。又，遵照善知识的教言实行，是加持融入自相续的方便，而依仗善知识的加持，就能获得共与不共的成就。",
                      "这些思维好了，就会猛利发愿恒时不离善知识，而且依止之后，恒时做善知识欢喜的三种事——供献财物、身语承事、依教奉行。或者发愿：善知识欢喜的事，我都尽力去做；善知识不欢喜的事，我尽量不做。这样就开始和这一颂的愿义相应。这才是对这一愿信受奉行。 <br>当然，经文都是讲大的原则，展开来，发愿如何修习依止意乐，如何供养、承事、依教奉行，分门别类有无量愿的支分。",
                      "裴休《普劝僧俗发菩提心文》说：“从今身至佛身，誓欲承事诸佛一切诸大菩萨诸善知识，见善知识情无厌足，事善知识心无疲懈，闻善知识所有教诲，欣乐顺行。常学善财童子所行之行。力虽未及，常运此心，念念相续，不令间断。能持此心否。若持此心，则永不退失阿耨多罗三藐三菩提。”(从现在的身到成佛的身，誓愿承事诸佛、一切菩萨、善知识，见善知识心无厌足，承事善知识无疲厌、懈怠，听闻善知识的任何教诲，都欢喜顺从，尽力奉行。恒时随学善财童子的行为。虽然力量还达不到，但常发这样的愿心，念念相续，不令间断。能守持这样的愿心吗？能守持，则永不退失无上菩提。) <br>我们知道，善财童子如理依止了一百一十位善知识，成为修行人依止善知识的最佳典范。善财童子的化身就是法王如意宝，与我们有殊胜的缘份。法王这一生依止上师的意乐和行为，值得我们生生世世去效仿。",
                      "法王说：“我没有什么传记可写的，但有一点，凡是我所依止过的上师，我从未做过让他们不欢喜的事。对任何一位上师，我都是恭恭敬敬，谨遵师教，这是我一生唯一的传记……”“我依止托嘎如意宝的六年当中，从未扰乱过上师的心，就像如来芽尊者依止智悲光尊者那样，甚至没有做过一件让上师怒目而视、不欢喜的事。我对上师的所作所为从未起过邪见，上师就是开玩笑，我也觉得有深深的密意，视如善妙教言。”这就是善财童子在这个时代最生动的示现，我们能发愿随学，就能真正契合这条令善知识欢喜的普贤愿。 <br>憨山大师在《梦游集》中讲了侍者宗的依师孝行。他说： <br>某年春天五台山法会结束，我和妙峰师辞别。妙峰师说：“我不能陪您一起去，您孤身一人走远路怎么行呢？”然后看着宗说：“这孩子可以代我当随从。” <br>妙峰师命令宗说：“古人跟着师父学法，发誓以死为期，你应当尽心竭力服侍师父，如果半途退心，这辈子我不再见你。”宗下决心绝不半途而废。 <br>第二天出发，我和龙华老人在大行的障石岩养病。宗一个人当随从，样样事都很勤快地去做。每当我吃饭时，他一定站在旁边服侍我把饭吃完，观察我是否满意，他也或喜或忧。我吃得饱，他也吃得饱，我偶尔不想吃，他就流泪悲伤，也整天不吃东西。我常常私下观察，发现他久久如一日，就对龙华老人评价说：“他是天性纯孝的人。”子夏曾向孔子问孝，孔子说：“色难。”宗不就是这样吗？ <br>宗依止师父有一颗难得的孝子心，凡事都随师父的脸色、意愿而转，不以自己为主。像这样依师的孝心，我们能发愿随学吗？能立志学华严九心吗？能长期奉行、誓不退转吗？能立誓不退，那真是奉持普贤行愿的了不起的修行人，将来一定会速疾成就佛道。",
                      "<1><29> <i>  8、常见如来常兴供养  </i>   <br>念这一颂时，应当发愿：愿我恒时无障碍地亲见十方世界中成为众生唯一怙主的佛陀，都在佛子海众的围绕中。愿我一一刹那都对诸佛菩萨献上殊胜供养，如虚空般广大，遍满法界广兴供养。这样尽未来际，也无丝毫疲厌之心。 <br>大家发愿时，意境里要有三个大——境大、供养具大、供养心大。境是十方世界的诸佛菩萨；供养具是一切财物和法，即以一切花香灯果、饮食衣服、幢幡宝盖、伎乐歌舞，殊胜美妙，胜过诸天所有，乃至一切殊胜正行，都奉上诸佛；供养心是尽未来一切劫数，毫无疲厌。",
                      "初地菩萨就是这样发愿的，《十地品》说：“佛子，菩萨住此欢喜地，能成就如是大誓愿，如是大勇猛，如是大作用。所谓生广大清净决定解，以一切供养之具，恭敬供养一切诸佛，令无有余。广大如法界，究竟如虛空，尽未来际一切劫数，无有休息。” <br>龙树菩萨说：童子过了四岁以上还没有满二十岁的阶段，叫做鸠摩罗伽地。菩萨最初生在菩萨家时，就像婴儿。得到无生法忍乃至十住地，远离诸恶，叫做鸠摩罗伽地。要证得如是地，应当修学般若波罗蜜，常欲不离诸佛。",
                      "问：菩萨本应度众生，为什么常常发愿不离诸佛呢？ <br>答：菩萨在还没有入菩萨位、尚未获得不退转而得佛授记的阶段，如果远离诸佛，就会失坏诸善根，沉陷在烦恼中，这样尚不能自度，怎么能度他人？就像一个人乘着船想救人，船到江中就出故障，救人不成，自沉水中；又像把少量的热水投入大冰池中，虽然融化了一点冰，自己却凝成了冰块，同样，菩萨在没有入法位时，如果远离诸佛，以功德微少没有方便力，这时想度众生，虽有些许利益，自己却反而堕落。因此新学菩萨不应远离诸佛。 <br>而且，菩萨思维：我未得佛眼的缘故，与盲人无异，如果没有佛的引导，就会无所趣向、误入歧途。 <br>再者，菩萨见佛，能获得种种利益。或者眼见佛，心得清净。或者听佛说法，心中爱乐，能得大智慧，随法修行而获解脱。既然值遇佛有这样的无量利益，怎么不一心常求见佛呢？比如：弱小的婴儿，不应远离母亲；出门远行，不应离开粮食；炎天酷暑，不应离开凉水凉风；数九寒天，不应离开火炉；渡越深水，不应离开船筏；身患疾病，不应离开良医。比这些更不应的是菩萨不应离开诸佛。为什么呢？因为父母、亲属、一般的善知识、人王、天王等都不能像佛那样利益菩萨，佛能利益菩萨，令菩萨远离种种苦处，安置到佛的果位，以此原因，菩萨应当常不离佛。",
                      "弥勒菩萨说：“牟尼尊难见，常见得大义，以闻无等法，净信资养心。若于教授中，法门如欲住，如人拔险难，佛劝亦如是。”(《大乘庄严经论》)心不清净的人很难见佛，如果能常见佛，就能得到极大义利。在佛前听闻无上的大乘法，所引生的净信将恒时充满相续，这样毫无疑问，无须精勤就能证得无上菩提。所以没有比常见佛更切要的了。而且，如果想安住法门，诸佛常常亲授教言，就像有人陷在泥沼中无法自拔，以力士的力量能抓其发髻轻松地抛置岸上，依靠佛的加持和宣说教授，以大悲之力能把他从罪业深渊的轮回引到菩提果位。 <br>以上显示了见佛能获得教授等极易成就菩提，因此，发愿常见诸佛极为切要。 <br>《华严经·入法界品》云：“如来世间灯，通达一切法，普生三世福，令众悉清净。如来妙色身，一切所钦叹，亿劫常瞻仰，其心无厌足。若有诸佛子，观佛妙色身，必舍诸有著，回向菩提道。”(如来是照亮世间的明灯，通达一切法门，普能生长三世众生的福德，令众生皆得清净。如来妙色身，为一切世间钦仰赞叹，即使在亿劫中常常瞻仰，也不会生厌足心。如果佛子观视佛的微妙色身，必定弃舍对三有的耽著，回心向往于菩提之道。)又云：“若得见于佛，除灭一切苦，能入诸如来，大智之境界。若得见于佛，舍离一切障，长养无尽福，成就菩提道。”又云：“如来出世间，为世大福田，普导诸含识，令其集福行。若有供养佛，永除恶道畏，消灭一切苦，成就智慧身。”",
                      "有人怀疑：由发愿真能实现常见诸佛的愿望吗？ <br>龙树菩萨说：菩萨常常爱乐念佛的缘故，舍身受身常能值遇佛陀。譬如众生串习贪欲深重，就会受孔雀、鸳鸯等淫鸟的身形；串习嗔恚偏多，就转生恶龙、罗刹、蜈蚣、毒蛇等的恶毒旁生。同样，菩萨不看重转轮王人天的福乐，唯独心念诸佛，随他心中所重的就受相应的身形。而且，菩萨常常善修念佛三昧因缘之故，所生之处，常遇佛陀。 <br>所以，平时常发见佛之愿，加上能善修念佛三昧的因缘，以愿力和修习力一定能常见诸佛永不分离。",
                      "<1><30> <i>  9、摄持正法 </i>   <br> 念这一颂时，应当发愿：三世诸佛所宣说的十二分教所有法蕴的文句义理，我都以不忘陀罗尼门真实摄持，并对众生无误解说一切能成就菩提的修行。而且，愿我能令普贤道——菩萨的菩提心究竟清净。尽于未来一切劫，恒常无疲厌地勤修。 <br>“光显”：如光明显示万物的形态，以说法能显示成就菩提的道路。“究竟清净”指极善净治违品，令普贤道究竟清净。为什么说普贤道是菩提心？因为菩提心是普贤道的体，普贤道则是菩提心最具体、最圆满、最深广的展现。",
                      "为了发好此愿要把握两点：一、要明确所愿境，就是要知道在哪个方面发愿心；二、要知道为何需发此愿，对发此愿的必要性要有深刻的认识。 <br>首先，观察所愿境有这几方面：一、发愿自己摄持正法的文义(第一句)；二、发愿为众生开示教法，主要从能诠句的角度解释教法文句涵义(第二句)；三、发愿在自他相续中长养正法，实修实证(第三句)；四、发愿：如此尽未来际摄持正法，永无止境(第四句)。总之，发愿摄持一切正法、开显一切正法、修证一切正法，尽未来劫，念念相续，时时修习，无有疲厌。如同《十地经》所说：“愿受一切佛*轮，愿摄一切佛菩提，愿护一切诸佛教，愿持一切诸佛法。”",
                      "第二：为什么要发起摄持正法愿呢？麦彭仁波切说：“了知所知法范围中能信任不变的事唯有圣法，并对‘三世所有诸佛、菩萨、声闻、缘觉及众生的安乐善道，一切唯从圣法光明中出生’生起信解后，应当发起住持圣法的大愿，经中说此愿含摄佛子无量愿的缘故。”(《随念三宝经释》) <br>这段话讲了怎样发起住持圣法愿，就是以两点为前提：一、了知在所知法范围中能信任不变的事唯有圣法；二、信解三世所有世间、出世间的安乐善道唯一从圣法光明中出生。再加一条理由是：经中说住持圣法愿含摄佛子无量行愿。也就是《胜鬘经》所说：“菩萨所有殑伽沙数（恒河沙数）无量行愿，皆应摄入一大愿中，所谓护持正法。护持正法是大境界。”",
                      "下面分段解释：一、在所知法范围中能信任不变的事唯是圣法。 <br>我们问自己：在一切所知法中能够永久信赖的法是什么？我们先找出哪些法是会变坏而不能信赖的，把这些法排除了之后，剩下来的就是能永久信赖的法。 <br>一切世间有漏的有为法都是刹那灭的自性。即使我们内心不舍弃它，以它的自性也注定会灭尽的。如果灭尽之后能出现更好的显现，我们也很满足了，但我们对它杂有烦恼的缘故，灭尽之后还会引发后有之苦。这就决定了这些法都不是可永久信赖的。 <br>比如，世间人梦想当明星、当富豪、做总统，甚至想做转轮王、大梵天王，他们认为名声、财富、地位、权势等等是能获得安乐的最实在基础，把安乐的希望都寄托在这些上面。他们的判断完全错了。这些有漏有为法没有不破灭的，等到破灭时，什么也依靠不上，而且会导致身心极大的痛苦。",
                      "这样就可以断定：所有的有漏有为法都不能作为永久不变的信赖处。排除掉这一部分法后，有没有可永久信赖的法呢？有！一切法中最殊胜、最稀有的圣法，唯独它可以依靠，可以寄托，可以全身心投注。 <br>我们依止圣法，圣法是否会在某时某处变得不可信赖呢？决不会的。只要我们内心不舍弃圣法，无论何时何地，圣法都在自己的心中，当下就能依止，决不会出现“想依止却不能依靠”的情况。 <br>如果把心寄托在世间法上，比如名声，一旦名声破灭，心中就只有失落之苦，这时找遍世界也找不回名声了。虽然心里还留恋不已，但毕竟已成往事云烟。其他财富、权势、眷属，甚至这个与生俱来的身体，有哪一样可以真正信赖呢？ <br>观察至此，应当生起大的觉悟。要猛然醒悟到“唯法是依”——唯有圣法是永时依靠之处，是永住心间的善友。由此觉悟就会引发住持圣法的大愿。比如，噶当派的修行人行持“四依法”——心依于法、法依于贫、贫依于死、死依于干涸之壑，这是他们修行的信条。我们学无常时都知道一条——死时财富、眷属、身体都带不走，唯有法是自己的依怙。它的重点也是要观察到追求现世法毫无实义，最终都落空的缘故。观察到量，心中会断然舍弃世间法，一心摄持正法。这时是生起了决断心，也就是生起了一分摄持正法的愿。注意，要点是：一旦思维到唯有圣法是依处，就会引发摄持正法的誓愿。修无常的这一分，其实就是修摄持正法愿的初步。",
                      "讲到这里，还有疑惑：为什么圣法能作为永恒的依处呢？答：因为圣法是真理，而真理是永恒不变的，不会因为时空的变换而不成立。换句话说，它永远成立、颠扑不破。为什么？因为这是佛的慧眼亲见一切所知相而如实宣说的，所以能作为永恒的依处。 <br>进一步能观察到，执著、烦恼、痛苦都是因为没有相应诸法实相而导致的。如果能依止开示真理的圣法，一定会从光明步入光明，从安乐走向安乐。因此，一切有情能永久依止的、也必须永久依止的，唯独是圣法。我们只有依止圣法，以心摄持圣法，才能灭过、增德，生起一切现前、究竟的安乐。 <br>所以，正确的方式应是内依止法，不这样做的话，任何生命都不会有归宿，任何心灵都不会有安宁，最终都不免要沦落到无依无靠的境地。这一点在现前的时代体现得最充分了。当今人类一味驰求财富、名声、生活享受，崇尚五光十色的“现代生活”。但最终的结局又如何呢？就是极度的精神空虚。现代人心灵没有了归宿，没有了根，没有了寄托。 <br>人们内心无法安顿，就想依靠频繁地更换来避开内心的苦。我们要观察到，这是因为所依靠的基础是坏灭法，把人生寄托在这样虚假不可靠的法上，怎么有安宁呢？所以当现象变异时，内心就强烈地不安，就陷入恐慌的状态。这时又需要去抓一个新的，这样走下去，永远得不到真正的安宁和寂静。",
                      "相反，依止圣法的人，不需要依赖任何外在的法，过着简单的生活，却有最充实、安乐的人生。他的内心会越来越安乐，会拥有最永恒的安定。 <br>这是多么鲜明的对比。显示了生命只有依止圣法，摄持正法，才有永恒的依处，才有真正的安宁和归宿。所以，我们应当发起住持圣法的大愿，这对自己对众生都有最真实、最永久、最核心的意义。",
                      "二、三世所有世间、出世间的安乐善道唯一从圣法光明中出生。 <br>佛的法分为人天乘、声缘乘和菩萨乘三类。人天的安乐善道从人天乘正法的光明中出生，只有依靠因果法深刻了知行善得乐、造恶感苦的因果律，生起断恶行善的欲乐，由此修持五戒十善，才能获得一切人天增上生的安乐。也就是有情的心由摄持人天乘的教法，生起因果正见，依此修心才能生起下士的意乐和加行，进入人天的安乐之道。不然，因果观念在人心中消失，就会致使意乐和行为邪恶，堕入痛苦的恶道。 <br>其次，声闻缘觉的安乐善道从四谛圣法的光明中出生。只有依靠四谛法深刻了知流转和还灭的缘起，由此引发出离心，勤修戒定慧，息灭贪嗔痴，才能获得超越生死的出世间安乐。也就是有情的心由摄持声缘乘的教法，认识苦集灭道，依此修心才能生起中士的意乐和加行，进入解脱正道。否则，人心没有住持四谛法，则无法了知生死是苦性而发出离心，摄心修道，截断生死根本的我执。这样就会在乐著生死的心态中，永溺生死之流，无法解脱。",
                      "再者，诸佛菩萨的安乐善道从大乘圣法的光明中出生。只有依靠开示甚深广大义的大乘妙法，才能发起菩提心，行持六度四摄，以深广的大乘道圆满无边福慧资粮而成就无上菩提。也就是有情的心由摄持大乘教法，依此修心生起上士的意乐和加行，才能进入无上的大乘道。如果有情的心没有住持大乘法，则无法苏醒大乘种性，在自相续中发起大悲和智慧，也就不能圆满断证功德而成就佛果。 <br>总之，一切增上生和决定胜的善道都唯是从圣法光明出生的，圣法如果在世间隐没，众生就会堕入恶趣、生死和小乘的衰损中。因此，为了自他一切众生的暂时和究竟安乐，我们必须发起摄持一切圣法的大愿。",
                      "三、为什么说在这条住持圣法愿中含摄了无量的佛子愿呢？ <br>我们知道，圣法是大师佛陀按照自己所修证的道果为无量众生开示一切暂时和究竟安乐妙道的言教，佛子遵循佛陀圣教修行，就会获得一切暂时和究竟的安乐之果。在佛子心中发起的种种行愿其实都是希求摄持圣法的愿，比如供养愿是希求摄持供养法的愿，守持净戒愿是希求摄持戒法的愿，不忘菩提心愿是希求摄持菩提心法的愿，自在无碍愿是希求摄持般若法的愿……。像这样，佛子所有恒河沙数无量行愿都摄入在住持正法这一条根本大愿中。 <br>圣法是如此无上微妙，自然应当发愿以不忘陀罗尼全分地受持，并且尽可能地为众生开示演说。“陀罗尼”是总持的意思——总一切法、持一切义，以正念和智慧为体性。具体说，以正念和智慧把佛法的文义毫不忘失地受持在心中，未曾听受的法义也能在心中清晰显现，就是不忘陀罗尼。有了它，能恒时为众生演说正法，自己也能清晰忆持正法句义，这是陀罗尼的作用。大家希求成佛，就要发大愿利益众生，而利益众生的根本事业就是转*轮，为众生“光显一切菩提行”。这时候没有陀罗尼，就会非常不方便。讲经说法的人都有切身体会，如果记忆力不好，很多东西有印象，却不能原原本本地表述。如果获得不忘陀罗尼，那就非常顺利，讲起来毫无障碍，非常准确。 <br>所以，我们在缘前两句发愿时要有这个内涵，就是要发愿获得不忘陀罗尼，像录音机那样不漏失信息，把佛法全部忆持在心，而且原原本本地为大众宣说佛法的文义。",
                      "大家知道，阿难尊者就有这种能力，所谓佛法大海水、流入阿难心，那时候闻法没有录音机，阿难尊者全凭陀罗尼的能力把佛传的教法忆持在心，佛涅槃后，以阿难尊者为主结集了佛的三藏教法，成为后世众生安乐的源泉。我们发愿要成就像这样的摄持正法的能力。 <br>像省庵大师发四十八愿，很多愿如“愿得闻持陀罗尼门，自然记忆一切经典，为人演说，而无疲倦”，“诸佛为我说法之时，悉得听受，乃至一文一句，无有遗忘”，“愿我得大智慧，悉皆通达一切佛法”等等，都属于摄持正法愿。裴休《普劝僧俗发菩提心文》中也有一段说：“从今身至佛身，誓欲修一切佛法，穷一切教门，四无量心，六波罗蜜，法义深浅，因果有无，性相二宗，顿渐二教，悉皆通达，开导众生。力虽未及，常运此心，念念相续，不令间断，能持此心否？若持此心，则永不退失阿耨多罗三藐三菩提。”(从现在的身直至成佛的身，誓欲修习一切佛法，穷尽一切教门，慈悲喜舍四无量心，施戒忍等六波罗蜜，不论哪种深浅法义，不论说因、说果、谈有、谈无，性宗、相宗、顿教、渐教，一切都通达无碍，开示引导众生。虽然现在能力达不到，但恒时运转此心，念念相续，不令间断。能守持这一愿心吗？能守持，则永不退失无上菩提。) <br>总之，如《正摄法经》云：“诸佛世尊所有无边无际功德，从法生起，受行法分[1]，法所化现，法为其主[2]，从法出生，正法行境，依于正法，法所成办。”",
                      "【[1]“受行法分”即法不是以财物等领受，唯一是以行持法分而领受，唯有行法才能受用佛陀的三身等。[2]“法为其主”，即诸佛不是无因而生，而是以法为根本。】 <br>像这样，忆念一切功德由法出生，法是诸佛之母、是安乐之源后，应发大愿尽未来际摄持正法、光显正法、修持正法。以此愿力推动，日日夜夜对于正法闻思修行，闻受正法、忆持正法、读诵正法、思维正法、修习正法、演说正法，以此为起点，坚持不懈，最终达到“我为法王，于法自在”的佛果境界。",
                      "<1><31> <i>  10、得无尽藏 </i>   <br>念这一颂时，应当发愿：以救度众生的缘故，我受生于三有中时，愿我所修的福德、智慧无有穷尽，虚空无垢手印等三摩地、了达真实性的智慧、教化有情的方便、大乘大悲的解脱等，每一种功德都无穷尽，由此获得共与不共功德皆无尽的大宝藏。 <br>龙树菩萨说，这是为了普令一切众生都获得利益安乐，而发愿得到积聚种种无尽功德的身。 <br>这里要认识：所愿境是什么？为什么要对此发起希求愿？这里，所愿境是获得无尽功德藏。为什么要获得无尽藏呢？对此，要深入思考，得到了决定的认识，就会主动往这方面发愿。",
                      "下面思维：我们希求一切时处能让接触自己的众生得到利益，毫不空过，但要实现此愿，就要成就能随时对众生作利益的能力，即自己要成就如意宝身。怎样成就呢？要修行获得福德、智慧等一切都无尽的功德藏。当自己成为无尽功德藏时，任何众生见、闻、忆、触自己，就能立即得利益。就像高强度的磁场，任何铁器靠近它，都会瞬间被磁化，毫无空过。 <br>这里要认识自身圆满功德和利益众生的关系，只有自身获得无尽功德藏，才能一切时处给众生带来利益。譬如，太阳有无穷的光辉，大地的生物都蒙受太阳的恩泽，只要向着太阳，就立即获得光热。如果太阳光热有限，就不能满足一切生物的需求。同样，我们福德有限，就只能利益有限的众生，而且对他们只能作有限的利益。如果想无限地给众生赐福，则必须获得无尽福德藏，即使无量众生同时祈求赐福，也能当下化现无量的安乐资具，满足他们的需求。就像阿弥陀佛获得了无尽福德藏，即使十方世界一切众生都往生他的净土，随意享用种种安乐，也不会满足不了。注意，这里福德藏是无尽的，否则不会出现这样圆满的利他境界。",
                      "智慧方面也是如此，为了圆满地利他，需要获得无尽的智慧藏。世间的学者智慧有限，即使在世间学问方面，也只通晓某一领域、某一方面的知识，此外，无边的所知法对他来说都是未知的领域。比如，对于甚深的实相，对于如何解脱、成佛，对于深广的缘起等，都茫然无知。以这样有限的智慧怎么能带给一切众生真实的利益呢？ <br>既然我们发愿要利益全法界的众生，那就需要遣除众生的无明，为此就需要有无尽的智慧，无论哪种所知都透彻了达，能圆满地为众生说法。就像释迦牟尼佛成就了无尽智慧藏，能为一切众生任运说法，无论多么深奥、微细的问题，都现量照见，当下就准确开示，众生一听法音，就生起智慧，这就真正利益了众生。可见，必须要发愿成就无尽的智慧藏。",
                      "又，为什么要获得无尽的方便藏呢？比如一个人如果想治疗世间一切种类的疾病，就要让自己成为具有无尽方便的医王，不论遇到什么病，都能开出合适的药方。如果方法有限，就会出现对某些病束手无策的情况，也就不能利益到一切病人。同样的道理，众生的根机、意乐、因缘无量无边，必须成就无尽方便藏，才能出无尽手眼，普应群机，巧施度化，否则就难免出现“法不应机”、“法门无效”等的情况。这样就知道，为了能最有效地利益众生，必须获得无尽方便藏。 <br>其它三摩地、解脱等等，也应如是思维。",
                      "(这里还要提醒大家，闻思修不能脱节，要依次由闻而思，由思而修。比如这一颂，听了讲解后，要进一步思维，思维了就会形成明确的认识，会很肯定地信受，也就会主动发这方面的愿。不然，口念经文，心里却现不出“无尽”的内涵，怎么能以此为愿境而发愿呢？所以，要把握闻思修前前引生后后的规律。听了多思维，等思维透了，心里就会决定好愿的内涵，也就能有意识地往这方面发愿串习。串习久了，就形成自己的愿力。 <br>我们不要总浮于表面，应当把法融会在心中。在闻和修之间有关键的一环——思维，听了还要在心中多转几遍，才能融会贯通，真正消化。)",
                      "清凉国师把这一愿判为利益愿，并说：“愿于一切时，恒时作利益众生事业，无空过故，亦名三业不空愿。”这是说，发这一愿的目的是为了实现恒时能作利益众生的事业，也就是为了获得三业不空的成就。三业不空是指身语意不论做什么，都能使众生受益。为了实现这一目的，自己必须获得无尽功德藏，所修的福德、智慧等等都应当是无尽的。总之，要明白因、果、作用三者，修习无尽的福智等是因，获得无尽藏是果，众生见闻忆触都获利益是果的作用。 <br>为救度众生→修习无尽福智等→获得无尽藏→三业不空过恒时利益众生 <br>目的 因果 作用",
                      "初地菩萨发愿：“愿乘不退轮，行菩萨行，身语意业悉不唐捐(身语意的造作，无一不起利他的作用)，若暂见者，则必定佛法(身业不空)。暂闻音声，则得实智慧(语业不空)。才生净信，则永断烦恼(意业不空)。得如大药王树身，得如如意宝身(二喻都是讲获得无尽藏)，修持一切菩萨行。广大如法界，究竟如虚空，尽未来际一切劫数无有休息。”(《华严·十地品》)愿文中讲到“三业不空”是，不论身体做什么，众生见了，就会深信“佛法是真实的，这位菩萨举手投足，都展示了佛法的境界和受用”；不论口中说什么法，众生一听到，就能获得真实的智慧；不论内心有什么功德，众生才由忆念而最初生起净信时，就能令烦恼不生起。总之，众生的心不论缘我身、口、意的哪方面都会蒙受利益，叫做成就三业不空，就是自己成了像药王树和如意宝那样的利乐之源。 <br>《华严经·出现品》上讲：譬如雪山有一种叫做善见的药王树，见到它眼得清净，听它的名字耳得清净，嗅它的香鼻得清净，尝它的味舌得清净，接触它身得清净，连药王树下的泥土也能祛病延年。如来就像这药王树一样，普能饶益一切众生，见如来色身，眼得清净；听如来名号，耳得清净；嗅如来戒香，鼻得清净；尝如来法味，舌得清净；触如来光明，身得清净，究竟无上法身；忆念如来，获得念佛三昧清净。而且，供养如来所经过的大地和塔庙，也能具足善根，灭尽烦恼过患，获得身心安乐。即使众生见闻如来，以业障缠缚而不生信心、欢喜心，也能种下善根，不会空过，乃至究竟入于涅槃。",
                      "经中又讲：大海中有一种大如意摩尼宝王，叫做一切世间庄严藏，具足成就百万功德。不论这如意宝王放在哪里，都能令众生消除灾患，满足所愿。……如来身如意宝王也是如此，叫做“能令一切众生悉皆欢喜”，凡是见到佛身、闻到佛名、称赞佛德，都能令众生永离生死苦患。假使一切世界的一切众生同时专心祈愿见佛，都能满足所愿。……众生见到佛身，以此因缘，就种下善根乃至成熟…… <br>佛身以恒沙功德积集而成，故名功德藏。以此功德藏能令众生见闻忆触舍离恶业、深植善根、脱离苦患、身心安乐，所以比作药王树和如意宝。我们理解至此，就要为能随时随地利益一切众生而发愿成就无尽功德藏。",
                      "<1><32> <i>  11、趣入(以下一组是修习圣者地的大愿) <br>分八：(1)趣入观见一微尘中即是十方极微尘数清净器情安住的刹界 (2)趣入十方一切刹中，亦如是见 (3)趣入佛语 (4)趣入转*轮 (5)趣入一念入诸劫 (6)趣入观见如来 (7)佛刹修行而趣入 (8)趣入往诣如来面前 <br> (1)趣入观见一微尘中即是十方极微尘数清净器情安住的刹界 </i>   <br>愿是希求之意。认清在哪方面希求之后，才能准确发愿。这一愿是希求证见一尘中有尘数刹等的无障碍法界。 <br> 在极小的一个极微尘中包容了十方三世一切佛刹中的极微尘数那么多的佛刹，每个佛刹都有以思维无法衡量那么多的诸佛，每一尊佛都处在菩萨众会中，恒常演说菩提行的妙法，祈愿我现见此境界(“现见”即是证入。初地开始部分证入此境界)。 <br>前三句是讲希求现见的境界，是所见的方面。第四句“我见”是誓欲现见这不可思议境界，其中有三重不可思议：一、一个极微尘中有无数佛刹；二、一个佛刹中有无数诸佛；三、每一尊佛都处在无数佛子的众会中。这是华严十玄中“微细相容安立门”的境界。",
                      "有人想：这是希求无法实现的果，是无果之愿。比如在一个极微尘中见不到一个佛刹的所有事物，现在有三世佛刹极微尘数的佛刹，每一佛刹都充满了无数诸佛，每一佛都处在菩萨众会中，这一切怎么能在一个极微尘中见到呢？有什么必要发愿现见它呢？ <br>答：这不是不可实现的空想。比如以不可思议的业力尚且能幻化种种世间界，会在上、中、下等的不同方位变现纷繁万相，为什么以不可思议的智慧不能在一个微尘中出现无数幻化呢？这是可以的。经上也说有四种不可思议——禅定不可思议、业不可思议、龙不可思议、佛力不可思议。比如，在小小的碗中装上清水，水中能映现具有星宿等一切庄严的广大天空；在一尺高的镜子中能显现一千里中的种种事物。所以这不是不可能，关键要领会在空性中可以显现缘起，从此处入手就能真正生起信解。所以佛说“一切诸法犹如影像”。 <br>信心不动摇的人对所有这些境界会有“肯定是如此”的信解，他相信佛语是真实无欺的。佛所说的这些事对凡夫而言成了一种秘密，我们能够信解不疑，以此缘起就可以证入空性。",
                      "<1><33> <i>  (2)趣入十方一切刹中，亦如是见  </i>   <br>上一颂是发愿现见一尘中有尘数刹的境界，即一个极微尘中有佛刹极微尘数的世界，一一世界都充满了不计其数的诸佛，一一佛都处在菩萨众会中。 <br>这一颂再将此境界扩展到十方刹海，也就是，一个极微尘中是如此，十方刹海的极微尘一一都如此，在十方刹海的每个毛端中都含容了过去、现在、未来所出现的一切佛海和国土海(过去出现了多少佛和国土，现在及未来出现多少佛和国土，一切都含容在一个毛端中；十方刹海的无数毛端，一一如此。)，对此不可思议的深广境界，我经历劫海恒时周遍修行。 <br>“我遍修行”，即我修行周遍现前上述不可思议的法界；“经劫海”，即经历无量劫数，念念如是趣入。",
                      "为什么要发起此愿呢？因为法界原本是广狭无碍、一多相容的，我们因为迷乱才妄现为有障碍的境界，所以应当迷途知返、离妄归真，发愿证入毗卢性海。这一品叫做“入不思议解脱境界普贤行愿品”，普贤行愿是能入的法，所入不是人天或阿罗汉的境界，唯是佛果不可思议的解脱境界。我们首先定好这个目标，然后缘着这个目标猛利发愿。 <br>这里要区分分别心和智慧境界的差异。在分别心妄执，一不是多，短不是长，狭不是广……，种种现相都是习气变现的，以虚妄执著导致法法不融通。智慧的境界，事与事融通无碍，一中含多，小中容大。这才是我们应发愿求证的境界。 <br>我们首先要对能入不可思议解脱境界的妙道通过闻思引发胜解，再缘着它不断发愿、积资、求证。我们不想成佛则已，想成佛就必须以发普贤愿作为先导，然后以愿导行，修行证入。",
                      "<1><34> <i>  (3)趣入佛语 </i>   <br>念这一颂时，应当发愿趣入佛语。怎样发起此愿呢？首先按照经文了解佛语的功德之相，然后心中明确现出所愿境，再作意发愿。 <br>这一颂讲：消尽了障碍的如来，语言最极清净。具体如何呢？在如来说法的一个言音中具有无量的音声海；而且，相应无数听法者的意乐差别，每一佛语都自然成为别别的词句，让每个听法者都觉得佛是以这样的声音对我说法的；而且，每个音声都流出佛的无量辩才海。",
                      "《别行疏钞》从十方面描述了佛能转*轮的圆音境界。 <br>一、佛在世时以一种声音演说佛法，众生都能随自己的种类生起各自的理解。 <br>二、佛以随顺某地区的语音说法，听者都认为世尊在宣说与自己同类的语言。 <br>三、佛只说出随顺众生根机的一种语音，听者却各自听到合乎自己根机的各别法门。 <br>四、佛只说出随顺佛法的一种声音，听者却各自听到不同的法门。 <br>五、在佛胸中有清净大种，功德最为殊胜，能发出清净的梵音声相。",
                      "六、佛有无心之音(不起分别的声音)。如果佛起心动念，声音就表现为特定的相，由此会像凡夫发音那样有各方面的限量，不可能以一切音回应。正因为佛不起念发出特定的声音，所以能显现一切音而普遍回应，就像谷响无心，能一时相应无数人的能感因缘而一一回应。其它如各种乐器的声音，是演奏者随着心念推动以手弹奏而造作种种特定的声音，所以无法以一音回应一切。 <br>七、佛是唯一圆遍的妙音，没有宫、商、角、征、羽等音，或者平、上、去、入等的四声差异。出于增上缘的力量，佛音顺应众生的机感而成为众多音声，就像一轮圆月自然在千江万河中流现众多的月影。 <br>八、佛具有众多音声，一切众生所有的语音，没有一音不含摄在如来*轮的音声之内，这是由于心无障碍，一音即一切音，一切音即一音的缘故。《华严经》说：“一切众生语言法，一音演说尽无余。” <br>九、香山大师说，所谓一音，就是无音。如果有音，就不能说“一音”，因为有体的法都不是一的缘故，由佛无音，才说“一音”。如果佛有音，则成了特定的一类音，怎么能普遍回应一切音呢？正因为佛无音，所以能随众生的机感出种种音，就像钟声随打击的轻重而发出种种声音。 <br>佛音本来无二，但听者听到很多种的声音，这是众生各各以自己的心显现的，并非以心亲自取他人的境。(意思是说，以佛力为增上缘，每个众生都随着自己的因缘而在心前显现相应的声音，不是以心去取到佛自身的声音。)经中说“自心取自心”，处处都说唯心，所以以无音相的法音普应一切众生的机感。 <br>十、一音即是一切音，一切音即是一音。 <br>如果不是一即一切，佛就不可能在演说一音时让众生各各领受到自己的理解。(意思是，如果不是一音即一切音，那就在这一音中缺少某些语言，由此使用这些语音的众生就领受不到佛所说的法义。事实上，从“佛说一音能令一切众生随类得解”可以证明佛的一音中具足一切音。) <br>其次，如果不是一切即一，如来的一音就不可能普遍具备一切。(意思是，如果不是一切音即一音，那就有部分音声没有含摄在这一音内，这样佛语就有欠缺，不是一音普遍具备一切音。) <br>正因为“一多相即”(一法和多法相互蕴涵)，所以佛演一音就普遍完备，能让一切众生都有领受理解。 <br>所以，如来以消尽障碍的缘故，语的妙力任运施展，不必勤作，就自然按无数听法者的意乐，在彼彼心前显现为最适合的声音。如来语言如此微妙，我们应当祈愿以耳根听到，趣入如来的音声之海。",
                      "我们凡夫语言境界狭隘、有限，执著使我们的灵知狭窄短促，只能起极有限的作用。比如，一言中发不出两种声音，以一音不能随顺多个有情的意乐说法。事实上，我们本具如来智慧德相，也包括佛语的德相，只不过以执著障碍而不得显发。现在要恢复本有，就应该从起点上发大愿来求证，以愿力推动就能趣向目标。心性如车，愿力如司机，司机能驾御车驶向终点，愿力能引导行者趣向目标。 <br>或许我们做梦也没想过要发愿趣入佛语境界，现在能随着经文发起此愿，确实很难得。比如，地球上六十多亿人，对世间种种事业都会谋划、追求，不遗余力地去成办，但他们对这件入不可思议解脱境界的根本大事，却表现得茫然无知、如聋如盲。世人久久陷在迷乱中，自性是佛，却不知道发心做佛。相比他们，我们能发愿很稀有、难得，能在无边的妄想中出现这样珍贵的愿心，就像从满天乌云里放出了一线阳光，是佛性最初的苏醒。",
                      "<1><35> <i>  (4)趣入转法轮 </i>   <br>念这一颂时，应当发愿趣入三世一切诸佛转妙法轮的语言海。 <br>佛的语言海如何呢？佛恒转理趣*轮的妙音是无穷无尽的，对这无穷无尽的语言海，愿我以大智慧一念间就同时趣入。什么是理趣呢？就是佛以种种方便说种种法门，在某时间针对种种意乐的有情，一说此法就能令其趣入真理，转为所化。 <br>总之，这些愿文都是描述佛的境界，愿愿都以佛境界为目标，内心希求趣入。 <br>学习《普贤行愿品》，务必要把握好发愿这个重点，能把握好，就落到了实处，也就能获得不可思议的利益。",
                      "<1><36> <i>  (5)趣入一念入诸劫 </i>   <br> 念这一颂时，应当发愿趣入念劫圆融的境界。念是一刹那，代表最短的时间，劫代表极长的时间，能在一念中深入未来一切劫，叫做“尽一切劫为一念”，也就是在这一念中显现未来的一切劫。进一步，能在一念中遍入过去、现在、未来一切劫的每个时间点，叫做“一念入于三世一切劫”。 <br>在分别心的境界中，一念不是一劫，更不是一切劫，一念中不会显现无量劫，这是时间上有障碍。到了一念遍入一切劫时，三世不离于当念，叫做念劫圆融。我们能逐渐消除执著，时空境界就会逐渐转变，比如证入初地时，能一念中入前一百劫、后一百劫，之后地地升进，境界越加微妙自在。到了佛地，无障无碍，一念与一切劫平等平等。/ <br>我们要知道，经中每一句都是极重要的发愿内容，我们在每段愿文前加上愿字，就能扣住发愿主题，比如“愿我深入于未来，尽一切劫为一念”等等。凡是愿文，都要以至诚之心发愿趣向，能这样做，就会明白这部普贤行愿是生命最究竟、最伟大的祈愿。 <br>经文是高度概括、浓缩的文字，我们思维时要做到具体、清晰，不然法义没有消化在心里，就很难深刻作意。比如，如何发愿“深入于未来，尽一切劫为一念”呢？这是祈愿我能在一念中趣入未来的一切劫。从现在往后十劫、百劫、千劫乃至无数劫，这一切都在一念中显现，祈愿我现量证入此境界。进而，在一念中不但显现未来一切劫，而且显现三世一切劫。这样认定清楚了之后，发愿才能心中有数，一念到这一颂时，心才能随顺作意：我誓愿证到在一念中显现一切劫的境界。",
                      "<1><37> <i>  (6)趣入观见如来  </i>   <br>念这一颂时，要发起现见如来和趣入如来境界的愿。 <br>这一颂说，祈愿我在一念中现量见到过去、现在、未来的一切诸佛，而且我恒时趣入佛的境界，具有如幻解脱和它的威力。 <br>用所入和能入来分析，前三句讲所入，第四句是能入，所入是现见三世诸佛和恒时入佛境界。以什么能入呢？以如幻解脱的威力。 <br>菩萨的解脱是像幻化那样的，这唯是智慧的自性，以这个妙力恒时入于一念中见三世诸佛等的境界。“解脱如幻化”是指作用解脱，就像幻化师能自在无碍地变现，菩萨能自在地驾驭时空，能把一座须弥山纳入一个芥子中，能延一念为无量劫、促无量劫为一念等等，作用自在无碍，如幻如化。 <br>总之，这是发愿在一念的慧观中现见三世诸佛，并入于诸佛的行境，也就是成了幻化那样的解脱，纯粹是智慧的自性，以这智慧的力量恒时趣入。",
                      "<1><38> <i>  (7)佛刹修行而趣入 </i>   <br> 前两句和第三句是递进关系，前两句是讲趣入一个极微中有三世佛刹的境界，第三句展开来讲十方尘刹的无数极微，一一如此，发愿无余证入此境界。“庄严”，是指佛刹无量器情的庄严，如器世界的量庄严、形庄严、色庄严、光庄严、音庄严，有情界的主尊庄严、眷属庄严、受用庄严、相好庄严等等。就像《往生论》所说的极乐世界二十九种庄严，再使它最大化，不但一佛刹土的庄严，而且三世佛刹中的一切庄严，都在一个极微中全体显现。 <br>这一颂总起来解释：在一个小小毛端的极微中，过去、现在、未来三世一切佛刹的器情庄严海全体显现，愿我以神通力使它现前而修行趣入。一个极微是如此，十方不可说不可说佛刹极微尘数的刹土中有无数的毛端，每一毛端都出现净土庄严海，这十方无量无边的净土庄严海，我一念中都深深地趣入。",
                      "问：一个佛刹中的自性、形、色、量等多方面的差别现相尚不能住于一个极微尘中，何况十方三世诸佛刹土全部无间隔、无杂乱地安住在一个极微尘中，这怎么可能呢？ <br>答：如果世界是实有的，确实小中无法容大，一中不能容多，但诸法是像幻化那样毫无自性的，无生、无灭，像毛发那样，从本寂灭，自性涅槃，所以一切都可以显现。 <br>再从低处类比观察：比如，按照自己的分别念持续串习，种种法都会显现，像修禅定时观想白色、红色，或者观想整个世界都是水等，一旦习气成熟，就会按那样显现(详见《醒梦辩论歌讲记》)。同样，能安住在智慧的境界中修习，这一类不可思议的境界都会成就。依此类推，也能信解上面不可思议的境界。",
                      "又比如，世间人修了一段时间咒语成了咒师，以咒力可以幻化很多东西，观众都万分惊奇，怎么会出现这么多的东西？这里关键是要通达万法唯心，不是心外有什么法，一切都是里面心的幻化。再从法界体性的角度看，一切法都是同一法界性，互相融通含摄。就像帝释天宫的因陀罗网，网上嵌有一千颗明珠，在每颗明珠中都影现一切珠影。像这样，每个微尘都是法界性，一切法都含摄于法界中，所以一个微尘中能显现十方三世所有的法。最终彻证实相时也是如此，在佛的一个毛孔中显现法界一切时空现象。 <br>总之，我们要深深了知，这里发愿不是以趣入分别心的境界为目标，而是以证入胜义为目标；不是以趣入人天、阿罗汉的境界为目标，而是以趣入佛果境界为目标，以这个原因，赞叹这是佛子最伟大的行愿。",
                      "<1><39> <i>  (8)趣入往诣如来面前  </i>   <br>念这一颂时，应当发起亲近未来一切诸佛的大愿。何时亲近呢？在未来诸佛成道、转*轮、示现涅槃时都前往亲近。这里说了佛示现三种事业时，但不仅仅是这三时，而是以三时为代表，在诸佛示现十二相(汉传佛教说八相)稀有事业时都去亲近。这样发愿才算圆满，无有欠缺。我们发愿是为了彻底显发自性普贤，理应把自己的诚心拓展到无所不行、无所不入的最大量为止。 <br>这一颂是发愿：在无尽的未来中有无数位修行者成佛，成为世间明灯，我在未来诸佛成道时都前往亲近。也就是，每个刹那在十方刹海中有无数人成佛，祈愿我即刻分身无数显现在每尊佛的身边亲近承事。像这样，同一时刻，十方世界有无量诸佛在转正*轮，祈愿我分身无数现在每尊佛的座下恭敬听法；同一时刻，有无量诸佛示现入般涅槃，祈愿我分身无数现在每一尊佛前。",
                      "去时如何呢？我要在每尊佛前以智慧的神通力一时化无数身，遍现在未来的十方世界中，以遍满虚空无数无量的供养云，对每尊佛都供养、称赞，绕佛百次、千次等，直至轮回空尽。(即乃至轮回没有空尽之间，无论何时，我都化无数身同时去未来诸佛前亲近、供养、承事。) <br>除了成道、转*轮、入涅槃之外，在诸佛示现降生、学艺、苦行、坐道场、降魔军等的每一种事业时，我都前往亲近，而且，十方诸佛同时示现时，我一时分身化现在每尊佛前。这就是广大的普贤行愿，使贤善之心发挥到极致。通常说“止于至善”，只有在普贤行愿中才有具体的内容和操作。",
                      "按这样发愿的功德： <br>比如，发愿亲近一尊佛就有无量功德，何况发愿亲近一切诸佛，更何况发愿在一切诸佛为了度生示现降生等一切事业时都前往亲近，这种心量广大无比，能发起此愿，福德无量无边！如果我们对每条愿都能生起胜解心随顺发愿，那这样的功德是不可思议的。能够这样发大愿，就在自己心中播下了极殊胜的善根种子。 <br>人类的建功、立业无一不源于人类的愿望，诸佛菩萨的广大成就无一不源于深宏大愿。我们未来有何等的成就，同样源于现在的发愿。在一切愿中，普贤愿是无上愿王。我们能随普贤行愿发愿，愿力就能引导我们尽未来际修持普贤大行。今生学习普贤行愿是一个起点，从这个起点出发，将会逐渐趣入不可思议解脱境界。普贤行愿的内涵深广如海，随顺它发愿功德无量，比如发愿听佛说一个言音都会产生极大功德，更何况发愿深入一切佛的一切音，而且趣入一切音中的一切理趣*轮，按照这样发愿，功德的量会无数倍地乘上去。可见发普贤愿的功德之大。这愿王确实穷尽了诸佛菩萨妙行的边际，一一称法界量、无穷无尽。发愿如海，功德如海。修习这样的妙法，能让我们的心扩展到具一切善、周遍的善。从这里修起芬敷万行，荣耀佛果无量妙德。/",
                      "<1><40> <i>  12、力 </i>   <br>力，指心的能力，包括智慧力、神通力、慈悲力等等。力的体相是不夺——以违品无法侵夺。种种妙行达到以违品不能侵夺的程度时，就是成就了力。这些智慧等的力实际是心性本具的力，把它开发到极致就是佛果之力，这是我们发愿求证的目标。 <br>比如，谁都希望自己具有智慧力，这是对更高境界的向往，应该肯定，不仅肯定，还要让这种善愿充分地拓展。就像发现一处有泉眼时，就要从那一点上开出泉池来，我们发现自己心中有万善，就要让它拓展到最大。我们的种种善愿，如何拓展到极致呢？最好的方法就是修学普贤行愿。认真按这部普贤行愿串习实行，就能让善心最大程度地开发。能这样用心学习，会有极大意义。",
                      "「速疾周遍神通力」 <br>神通，是指能随心所欲地施展。力体现在众生的心会被不由自主地吸引而获得满足。以神通力能完全摄服众生的心，使他们一心一意地信受追随。“速疾周遍”，是指一刹那就遍至十方世界，不必借助其它工具，以心的能力就能到达。 <br>念这一句时，应当发愿：获得不可思议的神通力，能在一念间速疾到达十方刹土。",
                      "「普门遍入大乘力」 <br>比小乘大或者是诸菩萨所乘，所以叫大乘。大乘实际指能得佛果的道——福德资粮和智慧资粮，或者，修习波罗蜜多叫做大乘。大乘的力是指一切违品都无法摧坏，或者，当它发出来时没有障碍能阻挠它。 <br>普门：“门”是能通向的意思。“普门”从因上讲，指一切能趣入大乘的门径。“普门遍入大乘力”，就是指自己的行为没有不生菩提心、不对众生作利益的，就像《净行品》所说，在遇到一切境缘时都能善巧地把心引入大乘。从果上说，对于无量世界中的无量有情，随种种界、种种根、种种意乐，以如海般的种种乘，从一切门中把有情安置在大乘中，叫做“普门遍入大乘力”。 <br>念这一句时，应当发愿成就一切时处都能普门遍入大乘的力量。",
                      "「智行普修功德力」 <br> “智行力”指智的力和行的力。智的力体现在决断，能对万法的缘起和真如抉择断定。行的力体现在娴熟，身口意运转起来，能任运地趣入利益有情。有了智行力就能普修功德，也就是，一切时处都能成就真实的利益，而且修功德时能做到初善、中善、后善，所以叫做“智行普修功德力”。(智行力是普修功德的条件，普修功德是智行力的作用。) <br>念这一句时，应当发愿在自相续中引发能普修功德的智行力。",
                      "「威神普覆大慈力」 <br>大慈心就是普覆一切众生界、欲令一切有情都到安乐的慈心。像雨云覆盖天下，大慈心遍覆十方众生界，叫做普覆。威神力指能无碍地遍入、能极妙地发挥作用，让所作真正实现。就像在热地狱中化现慈三摩地云，降澍雨流，将众生安置在安乐中，能于十方无量世界普遍以慈心三昧施予安乐，叫做“威神普覆大慈力”。 <br>念这一句时，应当发愿成就普覆一切众生界的大慈力。",
                      "<1><41>「遍净庄严胜福力」 <br>福德的作用是能清净和能庄严。“能清净”指以福德力能令外在环境、内在身心清净无染。“庄严”相当于“美好”的意思，以福德力能不断出生妙善的现象。(所以，能净化的缘故，是福德。数数成就庄严的缘故，是福德。) <br>以上讲了由缘起律具有福德的力量就能清净、庄严。那么，怎样获得福德力或者以什么方法能引发福德力呢？ <br>第一，发菩提心修持一切善法能获得殊胜的福德力。《勇授请问经》说：“菩提心福德，假设若有色，遍满虚空界，福尤过于彼。若人以诸宝，遍满恒沙数，诸佛刹土中，供养世间依。若有敬合掌，心敬礼菩提，此供最殊胜，此福无边际。(菩提心的福德如果有色相，超过遍满虚空界的福德。即使以充满恒沙佛刹的财宝供养诸佛，也不如内心敬礼大菩提的福德。)”总之，菩提心的所缘是法界一切众生，所求是具无边功德的佛果，所愿是为一切众生拔一切苦、与一切乐，以心量无穷大的缘故，能获得极殊胜的福德力。",
                      "第二，大乘法具有甚深、广大的内涵，是一切法中最无上的法。大乘教法宣说了二无我的真如甚深义和六度、十地等的广大行，在道的方面讲了以利他为主的修行，在果的方面讲了乃至众生界尽之间任运不断转入的利他事业。大乘法具有极深广的内涵，能带给无量众生最深广的利益，缘着大乘法受持、读诵、演说、信解、回向菩提，就成为大福德聚的来源。弥勒菩萨说：“行十法行者，获福聚无量。”(《辨中边论》) <br>说“遍净庄严”就不是局部的净化和庄严。从因上观察，由于这种福德是依靠对一切众生作利益的贤善意乐所成就的，所以它能普遍地成就清净和庄严。 <br>念这一句时，应当发愿：愿我能周遍成就清净、庄严的殊胜福德力，所有梵天、自在天等的福德都不及它一毛孔的福德。因此这是发愿誓欲成就映蔽一切的福德，念念摄受一切福德聚。",
                      "「无著无依智慧力」 <br>以智慧证悟远离一切戏论的真如的缘故，无所著、无所依。或者，智慧是指对一切所知了达的心。无著就是对过去、现在、未来三世不住著，以不著任何法就能无障无碍地见一切所知。 <br>这是发愿成就一切不著、无依无缘的智慧力，断尽一切执著，照见一切所知。",
                      "「定慧方便威神力」 <br>包括三种力——定力、慧力、方便力。 <br>定力是三摩地的力量，从利他上说，就是为了利益有情无障碍地成就神通等的功德。慧力指证悟诸法实相的智慧力。方便力：可行叫做方便，就是有办法行得通，做出来有效果；力是指做出来有效力。 <br>念这一句时，应当发愿：愿我成就禅定的威神力、智慧的威神力和方便的威神力。",
                      "「普能积集菩提力」 <br>“菩提”指无上正等正觉。什么是菩提力？就是自相续能速成诸佛不可思议功德的力量。依止上面的种种事业，就有堪能证得菩提的力量。“普能积集菩提”，就是指能切实地修集一切能证大菩提的因。 <br>念这一句时，应当发愿：愿我具足能积集一切菩提之因的力量。 <br>以上这组“力”的愿是发愿希求能在自相续中引发十种力，也就是誓欲令神通、普门遍入大乘等的十种功德都达到违品无法侵夺的境地。",
                      "<1><42> <i>  13、修习对治 </i>   <br>上面十力的违品是业、烦恼和魔。以下一颂就讲摧伏业、烦恼、魔的对治。  <br>「清净一切善业力」 <br>怎样才能让业清净呢？这需要由逐层的净治把杂染业力从相续中除遣出去，也就是，从粗至细，依次净除不善业的业力、有漏善业的业力和有漏不动业的业力。 <br>１、净除不善业力：决定感果的不善业的力就是能引生三恶趣的力。如何净除它呢？需要由反面的能清净、能遣除、能破除等的力量来净除。有哪些能净除不善业的力呢？有四力——破恶力、恢复力、对治力、依止力。 <br>经上说：“造了很多罪业，对自己作呵斥，罪业会变得轻微。如法地发露忏悔，未来再不犯，具有这样的恢复力，罪业就能清净。”这是说，以破恶力和恢复力能令不善业的力量变小甚至消尽。",
                      "四力都是指心上的力量。物理上，以一种力能抵消或破坏另一种力。心也如此，心虽然不像色法有形有色，但缘起上确实有正反两种力量，以一者能破坏另一者。我们首先要发愿具足这四力，然后通过修持来真正获得这些力。我们求证菩提，有很具体的逐步修证的过程，修证的前提就是真诚发愿。“因地不真，果遭迂曲”，发愿不真，修行就不真，所以每一步都不能虚假。我们也许从没发愿要修得破恶力等，更没有以愿力推动主动闻思、修习业果。所以，这些经文的内容还没有成为自己修行中的主题，表面上叫做修行人，实际心并没有融入菩提行。我们不能进步的原因之一，就是没有真正的行愿，没有拿出真心来改变自己。 <br>第三、由对治力也能清净。比如，匝哦之女用脚踢母亲的头部，母亲是恩德田，伤害母亲即生就会成熟恶果。但他后来只稍微受了一点果报，原因是他发起了自他相换的善心，有力净除了罪业。他是怎样发心的呢？当他堕地狱时，见空中飞来一个热铁轮在一个地狱众生的头上飞旋。这时候他想到还有千千万万的人都造了同样的恶业，都要感受“铁轮顶上旋”的果报，他就发愿这一切苦都由我来代受。以这个善心的力量净除了业力。 <br>第四，以依止力也能清净罪业。比如佛世时有个三十三天的天人，即将以业力投入猪胎。这时他至诚皈依三宝，情况马上逆转，他不但没堕落，还上升到更高层的兜率天。他是在定业快成熟时以至诚皈依三宝而净除业力的。可见皈依三宝能净治罪业。",
                      "在诸多对治力中，能从根灭除业种子的方法，就是证悟法无我。《业障清净经》中讲了一位比丘造了不净行和杀母两种重罪。后来他特别后悔、难受，像疯了似的，从一所经堂跑到另一所经堂，从一座城市走到另一座城市。他在众人面前说：“我毁灭了！我毁灭了！”一再哀泣：“唉！唉！我错了！我错了！”他由诚心悔过的力量让罪业得到减轻。正当他深自悔责时，有个具他心通的菩萨为他开示了殊胜妙法，他因此证悟了法无我，一切罪业都得以摧坏，证得无生法忍。这个例子表明，证悟法无我能从根摧毁罪业种子。 <br>另一个要点是：对于殊胜的法生起信解，能遣除一切堕罪和后悔，能净除一切业障。我们对这一点应当深信不疑。《金刚经》说：“善男子、善女人，受持读诵此经，若为人轻贱，是人先世罪业，应堕恶道，以今世人轻贱故，先世罪业则为消灭，当得阿耨多罗三藐三菩提。”可见，依靠受持读诵《金刚经》，以正念真如修习殊胜之因，能灭除应堕恶道的罪业。《宝性论》说：“若由数近恶人故，具有恶心出佛血，杀父杀母杀罗汉，破坏最胜和合僧，若能思维修法性，此人速疾从此脱。”也讲到了由思维修持法性能解脱五无间罪。",
                      "又，如果发起了无伪菩提心，也能极大程度地净除过患之因的不善业。《入行论》说：“菩提心如劫末火，刹那能毁诸重罪。”这是说，当自相续中现前菩提心时，能如劫末火那样一刹那就烧毁诸多重罪。 <br>有人怀疑：修习对治法能净除轻微和中等罪业，还可以理解。但要从根净除五无间罪等的重业，恐怕很困难吧！ <br>答：像未生怨王造了杀父重罪，本来要在地狱中安住一劫，但他依靠四力净治罪业，最后堕地狱时像皮球刚落地就弹起一样，地狱的异熟果几乎消减殆尽了。所以罪业不论轻微、中等、严重，只要具足破除罪业的四力，就能无余清净。",
                      "又有人怀疑：经上说：“假使百千劫，所作业不亡，因缘会遇时，果报还自受。”明明说了经百千劫也不空耗，怎么能让重业化为乌有呢？ <br>答：经文的密意是：如果没有生起罪业的对治，业不会无因无缘就减轻或消尽。但具有对治力如法地忏悔，因缘也随着转变，按对治力的大小而相应地净除罪业。经论上说，愚人造了小罪也变成堕落地狱感受极重苦果之因，智者造了重罪也能不受果报。 <br>总之，应当发愿在自己的相续中具足依止力、破恶力、恢复力和对治力。这是祈愿“清净一切善业力”的具体内涵。发愿具体化很要紧，要发起修出四力的决心来。真正下了决心，才谈得上有愿力。愿力真实了，修持就会真实。",
                      "２、净除有漏善业力 <br>有漏善业指杂有烦恼的善的造作，有力引生三有诸果。这种业力不净除，就会引发三有的种种果报，不能解脱生死。如何净除它的势力呢？需要依靠愿力回向，也就是内心放弃三有的一切异熟果后，一心唯求无上菩提，这样以愿力回向就能净除。 <br>３、净除不动业力 <br>不动业指色界、无色界行持的不动业和以四禅、四无色定所引起的业。如何净除它的势力呢？心中完全舍弃上界的果报后，能自在地把握自己的业(自在地把持身口意的造作)，让心随自己的意愿唯一为利有情而精进，这样内心脱离了不动业的运作轨道，就能净除它。",
                      "「摧灭一切烦恼力」 <br>贪欲等逼恼身心的缘故，叫做烦恼。或者说，一个法在刚刚生起时就使内心不寂静，这样的法就是烦恼。 <br>烦恼力有何表现呢？以烦恼的作用，无量众生对理与非理、利与害、重与轻等等不觉知，在心态和行为上颠倒趣入。 <br>有很多方法都能摧伏烦恼，比如修不净观或者以世间道压伏等等。总之，这里是发愿能自在地利用烦恼，由此能修习菩提分的种种法。 <br>「降伏一切诸魔力」 <br>“魔”，指天魔等的四魔。他们有干扰的力量，能对修菩提行等作障碍。能令魔无法施展力量，或者能以神通力灭除魔力，叫做“降伏一切诸魔力”。",
                      "「圆满普贤诸行力」 <br>“力”指违品不能为害，能任运地趣入。“诸”是一切的意思。“圆满”是指上面速疾周遍等的十力和三种对治全部都具足。普贤诸行，每一种都到达违品无法障碍的地步，叫做“圆满普贤诸行力”。 <br>总之，念这一颂时应当发愿：愿我具有净除有漏诸业的力量，从根伏断根本烦恼和随烦恼的力量，降伏一切诸魔的力量，由修习对治违品的殊胜力而具有圆满普贤诸行的力量。 <br>法王曾说：《普贤行愿品》中的所有愿都可以归纳在这四句中。法王在朝拜印度金刚座转绕菩提座时，念了很多发愿文，主要还是以这一颂为主发愿。法王教诲说：我们朝礼神山、圣地、寺庙、佛塔、佛像，或者拜见高僧大德时，能够念《普贤行愿品》是最好的，如果时间有限，应该念这一颂发愿，至关重要。 <br>法王1997年写了《从四乘发挥的教言》。在这篇教言中，法王开示了为四众弟子传法的密意，其中，依“清净一切善业力”为居士众为主传讲了取舍善恶因果的《百业经》；依“摧灭一切烦恼力”为藏族尼众为主传讲了发菩提心、行菩萨行的《入菩萨行论》；依“降伏一切诸魔力”为汉族弟子为主传讲了《大幻化网》；依“圆满普贤诸行力”为藏族喇嘛为主传讲了《上师心滴》等无上大圆满法要。这间接告诉我们这一偈的内涵拓展开来，包含了浩瀚如海的显密佛法。依这一颂发愿，实际是发愿获得八万四千法门的精要，得到佛法圆满的成就。",
                      "<1><43> <i>  14、菩萨诸业  </i>   <br>“菩萨诸业”指圣者菩萨所行持的种种事业。具体指每个刹那都能严净诸刹海，解脱众生海，分别诸法海，深入智慧海，清净诸行海，圆满诸愿海，亲近诸佛海，供养诸佛海，修行经劫海。 <br>什么是事业？就是心的能力的外在发挥，比如太阳是本体，光、热是功能，由光热的发挥而长养万物是事业。圣者菩萨以证悟心性的力量，能令本具的功德周遍地发挥作用。心性远离垢障就能起不可思议的妙用，能在一个刹那就做到严净诸刹海、解脱众生海、分别诸法海等等的极广大事业，远远超过了凡夫和小乘阿罗汉的境界。比如世间杰出人士也拥有教育、环保、慈善等等的事业，但在效率、影响、成果等方面无法和圣者菩萨相比。比如圣者菩萨一刹那就能往诣无量佛前广兴供养，能教化十方无量众生，而世间的一个教育家一时只能为几百、几千个人授课，而且一个刹那决定说不出一个字来。所以在做事业的能力上，凡夫和圣者有天壤之别。 <br>我们应当心怀最远大的志向，不应以做一些世间事业为满足，应当发愿追随圣者菩萨，成就与他们同等的事业。 <br> 海表示无量无边。藏文每一句都有“能”字，汉译为了照顾译文的优美和气势，有几句省略了，但我们持诵发愿时，要有“能”的内涵在里面。",
                      "「普能严净诸刹海」 <br> 无量无边的刹土叫做刹海。以修证的力量普遍净除无量刹土中的器情垢染，令其清净，功德庄严，叫做严净刹土。念一句时，应当发愿：每个刹那都能令如海的刹土像极乐世界一样清净庄严。",
                      "「解脱一切众生海」 <br> 观察轮回的现状就知道，无量无边的众生都身陷在三有牢狱中，被铐上烦恼枷锁，日日夜夜受众苦逼恼，无量劫不得解脱。我们要发愿：一切系缚在惑、业、苦中的众生，我能在说法时以身神变和意神变让他们欢喜、满足，之后，以语教诫神变宣说妙法，让他们当下心得解脱。",
                      "「善能分别诸法海」 <br>诸法海包括讲述方面的教法海和修证方面的证法海。教法按经、律、论分，有无量的文句法蕴，证法按戒、定、慧分，有无量的证德，所以都叫做海。 <br>念这一句时，应当发愿求证慧眼一一刹那都能别别观见如海教证诸法的无上境界。就像一面大圆镜子顿时照见森罗万象那样，智慧眼一时就照见如海的教法和证法，对无量法的每一细节都了了分明，毫无错乱。 <br>这不是一般智慧的作业。一般智慧的作用相当有限，比如一次只能了知有限的一部分；对于一分法的意义，也要通过渐次地观察才能有所了知；或者，只是在文句上了解，对于内证的境界却茫然无知。",
                      "大家观察，比如看一页书，迟钝的人做不到“一目一行”，观察力敏锐的人却可以“一目十行”。又比如有这样的修行人，初学道时看不懂经文，但悟道后开了智慧，再看经书，一目了然。这些现象都说明有情本来具有观察的能力，只是被障碍遮蔽而使观察力变得狭小、暗钝，等到障碍消除时，就能现前慧眼一时照见无量法海的境界。比如，全知麦彭仁波切是意伏藏之王，在他老人家心中能一时顿现无量无边的法义，无量的显密法海、菩萨地道修证的境界都能极透彻地见到。有这样的智慧，就能起无边妙用，能做极广大的佛法事业。 <br>这里，发愿的重点是誓欲把心性本具的观察力开发到究竟，也就是誓愿求证到一刹那就能顿时无杂照见一切教法海和证法海的智力。",
                      "「能甚深入智慧海」 <br>从哪个角度讲智慧是如海呢？打个比方，我们称赞某人智慧如海，是指他对各领域的现象、原理等都了如指掌。由此就知道，是从“智慧的境无量”上来说智慧如海的。所以，智慧海是指对诸法的性相、因果等的无量所知一一通达的智慧。 <br>了知了智慧海的涵义后，再认定这里发愿希求的目标。这里是希求每个刹那都能深深趣入了知无量尽所有相的广大智海(“深入”是现证的意思)。这是针对了知尽所有相的广大智慧，誓欲使其作用开发至究竟。所以，重点在发愿令本具的广大智慧的妙力开发到最究竟。颂中“能”字是关键字，表示能力、作用。当广大智慧的力量开发至究竟时，就会现前每个刹那都能入于广大智海的境界。",
                      "<1><44>「普能清净诸行海」 <br>所谓行海，“行”指菩提行——能成就佛菩提的妙行，“海”指无量支分。菩提行就是福慧资粮——能成就佛功德法的智慧资粮和能施予一切众生利乐的福德资粮。成就佛果需要圆满无边的福慧资粮，福和慧都要修到最圆满为止，要修满一切菩提行海，无欠无缺。 <br>这一句重点落在“能清净”上。“普能清净诸行海”，就是能做到普令一切菩提行都清净无垢。以布施为例，在行布施时，内心没有悭贪等的烦恼垢；进一步，执著能施、所施、布施的分别心也空净了。像这样，行持一切菩提行时，都能净治违品，不染垢秽，叫做“普能清净诸行海”。",
                      "有人疑惑：怎么能在“清净”上说能力呢？清净上确实有能力的大小，比如行菩提行时，有悭贪、嗔恚等障垢，都会使菩提行不清净。对于这些违品，你能伏住吗？能断除吗？有多大的净治能力呢？在它现起时，是当下能空净，还是需要经过长时对治才能止息？或者是能净治有限的几种障垢，还是能净治一切障垢？……这样观察就知道，清净菩提行的能力因人而异，大有差别。那么，净治的能力到达究竟是何种境界呢？就是一一刹那都能令无量的菩提行清净无垢。这就是我们发愿求证的目标。 <br>总之，念这一句时要发愿求证一一刹那都能令一切菩提行海清净的境界。",
                      "「圆满一切诸愿海」 <br>这是发愿一一刹那都能以戒、定的力量圆满无量菩萨愿海。也就是，每个刹那都能令无量的菩萨愿圆满地实现。比如，利益众生方面的许多愿——愿众生见闻忆触即能灭除罪障、增长福德、获得辩才、开启智慧、增益菩提心、止息烦恼、坚固正念等等，所有这些发愿都能在一个刹那圆满地实现。总之是发愿让自己一切发愿的能力都毕竟圆满。",
                      "「亲近供养诸佛海」 <br>这是发愿一一刹那都能化现无数身显现在十方诸佛刹土，亲近如海诸佛，以周遍虚空界的普贤供养云献上供养。 <br>这里的要点是誓欲使心性本具的供养妙力显发至究竟。比如，我们当下就能在佛像前供养一朵花，说明我们本具供养的妙力，土木砖石冥顽不灵，不会供养，可见供养唯是佛性的作用。我们要尊重己灵，使自己佛性的妙力无限地发挥、周遍地发挥。我们现在被客尘烦恼障蔽了，使得灵知狭小局促，等到消尽了虚妄分别时，心性妙力就能彻底地彰显，遍界发挥。这时是佛位的普贤。我们为了求得生命境界的圆满，应当发愿令心性本具的供养妙力毕竟圆满。当供养的妙力到达究竟时，就能一一刹那化现无数身在无量佛前遍虚空界广兴供养，这就是普贤的自性无障碍地尽性发挥。 <br>大家要懂得普贤行愿的重点是在这里。想一想，欲证入如来不可思议的解脱境界，能不发起普贤行愿吗？不发普贤行愿，就没有成佛最圆满的因，怎么能趣证大方广的佛果呢？大家知道，“大”是指体的常遍，即性体遍一切处，无始无终，含裹十方三世。“方”是指相大，圆满含摄常乐我净、智慧、慈悲等的恒沙性德。“广”指用大，能起一切作用。我们的佛性是如此不可思议，要开显它，就必须依仗称合本性的普贤行愿。",
                      "「修行无倦经劫海」  <br>这是发愿：以上这七种事业在无量劫数中行持也无丝毫厌倦，以精进波罗蜜多的力量勇猛勤修，永无疲厌地严净诸刹海、利益众生海等等。 <br>以上这八种事业海，一一刹那都修行无缺，叫做毕竟圆满《十地经》所说的菩萨十自在、十力等。这是成就十地(法云地)时的主要事业，但它的同类在十地之前也有显现。 <br>以上这些圣者地的大愿，我们在最初学习时，需要在念诵愿文时，以心作意圣者菩萨的事业行相而发起猛利胜解。这样以随文发愿为起点，向着高深的地道进趣，熏习殊胜法门。",
                      "我们发愿务必要目标明确。就像射箭，瞄准了目标，才能有的放矢射中靶心。如果目标不明确，那就成了无的放矢，怎么能让作意到位呢？很多人不清楚作意的法相。作意就是把心有意识地引到所缘境上去，所缘境不明确或者有错误，就不是如理作意。我们持诵普贤行愿，不能充分地和愿王相应，不能强猛地促发善根，一个关键的因素就是没有吃透愿的内涵，没有认定好所愿的目标。所以，心中不能现起所愿境，即使很努力勤作，也收效甚微。 <br>大家都读过书，知道在学生中有些学习很用功，但没有掌握要领，事倍功半，成绩不佳。又像练武的人空有浑身力气却不懂得如何发力，但练武的行家轻轻松松，运转自如，四两拨千斤。所以，关键是要开智慧，懂方法。智慧就像眼目那样重要，有智慧才懂得怎么发愿、怎么修持，不然就像盲人一样。",
                      "从“力”的发愿系列到“海”的发愿系列，有一层递进的关系：“力”的系列是发愿种种妙行都成就违品不可夺的力，“海”的系列更进一层，是誓愿令种种力的作用都毕竟圆满。这真是志气凌云，誓于如来行处行。心真能和这些无上大愿相应，会极强地摧发善根，会像雨后春笋那样不可抑制地发起。与普贤行愿相比，世间人的人生理想、外道希求升天的愿望、小乘唯求自了的发心都太渺小、太狭隘了。对比这些，我们会深深地觉悟到，一切有佛性的有情最应该发的就是称性的普贤愿王。觉悟到这一点，就要把普贤愿王如意宝安放在内心最深处，尽未来际恒不忘失，念念相续不令间断。",
                      "<1><45> <i>  15、随学诸佛菩萨的回向 <br>分二：(1)随学如来的回向 (2)随学菩萨的回向  <br>(1)随学如来的回向 </i>   <br>「我皆供养」：“供养”指法供养。愿诸佛所愿、行诸佛所行，是真法供养。 <br> 这是发愿：过去、现在、未来一切诸佛为了成就最殊胜菩提所发过的一切行愿种类，我都一个不缺地全部圆满修习，愿我以修持圆具一切善的普贤行现证无上菩提。 <br>这表达了一位普贤行愿行者的极伟大志愿。他选择成就菩提的道路，是全身担荷起三世诸佛的所有行愿，以最壮阔的普贤行来取证无上菩提。他的胸襟就如海纳百川，无论有多少佛，无论佛有多少种行愿，一切都供养、一切都圆满修持。就像虚空不会拒绝任何色相的发挥，普贤行愿的行者不会拒绝任何诸佛的行愿。这里没有任何局限、没有任何偏袒，有的只是求证菩提最勇猛、最广大的意乐。",
                      "学习这一颂时，意中要想到：过去、现在、未来无数的佛陀为求证得无上菩提在行菩提行时都发无量的行愿，比如释迦牟尼佛为了救度浊世众生，发了五百大愿为根本的无量行愿；阿弥陀佛为了接引众生速成佛道，发了以四十八愿为根本的大愿海，就像这样，每一尊佛都有无量行愿，这一切佛的行愿，我都誓愿修持，直到毕竟圆满为止。我誓愿以圆摄一切善行的普贤行来现证无上菩提。 <br>总之，这是自己内在毕竟圆满三世诸佛一切行愿的发愿。能如此发愿，一切诸佛的发愿种类都包含在其中，成了普贤行愿的支分。从此，以诸佛所愿为己愿，以诸佛所行为己行，这样以最广大的普贤行来显发自己心性无量、无尽的妙德。这是立志走最圆满、最壮阔的菩提路，根本不是以获得人天善趣、获得阿罗汉果为究竟目标，这就是无等无上的大乘佛道。",
                      "<1><46> <i>  (2)随学菩萨的回向 </i>   <br>这里“菩萨”是指释迦佛的左右胁士——普贤和文殊。毗卢遮那佛(法身佛)、普贤、文殊，叫做华严三圣。其中有甚深的密意，普贤主一切诸佛的理德、定德、行德(“理”即法界本体)，与文殊主一切诸佛的智德、证德相对，表示理智一双，行证一双，三昧般若一双。因此，以普贤、文殊作为佛的胁士，文殊骑着狮子侍奉在佛的左边，普贤乘着白象侍奉在佛的右边(现在反说智是右、理是左，是表示理智相互融通)。理智相即，行证相应，三昧与般若不二，即是毗卢遮那法身佛。《华严经》所阐明的意义都归于这一佛二菩萨的法门中，所以叫做“华严三圣”。 <br>我们要想速证法身，关键就在引发内的文殊智和普贤行。上面的无量行愿归根结底就是发愿随学普贤的大行和文殊的大智。所有的菩提行愿都不离这个核心。所以这里就摄要宣说发愿随学文殊、普贤。",
                      "<1><47> <i>  分二：①愿等普贤 ②愿等二圣 <br>①愿等普贤 </i>   <br>就是回向随学身口意的行为、刹土、愿力一切都清净的普贤菩萨。 <br>凡是诸菩萨的普贤行，菩萨所有的传记、所有的三摩地，总之一切菩萨有多少种的功德，就有那么多到达究竟，以这个原因，尊称普贤是一切如来长子。(按密教说，普贤是密教初祖金刚萨埵。金刚智《五秘萨诀》说：“金刚萨埵者，即是普贤大菩萨异名也。亦名一切如来长子，亦名大阿阇黎。”) <br>有着“一切如来长子”尊称的普贤大菩萨，为了达到和他同等的智慧和行为，我把以上的善根在每一刹那中都作回向。(这是最核心的愿，所以念念如是回向。)",
                      "以上“愿等普贤”的发愿再具体化，就是愿我的身口意恒时都清净，愿一切的行为和刹土恒时都清净，唯一像大圣普贤菩萨那样，愿一切的一切都与他同等。为了成就此普贤行，我把所有的善根往这方面回向。 <br>以上是回向能如普贤菩萨那样具足五种清净。即：身清净，一身化现刹尘身等；语清净，一音流现一切音等；意清净，念念菩萨行海现在心前；行清净，波罗蜜多行、静虑行、三摩地行等一一刹那无余清净；刹土清净，刹土器情具足功德庄严，一一刹那使令清净。以这样的清净相作为标准，像善巧的普贤菩萨那样，我也如是如是地随学，与他一切皆同等。",
                      "《大毗卢遮那成佛经疏》说：“普贤菩萨者，普是遍一切处义，贤是最妙善义。谓菩提心所起愿行，及身口意悉皆平等，遍一切处，纯一妙善，备具众德，故以为名。”(“普贤”这二字拆开来讲，“普”是指妙体遍一切处。“贤”是最极妙善。这就是说，以菩提心发起的愿、行和身、口、意都平等遍一切处，纯一妙善，具足万德，所以叫做普贤。) <br>《华严经探玄记》云：“德周法界，曰普；至顺调善，曰贤。” <br>《清凉疏》上讲：这里“同等”，不仅是无量阿僧祇的愿，而且是如同法界量的无尽愿行，都发愿等同。 <br>问：为什么在“随学菩萨”中首先只单说“愿同普贤”呢？ <br>答：因为这一品说的是趣入佛果的无量行愿，而一切菩提行的本体正是普贤，所以首先单说“愿同普贤”。",
                      "<1><48> <i>  ②愿等二圣 </i>   <br>念这一颂时，应当祈愿：为了清净一切普贤行和成满文殊师利的诸大愿，我誓欲圆满他们所有的事业，在尽未来的一切劫中恒时无有厌倦，也没有别的庸俗之念。",
                      "<1><49>念这一颂时，应当祈愿：我所作的修行成为无量；我所获的功德也无量；我安住无量的修行和功德后，对于诸佛菩萨的种种神变等全部无碍了达。 <br>这是具体发愿：一切菩萨的广大修行无不圆满，所担荷的修行无量无数，广大无边。所获的功德也无量无边，也就是获得一切不可思议的身密、口密、意密的功德。这样，安住无量诸行后，对于诸佛菩萨的无量神通力都能了达，都能现证。",
                      "<1><59>这里随学的是文殊的大智和普贤的大行。“勇猛”是形容智慧的力量，文殊以智慧剑从根斩断我执无明的命根，叫做勇猛。“普贤慧行亦复然”，就是说，不仅随学文殊的勇猛智，也随学普贤的巧慧行。“行”前加一“慧”字有甚深意义。“慧”是巧慧。《维摩诘经》说：没有以智慧摄持的方便是菩萨的系缚。可见普贤行是巧慧行，里面有灵明的智慧。不然，执著那么深重，连基本行为都做不好，怎么能施展无边妙行、广大地起用呢？真正说来，以根本智证悟法界后才能流现广大的菩提行。所以智慧和方便不能脱离。 <br>有人问：为什么要回向世世生生随学文殊、普贤呢？其中有何重要的意义呢？ <br>《清凉疏》上解释：“文殊表解，解发愿故。普贤表行，解起行故。故愿与行分属二圣。”(文殊表示甚深的解，有智慧才理解种种发愿的意义。普贤表示广大的行，就是由解所发起的万行。所以，愿或智慧属于文殊，行属于普贤。)这是用解、行一对作解释，文殊表示能起的解，普贤表示所起的行。弥勒菩萨说：“汝得见诸善友，闻菩萨行，入解脱门，都是文殊的威神之力。”这是说，由智慧解了才发大愿，以愿力推动才亲近善知识、听闻菩萨行、趣入解脱门，所以都是由文殊的威神力所致，意思是，以智慧才发起了这一切。经上还说文殊常为一切菩萨之师，意思是，以文殊智为指导才出生菩萨万行。",
                      "总之，智慧如目，行持如足。目足需要并运，缺一不可。没有文殊智不能了悟本具的妙明真心，没有普贤行不能圆显本具的万德庄严，文殊智和普贤行并运才能修成“明行足”的佛果。这是本颂所寓含的深义。从这个意义上说，一切菩提行的要点都归摄在这一颂中。因此回向善根常学文殊、普贤。 <br>法王《愿海精髓》有一句愿文说：愿一切生世得到父亲智慧藏文殊勇士的欢喜摄受，愿毕竟圆满普贤行愿所说的菩提行海。和这一颂意趣一致。",
                      "<1><60>念这一颂时，应当回向：过去、现在、未来诸佛一致称叹的如是最殊胜诸大愿，我此刻把自己修持的善根，为证得普贤殊胜行，而猛利回向。 <br>这一颂提到普贤愿是最殊胜的大愿，这是因为：在普贤行愿中总集了一切佛陀稀有的行为，包括菩提道从因至果的所有行愿，而且，愿愿称法界心、极法界量；从作用上说，以普贤行愿力能速疾证入不可思议的解脱境界，能引生暂时、究竟的无边利益，成为现证菩提的最强因；从他利而言，以普贤行愿作回向，能成为在三有存在期间让尽虚空界的有情增长无边利益安乐的法宴。由以上这些原因就说普贤行愿是最殊胜的行愿，三世诸佛无不称叹。 <br>龙树菩萨说，以上“文殊师利勇猛智”等二颂是极殊胜的回向，前面的一切大愿都总摄在其中。",
                      "<1><61> <i>  16、净土愿 </i>    <br>读过《华严》的人都知道，在《华严》最后一会《入法界品》中，善财童子以十信后心接受文殊的教导，参访一切善知识。最初在德云比丘那里听闻念佛法门就证得初住，成为法身大士。从此遍参诸善知识，都有所证。最后到普贤菩萨处，蒙大士开示和威神加持之力，所证等同普贤、等同诸佛，这时是等觉菩萨的地位。 <br>普贤菩萨为善财童子说偈，称赞如来殊胜功德，劝导善财童子和华藏海众，一同以十大愿王的功德回向往生极乐世界。这就是通常说的“十大愿王导归极乐”。 <br>普贤菩萨为什么要劝进善财童子和华藏海会导归极乐呢？他们都是法身大士，尚且要求生西方，其中一定有甚深的密意。什么密意呢？西方表示太阳升于东而落于西，是结果圆成之意，求生西方就是为了圆成佛果。扣到本品上说，就是因为往生阿弥陀佛的净土，能够在一生中速疾圆满普贤行愿而证入不可思议的解脱境界。",
                      "有人怀疑：普贤行那么深广，能在一生就圆满吗？有那么便捷的事吗？这里关键要理解到弥陀愿海具有不可思议的加持，在弥陀愿海中圆满具足了令往生者速得成就普贤行的力量。以下举例说明： <br>比如，阿弥陀佛发愿：假使我成佛，我国中的天人若不识宿命，下至不能了知百千亿那由他劫中之事，我不取正觉。假使我成佛，我国中的天人若不获天眼，下至不能见百千亿那由他佛国的现象，我不取正觉。假使我成佛，我国中的天人若不获天耳，下至不能听闻百千亿那由他诸佛所说的法，不悉皆受持，我不取正觉。假使我成佛，我国中的天人若不获他心智通，下至不能了知百千亿那由他诸佛国中众生的心念，我不取正觉。假使我成佛，我国中的天人若不获神足通，下至一念顷不能越过百千亿那由他诸佛国土，我不取正觉。",
                      "阿弥陀佛已经成佛十劫，他所发的一切愿都圆满实现了。因此，往生他的净土就能获得宿命、天眼、天耳、他心、神足等的广大神通。上面每一愿都以百千亿那由他为最下限，说明净土圣众具有远超诸天和阿罗汉的大乘神通。比如，在我们人间，如果有人知道八万年以内的事，能够一念间越过一千个世界，大家是否觉得他是不可思议的成就者呢？但与极乐世界圣众的神通相比，不在一个量级上。因为百千亿那由他是个无量的数字，净土圣众得到宿命通能了知无量劫以来的宿命，又获神足通能一刹那越过无数世界。这种神通广大到何等层次。其它如天眼宽阔，能洞视十方无量世界的种种微细色法和无量众生生来死去的现象；天耳广大，能彻听十方无量诸佛说法的音声，而且闻后都能受持；他心遍知，能了知百千亿那由他佛国中无数众生的起心动念，一个佛国含有十亿个世界，每个世界都有无量众生，以百千亿那由他佛国来累知，其众生的数量是多么不可思议啊！像这样，无量众生的起心动念，净土圣众一念间就能全部了知。 <br>了解了这些，再对照普贤行愿，就知道往生西方是成就普贤愿的最胜方便。比如普贤愿中“我为菩提修行时，一切趣中成宿命”，往生之后成就了广大的宿命通，而且一得永得，不再退失，所以以愿力再受生六道一切趣时，都能了知宿命。了知宿命就不会退失菩提心，因为对无量世所受的种种苦难记忆犹新，就不会耽著世间五欲，也不愿造任何恶业；又知道无量生以来都蒙受诸佛菩萨的救度，也就不会生傲慢心；又知道前世发过菩提心，时时记得，时时会以菩提心摄持。",
                      "又如普贤愿“我常随顺诸众生，尽于未来一切劫”，往生西方得到了他心通，一念间就知道十方无量世界无数众生的心念，这就能真正做到随顺众生的意愿来帮助他们。而且，获得神足通后不再退失，也就现前了“速疾周遍神通力”。 <br>又如普贤愿“三世一切诸如来，于彼无尽语言海，恒转理趣妙*轮，我深智力普能入”，由弥陀大愿的加持，往生之后能听到无量诸佛说法，听后都能受持不失，这样遍闻诸佛说法，现前成就趣入无量佛语的大愿。",
                      "又如阿弥陀佛发愿：假使我成佛，国土清净，悉皆照见十方一切无量无数不可思议的诸佛世界，如同对镜看自己的面像那样一目了然，不如是，不取正觉。假使我成佛，国中菩萨欲见十方无量庄严佛土，当时就如其心意在宝树中分明遍见，不如是，不取正觉。因此，往生之后在宝树中能现见无量佛国，现前一尘中有尘数刹的境界，普贤愿所说“普尽十方诸刹海，一一毛端三世海，佛海及与国土海，我遍修行经劫海”，并非天方夜谭，而是能够真正实现的。 <br>又如阿弥陀佛发愿：假使我成佛，国中菩萨以佛神力加持供养诸佛，若不能在一食顷(吃一顿饭的功夫)遍游无量无数亿那由他诸佛国土，我不取正觉。可见往生后能实现遍供十方诸佛的普贤愿。",
                      "又如阿弥陀佛发愿：假使我成佛，国中菩萨不能演说一切智者，不取正觉。假使我成佛，国中菩萨若受读经法、讽诵持说，不得辩才、智慧，我不取正觉。假使我成佛，国中菩萨，智慧、辩才可以限量，我不取正觉。阿弥陀佛的这些愿都实现了，所以往生之后能成就一切智慧，获得无边辩才，即获得四无碍解，善于演说无量佛法的深密涵义。加上前面所说，能听闻诸佛的无量法语，一一受持在心。因此，往生后“愿持诸佛微妙法，光显一切菩提行”等愿，都能现前成就。 <br>又如阿弥陀佛发愿：假使我成佛，国中声闻有能计量，乃至三千大千世界的众生都成缘觉阿罗汉，在百千劫中共同计算，有能知道其数量者，我不取正觉。这里声闻是指大乘菩萨，《阿弥陀经》上讲：往生极乐的人都入不退转位，其中多有一生补处菩萨，数量极多，根本不是算数所能了知，只有用“无量阿僧祇”来描述。像这样，西方净土有无量的补处菩萨和诸地菩萨，这就实现了与同分菩萨会遇的普贤愿。而且，能真正做到与善知识恒不分离，常令善知识生欢喜心。",
                      "又，阿弥陀佛发愿住世的时间不可限量，下至不到百千亿那由他劫，不取正觉。因此能恒时见佛，常不离佛。不仅不离阿弥陀佛，也不离十方诸佛，因为往生之后能够一念顷遍游十方佛国，承事供养诸佛。所以“生一方即生一切方”，“见一佛即见一切佛”，由往生就能现前周遍法界的普贤行。 <br>又如阿弥陀佛发愿：我成佛时，他方佛土的诸菩萨众往生我的净土，都必定究竟到达一生补处，除了以其本愿自在教化众生，为众生披大愿铠甲积累功德，度脱一切……开化恒河沙数无量众生，都安立无上菩提道，超越一般的修行位次，现前修习普贤之德，若不如此，我不取正觉。所以，往生西方获得成就后，就能在净土毕竟成为一生补处菩萨。如果以宿愿力要入浊世救度众生，也能随愿力自在无碍地教化。这时所作的利生事业极其广大，是开示教化十方世界恒河沙数无量众生，能普令发菩提心、行普贤道，而且受生秽土不会再由种种因缘堕入恶趣。所以依仗弥陀愿力的加持就能实现利益众生的大愿，所谓“悉除一切恶道苦，等与一切群生乐，如是经于刹尘劫，十方利益恒无尽”。",
                      "龙树菩萨曾说：游戏地狱的行者在往生极乐证得无生法忍之后，再回入生死国，教化地狱苦众生，以此因缘求生西方净土。自古以来，有无数悲愿宏深的菩萨都誓愿往生极乐世界，原因就在这里，因为往生西方净土之后就能最彻底、最圆满地利益众生。因此很多大德发愿：愿生西方净土中，九品莲花为父母，花开见佛悟无生，回入娑婆度含识。 <br>《净土圣贤录》记载：觉明妙行菩萨在晋朝时是一个普 通的凡夫人。他修行念佛，七十五岁往生，在面见阿弥陀佛之后，为酬宿愿，很快就回入汉地，示现过种种身份，现过国王身、比丘身、居士身，甚至屠夫、妓女身等等，以这样的方式度化众生。这就真正现前了“犹如莲花不著水，亦如日月不住空”的无碍境界。所以，往生西方是一生成就的法门，其利益之大，唯佛与佛乃能知。以这个原因，普贤菩萨劝进华藏海会一致发愿往生极乐，因为这是能速疾成就普贤愿的无上方便。",
                      "全知麦彭仁波切说：“以一切所知中具有无与伦比的功德者，获得佛果的因，即是行持无量菩萨行。想要修学菩萨行并欲救度一切众生摆脱危难、具有大悲心的人……令他们轻而易举便可圆满一切普贤行愿的殊胜方便，即是发愿往生极乐世界。其原因为：依靠佛陀的愿力和智慧力，仅以信心希求心便能往生极乐世界，往生后无勤而获得信力等胜妙功德，不会退转，将圆满一切普贤行。佛彻见此理后，在《普贤行愿品》中说：‘愿我临欲命终时，尽除一切诸障碍，面见彼佛阿弥陀，即得往生安乐剎，我既往生彼国已，现前成就此大愿。’”(《净土教言》) <br>由上面的讲解就知道，普贤行愿最后导归极乐有甚深的密意。大家懂得之后，要殷重地发愿求生极乐世界。",
                      "下面就讲求生净土的愿，包括五方面：一、临终无障愿；二、见佛往生愿；三、成就愿王愿；四、得佛授记愿；五、利益众生愿。这五个方面合起来就是一条完整的成佛之路，如果能对此真信切愿，那下面的经文就不再与自己无关，而成了自己梦寐以求的成佛之路。 <br>成佛的道路多种多样，这里选择的是往生成佛，也就是经过短短几十年的这一生后，由自己的发愿和修持临终面见阿弥陀佛，一刹那顷就在西方净土的莲花中化生，花开见佛，听闻法音，顿悟无生，成就三身四智、五眼六通、无量陀罗尼门、三摩地门，获大自在，由此现前成就普贤行愿。蒙佛授记后，分身十方利益无量众生。是这样一条一生成佛的道路。下面这组发愿就是对这样一条一生成佛的道作猛利祈愿。",
                      "念这一颂时，应当发愿：到我临命终时能以普贤行愿力断除一切障碍，亲自面见阿弥陀佛，见佛之后，一刹那顷即往生极乐世界。 <br>临终时身有病苦、心有贪恋或者意识颠倒、生起邪见等，都会障碍往生。为此发愿临终无有障碍、直接见佛十分重要。因为临终见了佛，就会获得极大的安慰，以佛的加持能令心安定、欢喜。所以要这么发愿。",
                      "<1><62>念这一颂时，应当发愿：愿我往生极乐之后，现前成就这一切普贤大愿，也就是以上讲的无量的普贤愿都圆满成就。由此能在世间流转没有穷尽之间，对一切有情成办暂时、究竟的利益。也就是由自己来成熟他们的相续，让他们都发菩提心。这样，穷尽未来劫海，普能利益一切众生。",
                      "<1><63>这是发得佛授记和利益众生的愿。“彼佛众会咸清净”，指阿弥陀佛以清净海众围绕。 <br>念这两颂时，应当发愿：愿我往生时，我当时就在阿弥陀佛清净海会的净土，从种种光色庄严的七宝莲花中化生，莲花开了，我亲眼面见大悲慈父阿弥陀佛。佛以右手摩我的头顶，现前授记：“善男子！你将在某时某国土成佛，名号叫……”得到佛授记后，我分身无量，幻化的蕴周遍十方，以无著无碍的智慧力在无量众生界中利益无量无边的众生。乃至众生界尽之间，一一刹那都如是作利益。",
                      "讲到这里，有人说：既然如此，只念这一段就可以了，前面的发愿都可以不要。 <br>说者只知其一，不知其二。这里有大关键，就是以修持整部的普贤行愿为因能获得更快的成就，往生品位更高。《华严三昧论》说得好：其它净土经典所指，或说十念往生，或说一日乃至七日，或者观想佛身，总之都不超出数量，不像《华严经》一念普观，竖穷三际、横遍十方。这样初发心时即超出数量，在一切净因中最为殊胜。因为阿弥陀佛四十八愿遍摄众生与普贤愿王体合虚空(像虚空与虚空相合一样)，没有一点隔开，这样不移时、不易处、任运往生、还同本得(不必等时间、不必换地方，就在当下任运往生，往生之后仍是现前自性本有)。所以，我们应当以发普贤行愿趣入西方净土，究竟成佛。",
                      "下面讲一些法王如意宝的教言。 <br>我们五明佛学院有位南真堪布，写了一本康萨丹波仁波切的传记，有一段是这样讲的： <br>有一次五明佛学院开一年一度的长寿法会。这一年丹波仁波切的法体不太好，南真堪布就回家乡请他老人家来参加法会。 <br>这样，丹波仁波切就带着侍者赤诚桑波和南真堪布来到圣地喇荣，面见尊贵的法王如意宝。这时，法王显得非常欢喜。法王说：“现在堪布曲恰、西钦俄之仁波切等很多大德都圆寂了，您这次来参加学院僧众共修的长寿法会，我昨天下午从别人口中听到了。我想到‘您这次参加殊胜的长寿法会，身体有点病障也必定会遣除’后，我心里生起了很大欢喜心。你比我年轻，所以为了弘法利生，你也需要帮助我，否则……”说到这里，法王的话语就断了，泪水如雨般流下来，而且法王嘱咐他需要长久住世。 <br>这时丹波仁波切也边流泪边说：“法王一切智，您是总的佛陀圣教和众生利乐、特别雪域藏地的佛法和众生利益的共同怙主，您需要长久住世。”这样以祈祷方式唱了优美的赞歌。然后，供养长寿佛像等身口意的所依，又以美观、贵重、织有吉祥图案的藏毯等作为殊胜缘起，献上了供养，特别是当年为了法王长久住世所作的超过数亿的放生数量，对法王上师作了认真汇报，而且说：“我发愿死后能立即入三恶趣拔除具苦有情的痛苦，祈求上师赐予助我成就的加持。”",
                      "法王瞬间默然无语，很端直地坐了一会儿。之后，又显现得很欢喜，说：“呀！呀！呀！拉嗦(好！好！好！是！)。” <br>几天后，法王传法时说：“我们师徒需要专注一心地发往生西方极乐世界的愿。原因是：在怙主阿弥陀佛前，见佛的金容、听到佛的妙语、得到佛授记后，再作众生的利益没有(任何)困难。最近某大德在我这里说，他圆寂后就立即去金刚地狱，发这样的愿，而且说需要我赐予帮助。他是一位大自在的智者，也有大名誉，不但如此，也一定是安住大地的菩萨，我也对此有信解。虽然这些大德是这样发愿的，但我们发愿往生极乐世界，这个好！入三恶趣的愿没有发也容易转生的。”",
                      "下面是另一段教言。 <br>怙主法王住世的最后一年在极乐法会期间对在家信众作了最后的教导，法王说：“何时何地都非常难得的暇满人身宝，你们已经得到了。对这个好好想一想，不仅获得了暇满人身宝，还遇上了尊贵的善知识。不仅遇到了上师善知识，而且这些上师口中宣讲正法，即真实地在讲解该如何做善法、如何断除不善业。是这样的话，你们这些在家男女，他们讲的不一定全部都记住，你们要看其中的一两句能不能明白，明白了尽量按那么去行持。不管哪位上师，详细广讲很多的法，你们不一定需要全部都了解。因此应当要想：利益我自相续的法是哪种法好呢？ <br>这一次你们这些从四面八方来的具信男女和很多出家僧人来到喇荣，那么全部的目的主要是哪一个呢？从这里讲的话，自己、自己的亲友以及凡是结上善恶缘的众生，今生具有长寿、健康、福乐圆满，来世也生到极乐世界的方法，是哪个好呢？你们是想这次参加极乐大法会的共修，有这么好的方法，而全部来到此地的。到了之后，每个人要在自己心上写一个誓愿，写什么样的誓愿呢？自己一生修行的这个是需要认识的。一个一般的僧人说这个好、说那个好——只说这一点对你们的心相续利益还不够，那么说起对自己的相续决定有利益的是哪个法呢？我们主要对阿弥陀佛以信心作祈祷，这个是关键。因此你们昨天在大悲世尊的佛像前发愿念一百万阿弥陀佛圣号，单单这一次就已经达到了两百多亿的圣号。不但这一次，很多大德和喇嘛、觉姆以及国外劝人念阿弥陀佛，不到一千亿的话，至少也做到两、三百亿以上了。是这样的话，你们这次念诵一百万遍阿弥陀佛圣号，如实做了的话，上面说的善根，你们每个人都会按那样得到。你们回家时，自己心里也需要记住：这次，如果我认认真真念了一百万遍佛号，对于我的今生和死后决定有这么多共修的功德。今年参加法会，初步计算所共修的阿弥陀佛圣号就有七百亿。你们可以想，真正对你们是有这个善根的。",
                      "你们要知道，自己在某地闭关不见人，坐在那里念诵的，认为有很大善根。与大众共修，没有认为有那么大的善根。其实，你一个人念的，放逸而不回向，或者颠倒回向，或者对别人宣扬，以嗔恨心等等，这个善根是容易穷尽的。而这次法会中有上万出家僧众，如果你的善根与他们汇合在一起，就像一滴水融入了大海，这样的话，不可能有你本人的善根单独穷尽的情况。是这样的话，你一个人所念的根本无法相比，这是不可思议的善根。但这也不要单单想自己一个人，应该对周遍虚空的一切众生作回向。由回向祈愿这一切众生也全部都在临终无间就生在怙主阿弥陀佛的足下。应该这么想。这样做的话，虚空周遍之处的众生是无有数量的，那不是说二百亿、三百亿的数字了。所以世尊说：众生界无量，希求利他也无量。是这样说了的。 <br>因此，这次善根与其它不一样，是有个殊胜的利益。平常也应该对怙主阿弥陀佛作祈祷，多发往生西方极乐世界的愿。像这样的西方极乐世界，容易往生，往生之后功德又很大，这是何处也没有的。《极乐愿文》中这么讲了：誓愿往生数百亿佛刹的功德庄严合而为一、胜过诸佛刹土的无上殊胜的极乐世界。",
                      "总之，往生西方极乐世界之后，只有快乐，没有什么痛苦的。尤其是怙主阿弥陀佛和释迦牟尼佛在因地时大概转生做过国王和王子等，他们两位是这样恒时不分离而接触的。凡是释迦牟尼佛足下的弟子决定更容易往生。是这样的话，你们发往生极乐世界的愿，一定要好好去做！你们平时不要忘记这个，这是很重要的一件事…… <br>有些大德说我会住世九十五岁。这应该是不了义的说法。住不了很长时间是绝对的。常言说，多病是死亡的前兆。所以，说我住世很长，我也知道；说我住不了多久，我也知道。无论如何，对我个人而言，就只有一只老山羊住在世间的时间。",
                      "从一个角度说，多半这是最后的聚会，但愿不要如此，我们还能在将来相会……祈愿这一生也再再相会。但从另一个角度讲，我会离开人间的，在我离开人间后，我会不会回来呢？在我死后，有可能还没满七七四十九天，或者在母胎中还没住满九个月零十天，你们就认定所谓的转世活佛。但如果我的发愿和自己有个自在的话，我离开人间的无间绝对不会最初来娑婆世界，我想我离开这里能不能无间就往生极乐世界呢？因为在极乐世界面见阿弥陀佛，听到佛语，佛以莲花般柔软的右手放在我头顶上后，得到菩提的授记。从此之后，智慧、神通等获得自在，(这时)要作利益有情的事不会像现在这么弱小，而是有获得广大功德的时候，就像《普贤行愿品》那么讲的：“我于一切诸有中，所修福智恒无尽，定慧方便及解脱，获诸无尽功德藏。”在那时回入轮回的时候，方便、智慧、精进、禅定、神变等等获得自在，这时总的南赡部洲和雪域西藏尤其是康巴地区我自己住的这个色达，我以大悲心何时也不会舍弃的。如果我转生在三恶趣，那就没有自由了，除此之外，我往生到任何净土，我心里何时也不会忘记而舍弃自己的道场和寺院分院的所有弟子的(《纪念心的甘露》)。",
                      "<1><50> <i>  (九)愿边际 </i>   <br>这一颂要配在前面所有普贤愿的后面。偈颂以虚空等的五个比喻描述了无量愿的边际。五个比喻是虚空无尽、世界无尽、众生无尽、众生业和烦恼无尽。 <br>这一颂说：乃至虚空等穷尽之时，我的愿才穷尽。以虚空等无有穷尽的缘故，我的愿力恒时无有穷尽，念念相续，无有间断，身语意业，无有疲厌。 <br>我们知道，虚空是无穷尽的，虚空中的世界也是无穷尽的；世界是无穷尽的，世界中的众生也是无穷尽的；众生是无穷尽的，众生的业和烦恼也是无穷尽的。为了让尽虚空界的众生都消尽一切业和烦恼，都还归法界成就菩提，我的发心力和愿力永无穷尽。所以，总的所有的普贤愿都是无有穷尽的发愿。这和我们的真心——横遍竖穷的法界完全称合。总之，我们发普贤愿，愿愿都是无尽愿。 <br>讲到这里，大家要鼓起勇气来发愿，我们内有不可思议的普贤自性，外又有阿弥陀佛大愿的加持，往生西方极乐世界之后就能毫无困难地实现这一切。因此，人人都可发普贤愿，人人都成佛有份，不必畏惧、退缩。学佛成就的大小、快慢和心量大有关系。殷重地发普贤愿求生西方极乐世界，往生之后必定一生成就。希望大家对此生起信解。/ <br>51.  <i>  (十)愿利益 <br>分二：1、校量闻经利益 2、显示众行利益  </i>   <br>校量即比较衡量。闻经指听闻《普贤行愿品》的讲解。众行指缘《普贤行愿品》作书写乃至修习的十法行。 <br> <i>  1、校量闻经利益 </i>   <br>听闻《普贤行愿品》的功德，本来无法言表，那怎么显示它呢？这里经中以惯用的手法首先假设一种极广大的财供养作为校量对象，然后通过和它比较来衬托听闻本经的功德。",
                      "首先举出校量对象：  <br>这里的财供养，从供养的物品、对境、时间三方面作观察，供养物极其丰富，包括充满十方刹海的庄严众宝和最殊胜的人天安乐，也就是，十方无边刹土中有多少极微尘，就有那么多的世界，在这些世界中都充满了金、银等七宝，加上种种人天最胜妙的安乐，作为供养的物品。这些供养物品供养谁呢？供养十方不可说不可说佛刹极微尘数世界中的诸佛，和十方不可说不可说佛刹极微尘数世界中以人、天为主的众生。这样供养多长时间呢？经过不可说不可说佛刹极微尘数的劫数，相续不断。这是极广大的财供养，供养物、供养境、供养时间都大到极点。 <br>众所周知，一时间以一种供品供养一尊佛都有极大福德，何况供养的物品、对境、时间这么广大，三方面和合起来，必定会产生极大的功德。  <br>下面就以这种大供养来衬托听闻本经的功德。",
                      "<1><52>如果这部超胜一切下乘的大愿王一经耳根，能暂时生起一次清净信心，对于最殊胜菩提的因果之相，内心渴望仰求，那么由心与愿王相应就能获得远远超过前者的功德。 <br>“生信”是指对殊胜愿王的内涵，心中没有丝毫怀疑，确信“决定是如此的”。 <br>(我们具有普贤自性，如同种子。承载着普贤行愿法义的经文就像雨水，一旦融入我们的心田，就会迅速熏发本具的佛性善根，令普贤自性很快苏醒过来。由此所得的功德远远超过财供养。)",
                      "长行文讲得更惊人，闻经生信的功德不但超胜前面的大供养，而且无数倍地超胜。长行文说：“若复有人，闻此愿王，一经于耳，所有功德，比前功德，百分不及一，千分不及一，乃至优波尼沙陀分亦不及一。”上面那么大的供养却比不上闻经功德的百分之一、千分之一乃至优波尼沙陀分之一，就像人间高耸入云的摩天大厦，比起色究竟天的天宫来，大大地相形见绌。 <br>这样比较就明显衬托出受持《普贤行愿品》的功德。前面，供养境是十方刹海中的诸佛众生，物品是充满十方刹海的精妙七宝，时间是不可说不可说佛刹极微尘数的劫数。而这里单从数量上看很不起眼，所缘境只是一品经文，听讲的时间只是一历耳根(比如听讲一遍也就几十个小时)，但从所得利益上衡量，却无数倍超胜了前者。为什么会这样呢？因为普贤行愿的内涵极为深广、圆满，加持心性的作用深妙难言，如果能对普贤行愿生起一次清净信解，内心渴求最殊胜的佛果境界，这种法行的利益远远胜过财供养。",
                      "再看经中这句——“能生信解，求胜菩提心渴仰”，这是获得殊胜功德的必要条件。具体是指，听到普贤愿王的文句内心欢喜，在如理忆念了普贤行愿的意义后，对最殊胜佛菩提的因果之相内心随喜，深深地信解，像这样，哪怕生起一次清净信解，就获得极殊胜的功德。这是我们凡夫经过一番努力就可以达到的。 <br>能和普贤行愿结缘，不论念诵、讲闻，都有很大功德，但更重要的是，要从自己内心发起对普贤行的胜解信、欢喜心、希求心，这种珍贵的善根哪怕能显发一次也极可贵。如果能以信心长期随文发愿串习，那就会产生极大利益。总之，需要在根本上用功，能这样真实行持，经中的利益就会在自身上现前。",
                      "麦彭仁波切的《普贤行愿摄义》中有两颂能给我们极大的鼓舞。偈颂说：“周遍无量法界中，因及普贤行之相，此为无等佛行传，思则千叶信莲开。何人一次信解此，广大福藏金云聚，尽虚空际常安住，知此义者何不趣？”“因”是指前面礼敬等七支。不论七支，还是后面无量的普贤行，都是以周遍无量法界的方式显现的，这实际是无等佛陀从因至果的行为传记。什么是佛境界？什么是菩提行？普贤行就是最充分地展示。如果能对它善加思维，信心的千叶妙莲就会盛开。注意“思则千叶信莲开”，怎么让信心的莲花盛开呢？方法就是思维。谁肯用心思维，信心的莲花就会绽放。谁能对此普贤行愿生起一次信解，广大福德藏的黄金云聚就会在虚空未尽之间恒时安住。黄金品质稳定、价值昂贵，表示富贵和永恒。这是比喻描述对于普贤行愿生信能获得在虚空界尽之间无有穷尽的广大福德。了知了这些大义之后，我们为什么还不趣入呢？ <br>以上只讲到了听闻这一项法行的利益，实际上，不但是听闻，缘本经作任何一项法行都有大利益。下面就讲总的十法行的利益。",
                      "<1><53> <i>  2、显示众行利益。分二：(1)五种果 (2)究竟果。(1)五种果。分五：①增上果 ②等流果 ③离系果 ④异熟果 ⑤士用果。①增上果 </i>   <br> 增上果是指对本经作十法行具有远离恶趣、恶友、亲睹如来等的增上作用。 <br>这里，“恶知识”是指不信三宝和具有邪见等的不善友伴以及退出大乘趣入小乘的友伴。 <br>这一颂说：具有清净信心的人通过作意普贤行愿的涵义能发起普贤愿，并如理地随顺修习，以此因缘就能远离诽谤正法、违逆善知识、毁犯福田等的恶趣业因，从而远离一切恶道，并能恒时远离恶知识。在远离了恶知识和恶道之后，很快能见到具有圆满智悲力的阿弥陀佛，以佛加持，速能具足普贤最胜行愿。",
                      "这一颂讲到修持普贤行愿不但能远离导致恶趣的因缘——恶业和恶友，临终面见阿弥陀佛，而且，相续中如果有过去生积累的种种能感恶趣的恶业，也能摧坏彼等的感果功能，从而往生清净佛国。 <br>这里问一句：谁能恒时远离恶知识和诸恶道呢？谁能速见阿弥陀佛而具足普贤愿呢？就是那些通达普贤愿王的文义并能真实受持的人。 <br>②等流果 <br>等是同等，流是流类。就像下游水和上游水是同类那样，果是因的同等流类，叫做等流果。具体有：一、身口意的造作方式前后相似，果位的造作是因位造作的同类，叫造作等流；二、果的领受方式和因的造业方式相似，叫做领受等流。 <br>等流果体现了缘起律不错乱，即因果是非常有规律的。什么规律呢？两种规律：一、行为习惯的同类性，即原来身口意是以哪种方式造作，后来也会以同类方式造作(造作等流)。举例说，一个人过去习惯于说谎，以等流的作用，现在一张口就是谎言。二、领受果报的同类性，即不论造什么业，都会领受到同类果报。古人说：“出乎尔者，反乎尔者。”(发出什么，反过来就得到什么，叫领受等流。)浅近地讲，你给别人一个善意的微笑，对方也会回报你一个微笑。或者，这一世杀人，来世也被人杀。推展开来，造任何业在领受回报上都符合这一规律。 <br>总之，要懂得万法唯心，发出去什么样的心、心量有多大，领受的也必定是同类的果报，果报的量随着心量的大小而相应地显现。缘起如此公平精确，令人震惊。了知了这一规律后，就会对受持普贤行愿具有无量、不可思议的等流作用不再怀疑。",
                      "<1><54>下面看修持普贤行愿会得到怎样的等流果呢？  <br>“此人”是指对于普贤行愿具有胜解的人。“寿命”是指由宿业力所感的异熟果。妙善的人生，遍满善行的人生，有意义的人生，叫做“胜寿命”。 <br>关键要认识到，普贤愿王是能随愿出生一切利乐的如意宝，因为获得了“她”，这一生就成为妙善的一生，来到人间充满了安乐吉祥。而且，得到愿王如意宝之后，就具有与普贤菩萨同等的缘份，也就是大圣普贤是如何做的，自己不需要耽搁很长时间就变得跟他一样了。 <br>下面从因果两方面解释“胜寿命”的涵义。",
                      "一、从因上解释： <br>圭峰大师解释：随学普贤行愿的人，不论随宿业感得多长或多短的寿命，由于这一生修习普贤殊胜行，没有虚度光阴，所以是胜寿命。相反，放纵身口意造作恶业，不能使身心调柔贤善，即使活上亿万岁，也只是令恶因辗转增长，使苦果无有穷尽，这样的人生就是劣寿命。 <br>以这个原因，《法句经》说：“人生寿命百岁悭贪增盛，不如能在一日割舍财物美色。人生寿命百岁享乐而不持戒，不如能在一日以清净心守戒。人生寿命百岁常常忿怒不忍，不如能在一日心怀喜悦不生嗔恚。人生寿命百岁懈怠懒惰，不如能在一日策励身心。人生寿命百岁不善驾御身心，不如能在一日善巧运作。人生寿命百岁时常心怀怯弱，不如能在一日勇猛具智慧力。人生寿命百岁不发善愿，不如能在一日发起四弘誓愿。人生寿命百岁不生一种智慧，不如能在一日慧性聪明敏锐。”这段经文总的是说：百年放纵三门不断加深罪业，不如一日修善获大利益。",
                      "【《法句经》云：“人寿百岁悭贪逾盛，不如一日割舍财色。人寿百岁乐不持戒，不如一日净心守戒。人寿百岁多忿不忍，不如一日含喜不瞋。人寿百岁怠惰不勤，不如一日策励身心。人寿百岁拙御身心，不如一日巧便运致。人寿百岁常怀怯弱，不如一日勇猛慧力。人寿百岁不起善愿，不如一日发行四弘。人寿百岁不生一智，不如一日慧性聪利。”】 <br>这样就知道，我们有限的人生只有精勤修集善行才有意义，在一切善中普贤行应该是最好的，它圆满含摄了一切最深广、最清净、最永恒的善行。我们有幸缘着普贤愿王殷重地念诵、发愿、实行，长期熏发心中的善根，以法性力、串习力，一定会形成深广无尽的普贤行，这使得我们的生命能最大量地摄取大义。缘着普贤行愿受持、串习，活一年有一年的胜寿命，活一月有一月的胜寿命，活一天有一天的胜寿命。如此而行，人生充满光明，充满善的力量，当然是“胜寿命”。",
                      "二、从果上解释： <br>按照领受等流来说，我们发出去怎样的心，就会领受到怎样的果报。仔细观察了普贤行愿每一条愿的内涵和作用就知道修持普贤行愿具有极广大的感召力，也就是修持普贤行愿，凡是受用大乘法中的顺缘——善知识、善道友、善处所、善资具等等，都会任运地摄受，一切应得的都能善得，因此是“善得胜寿命”。另一方面，种种能产生苦恼、能引发身心疾病等的恶因缘，以普贤行愿的转化力都能转为菩提心和修行的助伴。这样，这一生如法地修持普贤行愿，在诸佛菩萨的加持下，自然能迎来今生、来世的一切大义。 <br>我们一条条地观察普贤行愿的内涵，很容易就发现：在普贤行愿里具足了一切能摄受内外顺缘和转逆缘为道用的正因。观察到这一层，就深深地了知佛语谛实不虚。比如，在普贤愿中有出家持戒愿、不忘菩提心愿、代众生苦愿、不离善知识愿等等，按照这样发愿、行持，缘起必定随着愿轮往这些方面运转，以缘起力，普贤行愿所具有的能招感今生、来世一切善果的作用，自然会显现出来。普贤行愿不同于一般，这是极深广、圆满的因行，是能全面开花结果的因行！是能永远开花结果的因行！",
                      "这么圆满的普贤道，包含了成就无边善果的善愿，受持它必定会出现无量的好因缘，领受无量的安乐果，所以说“此人善得胜寿命，此人善来人中生”。 <br>“此人不久当成就，如彼普贤菩萨行”：这是讲修持普贤行愿的造作等流果。由修持普贤行愿，不久就会成就如同普贤菩萨那样的心、那样的行、那样的功德、福德。“不久”表达了成就的快速。这是甚深缘起的力量。由普贤行愿强力牵引，自相续按深广、无尽的方式运转，源源不断地流现广大的普贤行海，就会成就难思难议的道果！这是以如海万行直趣大方广的佛果！",
                      "“如”表示果随因行，即因地由普贤行愿摄持辗转运行，果地则成就与普贤无二的愿、行、果。所以，修持普贤行愿的果就是成就普贤行。能以这样深广的因行持续熏修，自然串习成普贤的大愿大行。从这个意义上说，修持普贤行愿实际是把自己造就成普贤菩萨，推动千万人同修就是让千万人成为普贤菩萨。 <br>归纳地说，上面的等流果，从暂时到究竟之间会接连不断地产生，也就是，以今生为起点，凡是受用大乘法的一切顺缘、一切意乐、一切加行，都能辗转不断地提升，融入诸佛菩萨的加持，轻而易举就成就今生、来世的一切义利，很快获得对于地、道的最胜通达。",
                      " <i>   ③离系果 </i>   <br>“离系”是脱离系缚的意思。以修持普贤行愿的力量能脱离罪业、天魔、疾病等的系缚。我们末法时代的凡夫，障深习重，时常受内外违缘的困扰，如果能殷重地受持普贤行愿，以强大的行愿力能迅速灭除罪障，从种种系缚中解脱。",
                      "<1><55>这一颂是说：往昔以无明为根本因所造的极恶五无间罪，依靠持诵普贤愿王的力量，一念就能无余消灭。 <br>这是讲，对往昔以无明造下的五无间罪，有很深的忏悔心，在忏悔心中深深地信解普贤行愿，对于愿王殷重地受持、读诵、听闻等，就能灭除罪障。长行文说：“或复有人以深信心，于此大愿受持读诵，乃至书写一四句偈，速能除灭五无间业。所有世间身心等病，种种苦恼，乃至佛剎极微尘数一切恶业，皆得消除。”",
                      "“五无间罪”，如前文所释。“极恶”指造罪性质极恶劣。为什么会造下极恶的罪业呢？推究其因，是由于对什么应取、什么应舍没有抉择的智慧力，以业果愚而造下的。那么怎样除灭此罪呢？只依靠小乘法作对治，法的深广度不够，无法快速除灭，但是以甚深信心持诵普贤愿王，却能一念间就灭除无余。“灭”是指分毫不剩地净除罪业感果的功能，就像烈火焚烧种子，无余摧毁种子的功能一样。 <br>问：以五无间罪的业力需要长劫感受大苦，怎么能短短一念间就消灭呢？ <br>答：这里关键要认识到，对治法的方面，普贤愿王是周遍法界、圆具万善、永恒无尽的愿海。尽管五无间罪业力极大，但极法界量的普贤行愿远远超过它，所以对愿王生起甚深信解之后，以信心如法诵持，一念就能灭罪无余。可见修持普贤行愿具有极神速的灭罪效力。",
                      "再看：极重的五无间罪尚能在一念间灭尽，其它更轻微的罪障、疾病、苦恼，当然更能灭除。我们细心地体察就会发现：受持普贤行愿能使人心迅速升华，正气充满天地，由此能迅速摆脱烦恼、违缘、罪障，具有极强大的净障力量。 <br>真心持诵普贤愿王，身心当下会有得到净化的感受，比如全身汗毛竖立，强猛地发动善心，内心洋溢正气、充满欢喜等等都是净化的好相。以持诵普贤愿王的力量，身心、环境都会往好的方面转变。但要努力做到“如法”二字，就是要能清晰地忆念普贤行愿的涵义，内心有很深的信解，然后念诵、受持，一条条领纳在心中，就能净除无间业障。",
                      "<1><56> <i>  ④异熟果 </i>   <br>“异”是异时、异处、异性，“熟”是成熟。业的果报异时成熟、异处成熟、异性成熟，所以叫做异熟果。比如，今生缘普贤行愿修持，来世成熟善果，是异时成熟；此处修持普贤行愿，彼处成熟果报，是异处成熟；修持普贤行愿时是善的体性，成熟果报时不属善，不属恶，是无记的体性，是异性成熟。 <br>修持普贤行愿有很多方面的异熟果，这里列举了种姓、相貌、智慧三方面。“族姓种类”指所出生的家族种姓。“容色”指皮肤的颜色。“相好”指身体的相貌。“智慧”指对所知明处无碍趣入的心。 <br>修持普贤行愿，来世会有圆满的出身、相貌、智慧等等，会获得具足方方面面德相的人身。也就是，由修持普贤行愿的作用，未来一切生会得到种种圆满，不论受生人间、天上，一诞生，就拥有国王种姓那样的高贵种性，受人尊敬爱戴；而且，相貌庄严，具有金色等的肤色，头如伞盖、四十齿齐密、广长舌等的相好，让人一见即心生悦意；而且，对于内明、声明、医方明等的明处，具有无碍趣入的智慧。",
                      "我们常说暇满人身得之不易，它是集无数善业因缘而成的果报，比盲龟值木还难得。那么，怎样得到最善妙的人身呢？受持普贤行愿就是一大秘诀。以它为因，不止获得一般的暇满身，而且能获得圆具德相的极妙人身。按一般方法，希求好的种姓、相貌、智慧等，要修持各自相应的善法，比如希求财富，要修财布施；希求相好，要供香、花、灯烛；希求高贵，要修恭敬的行为等等。这样，求一果修一善，是一个个地修。但普贤行愿是万善总集，含摄了善愿无量的支分，而且每种发愿都极法界量，所以，按照《普贤行愿品》读诵、受持，能熏发心性中本具的一切善，是这么圆满地修因，当然感得族姓、相好、智慧等一切圆满。所以，以受持普贤愿王的力量能得到具足德相的人身。",
                      "⑤士用果 <br>士指人，用是作用。修持普贤行愿有哪些作用呢？ <br>修持普贤行愿的作用：诸魔外道无法撼动，堪为三界所应供养。 <br>“不能摧”，是指如果受持普贤行愿，不论做什么善根，诸魔都不能障碍，外道的种种邪见都不能染污。“三界所应供”，即凡是受持、开演普贤行愿的人，都成为三界人天的供养境。",
                      "「诸魔外道不能摧」 <br>诸魔指对菩提道作障碍的邪魔，外道指误入邪道的人。前者是故意障碍菩提道的行者，后者是自己没走正路，见解和行为不纯正。不论邪魔、外道，对于受持普贤行愿的行者，不但不能障碍他的道业，还会被他的福慧力所摧伏。所以，受持普贤行愿能对自身起大护持，自己具有大威力，诸魔外道就无法干扰。 <br>实际上，这都是普贤愿王所化现的。持什么样的法就成什么样的人，持邪法就成恶人，修正法就成善人，受持普贤行愿就成为普贤菩萨，大雄、大力、大平等，没有狭隘、没有偏执、没有邪恶，在这样的普贤行者面前，诸魔外道无法侵入。 <br>其实，内心有邪恶、有颠倒、有偏执，才会被邪魔外道扰乱。修持普贤行愿，能令善心充分地显发，能遣荡一切邪执黑暗，昭廓智境，放大光明，所以邪魔外道不仅不能障碍，还会被普贤行愿的力量所摧伏。 <br>「堪为三界所应供」 <br>为什么修持普贤行愿能成为三界人天的供养境呢？这是由愿王的力量而使行者上升到极崇高的地位。法和人息息相关，法越尊贵，行法的人就越尊贵。普贤愿王深广无尽，远远超过世间狭小、短浅的心量，只要如法按愿王修持，顿时就超胜人天，成为极尊贵的身份，三界有情都应礼敬供养。 <br>比如，帝释天、大梵天等天主具有威德、受人供养，但他们因地只修持十善业和四禅，远远比不上修持普贤行愿，他们只为一己寻求三界安乐，根本没梦见过像普贤行愿这么深广的愿，比如一刹那没有想过要发愿周遍法界供养诸佛，没有希求过现见一尘中有尘数刹，一一刹有难思佛等等。普贤行愿深广、无尽，即使合集世间所有的发愿也不如它的一分，由于普贤行愿无上尊贵，三界有情都应该供养受持普贤行愿的行者。 <br>比如，世间的太子刚刚落地就已经贵压群臣，连功勋卓著的大臣都要向他磕头，原因就是他将来会做天下的帝王。同样，一个人修持普贤行愿，将来就会显发自性普贤的无量功德而成佛，所以三界有情都应供养。",
                      "<1><57>(2)究竟果 <br>这一颂以“坐道场”、“降魔众”、“成正觉”、“转*轮”四相为代表，说明修持普贤行愿的究竟果是速成无上菩提。 <br>颂文说：如果以普贤愿王为本愿，这是超胜下乘不可计数倍的无上妙法，因此在迅速升进、圆满地道之后，速疾到达菩提树王下，在狮子座上结跏趺坐，以十地末尾金刚喻定降伏所有种类的魔军，获得无上正等正觉。成佛之后，应梵天、帝释天拿*轮和海螺劝请，转甚深、广大*轮，普遍利益众生。",
                      "“速诣”，表示成就快速。“菩提树王”指佛果。以普贤行愿如意宝极大量地积累福德资粮，很快就到达菩提树王之下。从恒顺众生来说，“以大悲水饶益众生，则能成就诸佛菩萨智慧花果”，普贤行愿念念下化众生，以大愿力能速疾成就诸佛智慧。或者，按照《宝性论》的两句——“若以彼彼善缘力，则得成就大树王”来解释，以普贤行愿能迅速圆满福慧资粮，以强大的善缘力很快就开显佛性，所以说“速诣菩提大树王”。",
                      "<1><58>(十一)劝受持 <br>具有信心的人对这部《普贤行愿品》静心披读、高声朗诵、在自己心中受持文句、为别人开演经文涵义，乃至研讨、思维、修习，以此将获得不可思议的出世间圆满，唯有佛能证知其果报之量，其余阿罗汉、菩萨等都不能了达此福德的边际。毋庸置疑，这决定是能获得无上菩提的最胜方便，大乘佛子应对佛的语言远离疑惑，随顺信受。 <br>问：为什么此法行果报连阿罗汉和菩萨也不能证知呢？ <br>答：“一切唯心造，心真则事实”，随着心中真切地发愿，就会按所愿那样现前，而那样现前时，就会获得相应的利益。比如，发愿常能值遇善知识、恒时令善知识生欢喜心，如果发起了真实的誓愿，就会按照誓愿去实行，也就会现前所愿的境界——常常值遇大乘殊胜的善知识，值遇之后一心做令善知识欢喜的事，这样就能得到与此相应的大利益。其它如常得出家修净戒、恒不忘失菩提心等的无量愿，都是如此。明白了这一点，再看普贤行愿，包含了菩提道从因至果如海的行持，每一愿都称法界心、普于十方三世周遍行持，当普贤行按照所愿那样一分分地现前、直至最终一切都毕竟圆满，这从始至终的修行境界与利益，除了佛之外，谁能测知其量呢？所以都不能了达对本经作十法行的果报边际。",
                      "问：为什么佛能证知呢？ <br>答：佛的智慧能现量照见十方三世一切现象，一个人缘着《普贤行愿品》作某些法行，从最初到成佛之间辗转出生的无量行持和利益，一切都显现在佛的眼前，所以佛是现量证知的。 <br>这句“决定获胜菩提道”是关键，意思是说，缘着《普贤行愿品》作十法行，一定能获得最殊胜的菩提果，或者说，这决定是能获无上菩提的最殊胜的方便。“决定”二字说得斩钉截铁，没有不成立、不确定的。为什么能这么肯定呢？因为这是佛智现量照见的缘故，佛语无任何欺诳的缘故。 <br>总之，说“决定”目的是要我们无怀疑地信受它。这是关键之处。为什么呢？因为能不能坚定地受持《普贤行愿品》，就看是否真的相信这是成佛的最殊胜方便。真的信解了这一点，会不受持《普贤行愿品》吗？比如，一个人要去某城市，当他见到最好、最快的路是哪一条时，他会不选择这一条路吗？同样，一个人真正信受了修持普贤行愿是成佛的最胜方便，他一定会精勤地对此闻思修，一定会在做善法前后依靠念修《普贤行愿品》来积资净障、发愿印持，而且会长期这样行持。",
                      "还有一层意思：上面别别讲解了对本经作十法行的暂时和究竟利益，到这一颂就以“果报唯佛能证知”这一句总结性地说明了受持普贤行愿有无量不可思议的功德。 <br>《梦游集》中有一篇短文讲一个沙弥刺血书写《普贤行愿品》作为终身持诵的法本，憨山大师勉励他说：“沙弥苟以如是书写，如是持诵，尽命不懈，则心心不出普贤行海，步步不离华藏道场。但当谛信不疑，此外别无佛法。如是，则老人如法界而称叹，亦未能尽功德之量。如其自昧本心，动与法违，纵亲见愿王，犹然重增业识耳。”(沙弥如果以此书写、持诵，尽这一生坚持不懈，那就心心不出普贤行海，步步不离华藏道场。只应当谛信不疑，此外再无佛法。果真如此，老人我即使按法界量来赞叹，也说不尽这功德之量。如果自己迷昧本心，动则与法相违，纵然亲见到愿王，也只是再增业识而已。)",
                      "我的家乡壤塘有位深克喇嘛，法王很赞叹他。以前大德认定他是米拉日巴尊者的秘密化身。我们那边死了人请他修法超度，他总是说：“我其他不会念，我只会念《普贤行愿品》。”然后他会慢慢地念上一遍《普贤行愿品》，他的一生就只念这一部经。 <br>我还记得嘎丘喇嘛的传记。他在文革期间每年都是被当地人批斗的对象。在艰难的困境中，他老人家转逆缘为道用，他自己心里是这样安排的：在批斗的当天，我首先发清净的菩提心，之后就发誓愿。然后，不论他们对我打骂、呵斥，或者作其它恶行，我不让心中生起丝毫的嗔恚。不仅如此，为了让他们获得利益，我还要尽量以清净的发愿来印持，而且在被拉到批斗的现场之前，我要能悄悄地念一遍《普贤行愿品》。后来，嘎丘喇嘛果真是这样做的，只有一次，被人拉扯得厉害没有念完《普贤行愿品》。文革之后，当地有个别人到他面前来忏悔时，他说：我已经以清净的发愿力作了摄持，你不会有过失。",
                      "<1><65>下面讲有关十法行的内容： <br>十法行就是一切圣法修行方式的总纲。所谓学法就是行持这十种事。其实，十法行就是闻思修，只是开合上有广略，通常说书写、供养、施他、听闻、披读、受持、开演、讽诵属于闻慧所摄，思维和修习属于思慧和修慧所摄。 <br>以十法行或者以闻思修三慧的方式作意会起到什么作用呢？弥勒菩萨说：“此增长善界，入义及事成。”(《辨中边论》)就是说，对于大乘法以闻慧作意能增长善根界，也就是能增长大乘种性的功德；以思慧作意能深入法的义理；以修慧作意能圆满成办大乘道所希求的一切事。",
                      "总的认识了以三慧作意的作用，再扣到主题上来，对本品作闻思修，由于作意的境是普贤行愿，以闻慧作意，能广大地增长善根，比如这次如法地听了讲解，大家的大乘善根都得到了增长；而且这次讲得比较详细，着重以思慧对法义作了一定的观察，确实通过观察可以深入普贤行愿的义理。再能进一步以修慧修习普贤行愿，一切普贤行愿所希求的事最终都会实现。 <br>通过上面的观察就能断定，对本经作十法行有无量无边的利益，既有初期效应、中期效应，还有后效应、后后效应，从暂时到究竟之间会辗转不断地起作用，它的利益总共有多少，唯有佛才能证知。而且对于本经通过闻思修辗转不断地深入，最终除了成就无上菩提之外，不会有其它结果。",
                      "《辨中边论》还说：“行十法行者，获福聚无量。”意思是说，作十法行能得到无量福德聚，原因是：圣法是一切利乐之源，而且是超出三有世间的正道，所以凡是与它相关的作业都有极大利益，下至书写、听闻一偈，都超胜了一切世间善根。这是从总体上讲了作任何结行都能获得无量福聚。进一步从法的差别上衡量，法越殊胜，法行所获的福德也就越殊胜，普贤行愿是超胜下乘无数倍的深法，是能入不可思议解脱境界的圆满正因，法门极其深广殊胜，缘着它作十法行，所获得的福德应当是无量中的无量。",
                      "贤首大师在《华严三昧观门》中假设一个问题：众生修行时应当受持圣教，还是舍开圣教呢？ <br>一般多是笼统地回答，贤首大师分析得细致，他分了十种情况，把邪、正、真、伪、暂时和究竟讲得很清楚。十种情况是： <br>第一、有一类众生盲目无知，但他完全抛开圣教，只听信自己的愚痴心，师心自是(自己这颗愚痴的心，它怎么认为，就听信它的，叫“师心自是”)，而且还跟随恶知识，违背圣教而修行，玩弄种种花样、虚伪狡诈、欺骗别人，这一类属于是恶人。 <br>第二、又有一类也是违背圣教，他认为只要心质直就是出生死的要道，勤修苦行，终究没得到什么利益。 <br>以上两类都是舍弃圣教，不依义理修行。",
                      "第三类是只读诵圣言，却不了解法义，依靠圣教求名求利，违背口中所读的圣言，这也叫恶人。 <br>第四类，只是随逐文句，不知道其中所说的义理，只是以直心读诵，虽然没有虚伪、狡诈的心行，但也没多大利益。 <br>以上两类没有舍弃圣教，但也没获得义理。",
                      "第五类，读诵圣言，部分地了知解和行，多读诵文句，有少分的修行。 <br>第六类，广泛寻求经论，普遍地了知解和行。此后，归摄经论的要义，取得要点，专门作修持。 <br>第七类，受持圣教已有心得，专一在修行上，不再寻求文字。 <br>第八类，寻求经论领会其要旨，了知一切万法无一不称合法性。因此，对经教也不必舍弃，就是这圣者言教也称合法性，依教修行。 <br>第九类，常常受持称性的法教，既不舍弃也不耽著，恒时观照离开语言文字的真理，既不弃舍也不耽滞。 <br>以上五类还没有到究竟。",
                      "第十类，寻求经教，悟得实相，真理和言教之间没有妨碍，常常观照真理而不妨碍受持经教，常常受持经教而不妨碍观照真理，这时是理教圆融，合为一观，到此才算究竟。 <br>以上十类，前四类完全不能依从，后五类由浅至深随各人的根性悟入，但这是革凡成圣的方便，还没到究竟。只有第十门算是究竟。 <br>由上面的辨析就知道怎样真实地作十法行，怎样一步步地深入而到达究竟。 <br>下面以公案证明对本经作十法行具有殊胜利益。",
                      "一、书写 <br>古代僧人德园曾经修建了一所园林。他在园林中栽种了楮树，在楮树周围种上鲜花、香草。每一次，他都先行沐浴再进园林，用香水浇灌楮树。楮树长了三年，香气四处散发。后来他取楮树造纸，用纸写经，才写几行，字字都放光明。 <br>经典是殊胜的境，为了尊重法而精诚书写经典，功德极大。尤其这部《普贤行愿品》，字字承载着普贤愿王的妙义。经文加持写经人，写经人又以诚心加持所写经文，因缘聚合，令经文字字放光。写经不同于一般的书写，由发心和所缘境的不同，导致功德相差悬殊。",
                      "二、供养 <br>僧人法诚在太原篮谷修建了一间华严堂，里面画了佛讲《华严经》的七个处所和九次法会的图像，并兼带书写《华严经》，专精地供养。常常有一些瑞鸟，形状和颜色十分奇特，口衔鲜花飞进佛堂，旋绕供养。",
                      "三、施他 <br>僧弥伽多罗法师是狮子国证得三果的圣人。有一年，他来到西太原寺，听到僧众正在读诵《华严经》，忽然改变神色说：“我不知道此处也有大经！”然后合掌欢喜赞叹：“《华严经》功德难思难议，西域相传有人称赞此经，洗手的水沾到的虫蚁，死后都升天界，何况受持、读诵、思维、观察？” <br>赞叹《华严经》的人，洗手水沾到蚂蚁身上，都能让蚂蚁升天。可见法力不可思议。",
                      "四、听闻 <br>金刚菩萨说：“听此法门，如一切智行所集福德。”(由如法地听闻此法门，即获得如同一切种智所集的福德。) <br>我们知道，缘一偈圣法作十法行，功德超过一切世间善根，而且，在十法行中以所缘圣法的高下、深浅不同，所获得的功德也不同。这里，普贤愿王是含摄无量菩萨愿的愿海，愿愿称法界心、极法界量，因此一经心目就获得不可思议利益。",
                      "五、披读 <br>隋朝禅定寺的慧悟法师，平时受持《华严经》。他和一位受持《涅槃经》的僧人在终南山结伴隐居，住在山岩上以树果为食，各修法业。 <br>后来有人请应供，两人互相谦让。斋主说：“恭请修持华严的慧悟和尚。”这样慧悟就跟着斋主前去应供。实际上，来邀请的人是个山神。这次斋会有一千位阿罗汉应供，他们都推举慧悟坐在首位。供斋结束，山神叫一个童子服侍慧悟和尚，童子当时就跳起来飞入和尚口中，和尚因此获得了神通。 <br>慧悟和尚回来取经本，告别同修后，在虚空中越走越高远，最后消失在天际。",
                      "六、受持 <br>有位辩才法师曾经随裕法师学华严，很长时间没有开悟。于是，他安住在一间净室中专心用功。三年后的某天夜晚，他梦见普贤菩萨指点，醒来就通达经义，像看镜中自己的面部一样清楚。 <br>七、开演 <br>北魏译师勒那摩提三藏是中印度人。他到中国后精通了汉语。在他讲《华严经》期间，忽然来了一个人，手拿奏版，像是天官。这人对勒那三藏说：天帝派我来请法师讲《华严经》，都讲[1]、维那[2]、梵呗[3]需要一起去。 <br>勒那三藏说：讲完经再去可以吗？使者同意。 <br>讲经完毕，勒那三藏和都讲等人忽然在法座上圆寂，大众惊叹景仰不已。 <br>华严宗三祖法藏和尚，十七岁辞别父母入太白山求法。后来因为母亲生病，回家探亲。当时，华严宗祖师智俨和尚在终南山边上的云华寺开讲《华严经》。时至深夜，法藏大师忽然见一道神光照亮了佛寺屋宇，他知道里面必有高人。天亮时遇上智俨和尚，就拜他为师跟随他学习，深入《华严》的甚深旨趣。",
                      "八、讽诵 <br>古代甘肃平凉附近有位樊玄智，依止当时的杜顺和尚持诵《华严经》。因为诵经，口中多次得到舍利，前后共出现几百粒。 <br>九、思维 <br>有位解脱和尚在五台山的佛光寺修建了一座精舍。之后，安住在精舍中读诵《华严经》，并依经法作佛光观。他祈求文殊菩萨，文殊菩萨现身对他说：“你何必礼拜我？你应忏悔自责！” <br>后来他自行求法证悟无生，就想礼拜诸佛请诸佛印证。当时感得诸佛现身说偈：“诸佛寂灭甚深法，旷劫修行今乃得，若能开晓此法眼，一切诸佛皆随喜。”(诸佛寂灭戏论的甚深妙法，经过长劫修行，今天终于得到了。若能开启这甚深实相的法眼，一切诸佛都为之欢喜。)他问：“诸佛寂灭之法，要怎样宣讲来教导众生呢？”诸佛顿时隐没不现，只听见空中说：“方便智为灯，照见心境界，欲究真实法，一切无所见。”",
                      "十、修习 <br>僧人道英法师，安徽毫州人士。十二岁时，家人为他成亲。成家后，他和妻子同居了五年，不染世俗之事。后来因为听讲《华严经》，出家到太行山的柏梯寺修习止观。 <br>有一年，久旱不雨，他专心讲解《华严经》。讲经期间，有两个人从听众中走出来说：我们是海神，特来恭听法师讲经。他就命海神降雨，立即大雨滂沱。 <br>隋朝灵干法师开讲《华严经》，住在兴善寺，常作兜率观和华严观。到他临终时，天上派天童下来接他往生。他没有去，他说：“我的志愿在毗卢遮那华藏世界。” <br>接着他见空中大水弥漫，水中充满了莲花。他欣喜说道：“果然满我所愿。”说完辞别同寺的童真法师，之后就往生了。",
                      "“诵”字代表十法行。普贤菩萨的行叫做普贤行，是具有种种广大功德的行。希求成就普贤行的发愿，叫做普贤行愿。 <br>普贤菩萨说：如果有人对这部普贤行的愿文讽诵等，我说他以少分的善根能够在一刹那间令一切行愿都圆满，令一切众生所发的清净善愿都获成就。 <br>长行文讲：“是故，汝等闻此愿王，莫生疑念，应当谛受，受已能读，读已能诵，诵已能持，乃至书写，广为人说。是诸人等于一念中，所有行愿皆得成就，所获福聚无量无边。”",
                      "最后一句“成就众生清净愿”，“众生”包括自他，如果指自己，则是能成就自己的清净愿；如果指其他众生，可解释为：以普贤行愿的力量能在烦恼大苦海中拔济众生，把他们都接引到极乐世界，一旦往生极乐就能成就众生所有的清净愿。清净愿就是与善法相应的愿，拣除不清净的恶愿。往生极乐之后，以阿弥陀佛愿力的加持，一切暂时和究竟的善愿、利益众生、成就菩提的善愿都能圆满实现，所以说“成就众生清净愿”。 <br>有人问：怎么可能“一念一切悉皆圆”呢？这要懂得圆顿教的特点。什么是圆顿呢？就是在一念相应时一切都圆满成就，好比染东西，一时间染缸里所有的东西都染成了。由于我们的心性本具万德，这个本有的性体就是诸佛的法身，所以在一念相应时就圆满成就了。《净土生无生论》说：“一真法界，即众生本有心性，此之心性，具无量德。”“故众生本有性体，即诸佛所证法身。”“而此心性，竖贯三际，横裹十虚，佛法、生法、正法、依法、因法、果法，一念圆成。”(“生法”指众生的心。“正法、依法”指正报的法、依报的法，即情器诸法。)由于我们本是自性普贤，具足恒沙性德，所以能受持普贤行愿，一念中就圆满所有行愿，丝毫没有欠缺。 <br>民国江味农居士往生前对道友蔡济平最后留语说：“修持以普贤行愿为最要。” <br>清凉国师赞叹《普贤行愿品》：“而为华严关键，修行枢机；文约义丰，功高益广；能简能易，唯远唯深；可赞可传，可行可宝。”",
                      "<1><66> <i>  (十二)总回向 </i>   <br>这是总的回向祈愿一切众生都获得究竟安乐。 <br>这一颂说：我对普贤行愿作了闻思修等的殊胜法行，由此产生的无边无际的殊胜福德，一切都回向祈愿：所有沉溺在生死瀑流中的众生都速速往生阿弥陀佛的最胜刹土。 <br>所谓回向，回是回转，向是趋向。把所修集的善根回转趋向于所希愿处，叫做回向。我们作回向，心里要明确三个方面——所回向的善根、回向的地方、回向希求成办的事。这里，回向的善根是修持普贤行所获得的无边胜福；回向的地方是所有沉溺在生死瀑流中的众生。这样回向是为了圆满成办众生利益，让他们快速往生阿弥陀佛的净土。 <br>以下分四段解释：一、普贤殊胜行 二、无边胜福 三、沉溺诸众生 四、速往无量光佛刹",
                      "一、普贤殊胜行 <br>普贤行是无有前后际、甚深、广大的体性。“无前后际”，是指时间上没有穷尽的边际——虚空界尽、众生界尽，我愿乃尽，以虚空界、众生界无有尽故，我此愿王无有穷尽。“甚深”，指普贤行的境界深邃，心思不及，言议不到。“广大”，指普贤行横遍竖穷，周遍时空，而且圆满含摄一切种类的善行。 <br>普贤行以深广、无尽的内涵超胜一切，所以是殊胜行。把以上普贤殊胜行即长劫所积累的普贤行都作回向。",
                      "二、无边胜福 <br>就是由普贤行所获得的福德。“无边”指乃至虚空界尽之间，福德资粮不会有穷尽之时。“殊胜”指超胜其他一切世间善根。善根有大小等的差别，就像商品有优等、劣等一样，比如意乐上有强猛、有微弱，所缘上有广大、有狭小，持续时间上有长久、有短暂，诸如此类，造成善根有无数差别。按心识的行相来衡量，世间善行根本不如普贤行这样深广周遍，永恒无尽，因此，普贤行的福德是无边际的胜福，远远超过一般福德。 <br>印度释迦知识的注释中讲了普贤行福德殊胜的三个原因：一、这是为了众生以无量方便在无边时间中所积累的福德；二、这是能成就一切种智的殊胜正因；三、这是以无缘智慧摄持而积累的福德。以这些原因，福德的量极大，是无边的胜福。",
                      "有人问：上面说的是大菩萨的普贤行，我们只是对普贤行发愿希求，对《普贤行愿品》读诵、受持等，我们能否获得无边胜福呢？ <br>答：不必怀疑。讲愿利益时已经多方面显示了对《普贤行愿品》作十法行有无边福德。弥勒菩萨的《辨中边论》在辨明大乘的无上相时，讲到大乘的正行无上、所缘无上、修证无上，三者的关系是：由无上所缘，引生无上正行；由无上正行，引生无上修证。联系到这里，关键要领会所缘、法行、福德三者的关系，即：所缘殊胜，法行即殊胜；法行殊胜，福德即殊胜。",
                      "大家学习过世间各学科的知识，也按所学知识作过各种工作，现在又学习佛法，按佛法作种种法行。对比世间法和佛法，会明白这两种法在所缘、法行、福德上大有差别。 <br>比如这次学习《普贤行愿品》，大家的心所缘的是含摄无量菩萨行的普贤行，有甚深、广大、无尽的内涵。然后，心缘着普贤行，或者生起了信解，或者生起了对普贤行的希求心，按照无欺的缘起规律，都会得到广大的福德。心是随所缘而转的，善根、福德是随心而生的，其间有精确的对应关系，丝毫不会紊乱。再观察，按这样开展的心量、见识、志愿等，在学习世间知识时会有吗？决定不会有的。因为世间知识根本没有这样深广的内涵，单凭世间知识自身怎么可能引发像普贤行愿这样深广的善根呢？所缘的法不具备这样深广的内涵，也就不可能显发深广的善根。",
                      "比如，所缘是一门物理学或者世间伦理学，学习它也会增长一些见识，启发一定的善根，但绝不会有像学习《普贤行愿品》所产生的深远效果，根本原因就是导师的量不同、导师所宣说的法不同，两者的差距太大了。比如，学习物理学会对物质的组成、作用、规律等等生起较常人更深入的认识，会信解这个物质世界的运行是有规律的，但对于心性的本体、妙用、甚深的缘起等等，却一无所知，因此对开发佛性宝藏等，根本无能为力。 <br>又比如，没学过四谛法，就不会了解生死和解脱的缘起，也就无从引发出世间的善根——希求出离轮回、希求证得涅槃等的善根。这些在没有接受佛法的教育之前，是不可能自发产生的。",
                      "由以上的举例，智者们应当举一反三观察到诸如此类的差别和关系。总之，所缘法的内涵决定了法行所引生的善根品质。所缘法的深广度不一样，所显发的善心就不一样。世间的知识有多大量、是哪种深广度，学习者的心最多也只能到达那个层面、那个量上，完全被它自身的内涵限定了。所以，世间法与出世间法有明显的高下差别，不能混为一谈，以这个差别导致在作业上、在得果上优劣悬殊。这样就观察到，缘普贤行愿作十法行，福德远远超过其他世间善根，因为这是缘最深广、最圆满的道而运作的。",
                      "三、沉溺诸众生 <br>关键要认识“沉溺”的状况。众生有生老病死、爱别离、怨憎会等的很多痛苦，系缚在这些苦中，远离了安乐。就像瀑流是从遥远不见边际的地方流过来的，而且还在增长、相续，不仅截断不了，还不断产生后有。同样，无量无边的众生，因为造业而受生死苦，受苦时又造业，又引生后有，如此辗转相续，无法截断，所以如同瀑流。始终不能摆脱这种流转之苦，叫做沉溺。 <br>我们学好了《广论·中士道》的四谛、十二缘起，会对此生起深刻的认识。现在按“惑、业、苦”最略地观察，流转的缘起是：以我执生烦恼，以烦恼造有漏业，以有漏业感召生死。众生是继续转入生死，还是趣向解脱，关键看他在领受生死果报时生不生烦恼，流转和还灭的分界点就在这里。大家看，在领受苦报时，如果没有通达无我的智慧，那就仍然会以我执生起烦恼，以烦恼造业，以业感生死。这样就观察到，乃至没有通达空性之间，一定是“惑、业、苦”又“惑、业、苦”，这样相续就是无穷无尽的生死。换句话说，只要不发心求解脱、不修证空性，那生死一定会辗转地相续下去。这就发现，在无量无边的众生身上都同样存在着无边的生死之苦，只要他们不去证悟空性，那生死就不可能了结。像这样不能超出生死流转，就叫沉溺。意思是无法从结生相续中拔出来。",
                      "四、速往无量光佛刹 <br>通过上面的观察，我们已经认识到从地狱到无色界之间的无量无边的众生都沉溺在生死流中，都有不见边际的生死大苦，需要救拔。 <br>基于这种对苦谛的认识，我们应当把善根回向给一切在生死流中沉溺的有情。不只是恶趣众生、人间可怜的人，还包括那些有福报、生活快乐的凡夫；不只是此方的沉溺有情，还包括十方世界一切的沉溺有情。所以，我们应当发大悲心把所有的善根都回向给三有一切有情。",
                      "那么，怎么才能救拔众生呢？如果只把他们安置在善趣，这并不究竟，因为受生善趣并没有截断生死，从长远看，这和无间地狱并没有多大差别，因为在天界享尽了福报又会堕入地狱，往后仍然是无尽地生死。所以，真正的救度是把有情安置在解脱和成佛的果位。 <br>那么怎么来实现这个目的呢？依靠其它方式修行需要断尽烦恼才能超脱生死，走这条路的难度很大，千万人中难得有一两个成功。生死路险，一念贪爱，就会引发无边生死。所以这条路很难行，只要没从根断除烦恼，就逃不出后有，就要继续转生死轮。",
                      "那么怎样才能无困难地救度众生呢？最方便的法门就是接引众生往生无量光佛刹。因为以阿弥陀佛愿力的加持，只要众生具足信愿，持念他的名号，就能往生他的净土，往生之后就没有任何退缘，也就超出了生死，能速疾成佛。 <br>阿弥陀佛的净土具有不可思议的种种功德、无量无边，是极安乐的世界。它是无住大涅槃的源泉，能带给一切众生大利益、大安乐。以这个原因，把所有普贤行的善根都回向给尽虚空界的众生速速往生阿弥陀佛的净土，在一生中就超出漫长无际的轮回，在阿弥陀佛的座下速疾成就菩提。",
                      "下面讲大恩上师法王如意宝引导众生往生极乐世界的真实传记。这是这个时代不可不知的大事因缘，我们每个人都要有所了解。 <br>我们知道，当年在喇荣山门——就是迎接班禅大师的大草原上，大慈大悲的上师在这里开了第一次极乐大法会。当时参加法会的出家、在家人数，大略统计，达到了四十多万。以大恩上师不可思议的愿力感召，每个人都发愿念诵阿弥陀佛圣号一百万遍。",
                      "下面就把法王当年的一段开示原原本本地翻译给大家听。 <br>法王说：“今天萨迦月初一开极乐大法会，在这个吉祥的日子里，集聚的眷属数量这样庞大，这都是以业和愿力而在这里集会的，所以有很殊胜的缘份。我们有必要开极乐大法会，也有其中的原因。总的说，阿弥陀佛和释迦牟尼佛从因地时起，彼此的发心和愿力有很大的关系，因此以这个缘起力，释迦佛的弟子们发愿的话，容易往生极乐世界。特别说，《楞伽经》授记：‘南方碑达国，有吉祥比丘，其名呼曰龙，能破有无边，于世弘吾教，善说无上乘，证得欢喜地，往生极乐刹。’——以这些教证再再赞叹的吉祥怙主圣者龙树，这位凡是见闻忆触的众生都能接引至极乐世界的净土大祖师，来到印度圣地之后，把无数众生都接引到了净土，出现了这么一位。在这之后，清凉雪域西藏，又有一位净土祖师乔美仁波切自从来到人间后，凡是与他结缘的众生，下至家门口的狗和牦牛，都接引到极乐净土——是这样的大商主，他也曾经这样来过。到了今天这个时代，凡是以善恶业结缘的众生，死时没有困难无间就能接引到西方极乐世界阿弥陀佛的足下——能这样接引的重担就落到我们肩上了。",
                      "我本人从小时候四五岁起，就是这么想：‘凡是与我结缘的有情，我能不能接引到极乐世界呢？’后来，我得到大成就者第一世多竹钦仁波切香秋多吉(菩提金刚)在两百年前写的授记书，那里面说：‘单坚阿拉木天喇荣沟，邬金莲师化身名晋美，彼于菩萨四众眷属中，广弘显密教法如明日，利生事业顶天立地也，清净所化眷属遍十方，凡结缘者皆生极乐刹。’里面讲到我自己的名字、喇荣的地点、眷属弟子的种类以及出现的兴盛佛法和利益众生的情况，还有，凡是结缘众生都往生极乐净土的情况等等，现在我们亲眼这么见了，也没办法写出更具体的授记文字来——这篇授记在我手中拿到之后，我鼓起了百倍勇气。以后，我在各地大力倡导持念阿弥陀佛圣号，是这么做了的。再后来，带领一万余藏人到汉地五台山，大家一同为了往生西方极乐世界念诵了大量《普贤行愿品》。在这期间，有一天，正当大众念诵《普贤行愿品》的时候，我观察缘起。当时大众在塔院寺念诵《普贤行愿品》，法座安放在寺院里，我走到法座边上，左脚踏上法座的梯子时，大众正在念‘于诸惑业及魔境，世间道中得解脱’，在我上了法座的同时，刚好碰上念‘犹如莲花不著水，日月经行不滞空’(藏文直译)，从这里就形成了即使在五浊恶世期间利生事业也像日月不滞虚空那样无碍成就的圆满缘起。以后在印度菩提伽耶金刚座，多次配合积累资粮的供养，以《普贤行愿品》为主发了很多愿。但是，除了这次之外，没有开过极乐大法会。",
                      "这次以发大心和愿的力量，时机终于成熟。总共会有三次大法会，其中今天是首次开极乐大法会的吉祥日子，你们也是前来聚会的首座眷属。通常很多人发愿将来成为首座眷属，也就是这么一个。 <br>还有开法会安排的方式，过去有这样的传统，有的按照蒋扬钦哲旺波的传统，和《普贤行愿品》结合，开修持净土的法会；有的按华智仁波切的传统，和《极乐愿文》结合，开净土法会。我的上师当中，有些是按蒋扬钦哲旺波的传统开极乐法会，有些是按华智仁波切的传统。这次我们按照两位大德的传统，上午按蒋扬钦哲旺波的传统，在《普贤行愿品》的基础上共同修持净土，而且我们喇荣道场，平时的安排也就是这样的。还有，有时早上九点门措会下来，会作观音灌顶和种解脱种子的灌顶。大多数是我本人作往生净土的灌顶，而且以全知喇嘛仁波切的《净土教言》作引导，我会以轮番的方式给你们做。下午两点钟开始，按照华智仁波切的传统，在念诵《极乐愿文》的基础上引导讲解净土法门和讲解大阿弥陀经(即《无量寿经》)，是这样的。",
                      "你们每个人都要心里这样记住，开极乐大法会，除了这三次之外，并不是什么时候都开的。尤其是成为法会首座眷属、有这样殊胜缘份的时候，不要说很多绮语和散乱，还有为了经商和玩耍跑来跑去、争论、吵架——这些都不应该做。 <br>总之，大家应该对阿弥陀佛生起信心及猛利发愿求生西方极乐世界，要念完一百万阿弥陀佛圣号——这样做的话，临终不能往生，就算我欺骗了你们，不仅是我，连释迦牟尼佛和阿弥陀佛也成了欺骗你们，但他们是何时也不可能欺骗的。对于世尊的善说，应当要信解。",
                      "极乐世界的功德等等，在《大阿弥陀经》中有详细的宣说。法会这十五天，我每天下午都会讲这部经。因此你们会从中理解的。在这部经里也讲到“唯除毁谤正法和造五无间罪”，因此今后不要造大的罪业——杀生、谤法等等，否则没办法无间往生净土。在这之外，以前造的一切罪堕(应该忏悔)，在显教波罗蜜多乘当中，对谤法和五无间罪，没有说过能完全清净的方便，但在密教金刚乘中却有这样的说法，(就是)净罪的殊胜对治、再再赞叹的金刚萨埵六字心咒，如法持诵十万遍的话，连破根本誓言罪也能清净。有这样说的。而且，无畏持明洲提到，在贤劫时所讲的，劫浊时需要有四倍的念诵，按照这个观点，如法念完四十万遍金刚萨埵心咒，以上谤法和五无间罪也是按照可清净的说法在念诵心咒。因此，没有离开信愿而念诵阿弥陀佛圣号一百万遍和金刚萨埵心咒四十万遍，而且今后不造严重罪业——这样的话，能够往生西方净土，这一点我自己是有信解的。还有‘念诵百万佛号’也是托嘎如意宝、嘛呢喇嘛巴玛斯德、喇嘛多扎这些老人家的传统。”(《纪念心的甘露》)",
                      "在这之后，法王如意宝又分别在道孚和新龙开过第二次和第三次大法会，人数达到六十万和七十万以上。 <br>法王如意宝的宏深大愿就是接引一切有缘众生都往生西方极乐世界。比如法王在《怀业时语》中说：“今起我等师徒之会众，依于稀有总集之事业，怀柔心境善巧之方便，令众往生乐国我心语。”在《愿海精髓》中发愿：“一切贤劣业系众有情，此生命终往生极乐刹，获得无量光佛语授记，智悲力之威势愿圆满。”所以，我们每个传承弟子都应该随学法王如意宝的发愿，从现在开始，尽心尽力依靠怀业的方便引导众生往生极乐世界。我们在念修《普贤行愿品》这一颂时，不是在口头上，而是要真正从心里这样发愿。",
                      "【尔时，普贤菩萨摩诃萨于如来前，说此普贤广大愿王清净偈已，善财童子踊跃无量，一切菩萨皆大欢喜。】 <br>这时候，普贤菩萨在如来面前宣讲了普贤愿王的清净偈颂之后，当机者善财童子踊跃无量(就是欢喜地跳了起来)，在场的一切菩萨都生起了大欢喜心。(普贤愿王的利益深广无尽，所以一切菩萨听法后都欢喜无量。)",
                      "我们知道，善财童子是法王如意宝的前世。在普贤大士宣说这一品时，他是当机者、受持者，也是普贤行愿当之无愧的代言人。可以说，弘扬普贤行愿是法王生生世世的愿，所以今生来到人间之后大力地弘扬。比如，1987年朝五台山时引导大众大量持诵《普贤行愿品》，在印度金刚座号召西藏各派弟子共同持诵《普贤行愿品》。在法王住锡的根本道场——喇荣五明佛学院，法王把《普贤行愿品》作为大众念修的核心课程。比如，法王在传授大灌顶、在讲经说法、在讲授大圆满实修引导法要时，前后都念诵《普贤行愿品》。在法王的带领下，五明佛学院喇嘛、觉姆、金刚降魔洲、居士林四众区域，所有大堪布讲法的前后，中、小堪布辅导的前后，都以念诵《普贤行愿品》来积资净障、发愿印持。 <br>不仅如此，每年开各种大法会及平时给信众念经修福、给亡者念颇瓦法超度的前后，也都念诵《普贤行愿品》。各大法会四座修法前后，个人闭关实修四座修法前后，甚至开金刚娱乐法会的上下午，都要求念诵《普贤行愿品》。而且在法王愿力的感召下，四众弟子朝山、拜见高僧大德、在殊胜的三宝所依前、在放生前后，甚至到草原上放松一下身心见到鲜花对上师三宝作供养时，也一定要念上一遍《普贤行愿品》。 <br>当年很多人祈请法王给海内外的高僧大德写祈请长久住世文，法王的条件是写一篇需要念一亿遍《普贤行愿品》。当年写了那么多的祈请住世文，学院常住的弟子心中都很清楚。在我们心目中，至少共修了一百亿遍以上的《普贤行愿品》。 <br>这些事实，联系上面的经文观察，就知道有华严会上善财童子踊跃受持普贤愿王的甚深缘起。 <br>我们是法王的传承弟子，接受过法王的法脉传承，都和普贤行愿有甚深因缘。所以都应当随学法王如意宝，尽心尽力受持、弘扬普贤行愿。"
                    ]
                ]                   
            }
        ]       
    }       
}       